#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapIconHelpList

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.ExecuteUbergraph_WB_MapIconHelpList
// 0x0078 (0x0078 - 0x0000)
struct WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DB7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_MapIconHelpOne_C*>           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB8[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MapIconHelpOne_C*                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DB9[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList) == 0x000008, "Wrong alignment on WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList");
static_assert(sizeof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList) == 0x000078, "Wrong size on WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, EntryPoint) == 0x000000, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, K2Node_MakeArray_Array) == 0x000008, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, Temp_int_Variable) == 0x000018, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, CallFunc_Array_Get_Item) == 0x000020, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00002C, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x00002D, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, K2Node_Event_MyGeometry) == 0x000034, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000070, "Member 'WB_MapIconHelpList_C_ExecuteUbergraph_WB_MapIconHelpList::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_MapIconHelpList_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpList_C_Tick) == 0x000004, "Wrong alignment on WB_MapIconHelpList_C_Tick");
static_assert(sizeof(WB_MapIconHelpList_C_Tick) == 0x00003C, "Wrong size on WB_MapIconHelpList_C_Tick");
static_assert(offsetof(WB_MapIconHelpList_C_Tick, MyGeometry) == 0x000000, "Member 'WB_MapIconHelpList_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_MapIconHelpList_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.SetupList
// 0x0058 (0x0058 - 0x0000)
struct WB_MapIconHelpList_C_SetupList final
{
public:
	TArray<struct FMinimapIconHelpEntry>          Param_EntryList;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         SelectIndex;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkipInAnim;                                       // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_Buy;                                             // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DBA[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_SelectIndex;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_ItemIndex;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UiToDataIndex_DataIndex;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DBB[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MapIconHelpOne_C*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DBC[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpList_C_SetupList) == 0x000008, "Wrong alignment on WB_MapIconHelpList_C_SetupList");
static_assert(sizeof(WB_MapIconHelpList_C_SetupList) == 0x000058, "Wrong size on WB_MapIconHelpList_C_SetupList");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, Param_EntryList) == 0x000000, "Member 'WB_MapIconHelpList_C_SetupList::Param_EntryList' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, SelectIndex) == 0x000010, "Member 'WB_MapIconHelpList_C_SetupList::SelectIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, bSkipInAnim) == 0x000014, "Member 'WB_MapIconHelpList_C_SetupList::bSkipInAnim' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, L_Buy) == 0x000015, "Member 'WB_MapIconHelpList_C_SetupList::L_Buy' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, L_SelectIndex) == 0x000018, "Member 'WB_MapIconHelpList_C_SetupList::L_SelectIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, L_ItemIndex) == 0x00001C, "Member 'WB_MapIconHelpList_C_SetupList::L_ItemIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WB_MapIconHelpList_C_SetupList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WB_MapIconHelpList_C_SetupList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_UiToDataIndex_DataIndex) == 0x000028, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_UiToDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_Array_Get_Item) == 0x000038, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_Array_Length_ReturnValue_2) == 0x000044, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000049, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_GetSelectDataIndex_DataIndex) == 0x00004C, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_SetupList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'WB_MapIconHelpList_C_SetupList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.scrollDown
// 0x0010 (0x0010 - 0x0000)
struct WB_MapIconHelpList_C_ScrollDown final
{
public:
	int32                                         NewSelect;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_OldSelect;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ScrollDown_NewSelect;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpList_C_ScrollDown) == 0x000004, "Wrong alignment on WB_MapIconHelpList_C_ScrollDown");
static_assert(sizeof(WB_MapIconHelpList_C_ScrollDown) == 0x000010, "Wrong size on WB_MapIconHelpList_C_ScrollDown");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollDown, NewSelect) == 0x000000, "Member 'WB_MapIconHelpList_C_ScrollDown::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollDown, L_OldSelect) == 0x000004, "Member 'WB_MapIconHelpList_C_ScrollDown::L_OldSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollDown, CallFunc_GetSelectDataIndex_DataIndex) == 0x000008, "Member 'WB_MapIconHelpList_C_ScrollDown::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollDown, CallFunc_ScrollDown_NewSelect) == 0x00000C, "Member 'WB_MapIconHelpList_C_ScrollDown::CallFunc_ScrollDown_NewSelect' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.UpdateUiInfo
// 0x00C0 (0x00C0 - 0x0000)
struct WB_MapIconHelpList_C_UpdateUiInfo final
{
public:
	bool                                          ForceReset;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_ForceReset;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DBD[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapIconHelpEntry                  L_ItemData;                                        // 0x0008(0x0048)(Edit, BlueprintVisible)
	int32                                         L_DataIndex;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UiToDataIndex_DataIndex;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DataToUiIndex_UiIndex;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DBE[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MapIconHelpOne_C*                   CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MapIconHelpOne_C*                   CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInitialState_InitialState;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DBF[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_Text;                             // 0x0088(0x0018)()
	E_MINIMAP_POI_ICON                            CallFunc_GetPOIIcon_POIIcon;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC0[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC1[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_1;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC2[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_2;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpList_C_UpdateUiInfo) == 0x000008, "Wrong alignment on WB_MapIconHelpList_C_UpdateUiInfo");
static_assert(sizeof(WB_MapIconHelpList_C_UpdateUiInfo) == 0x0000C0, "Wrong size on WB_MapIconHelpList_C_UpdateUiInfo");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, ForceReset) == 0x000000, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::ForceReset' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, L_ForceReset) == 0x000001, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::L_ForceReset' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, L_ItemData) == 0x000008, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::L_ItemData' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, L_DataIndex) == 0x000050, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::L_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, Temp_int_Array_Index_Variable) == 0x000054, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_UiToDataIndex_DataIndex) == 0x000058, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_UiToDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_GetSelectDataIndex_DataIndex) == 0x000064, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_DataToUiIndex_UiIndex) == 0x000068, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_DataToUiIndex_UiIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_Array_Get_Item) == 0x000070, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_IsInitialState_InitialState) == 0x000080, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_IsInitialState_InitialState' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_BooleanOR_ReturnValue) == 0x000081, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_GetText_Text) == 0x000088, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_GetText_Text' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_GetPOIIcon_POIIcon) == 0x0000A0, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_GetPOIIcon_POIIcon' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_NotEqual_TextText_ReturnValue) == 0x0000A9, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000AA, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_BooleanOR_ReturnValue_1) == 0x0000AB, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_BooleanOR_ReturnValue_2) == 0x0000AC, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_GetSelectDataIndex_DataIndex_1) == 0x0000B0, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_GetSelectDataIndex_DataIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_GetSelectDataIndex_DataIndex_2) == 0x0000B8, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_GetSelectDataIndex_DataIndex_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000BC, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UpdateUiInfo, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000BD, "Member 'WB_MapIconHelpList_C_UpdateUiInfo::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.UiToDataIndex
// 0x0034 (0x0034 - 0x0000)
struct WB_MapIconHelpList_C_UiToDataIndex final
{
public:
	int32                                         UIindex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DataIndex;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_DataIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC3[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDispDataIndex_top;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDispDataIndex_Bottom;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDispDataIndex_top_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDispDataIndex_Bottom_1;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC4[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC5[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpList_C_UiToDataIndex) == 0x000004, "Wrong alignment on WB_MapIconHelpList_C_UiToDataIndex");
static_assert(sizeof(WB_MapIconHelpList_C_UiToDataIndex) == 0x000034, "Wrong size on WB_MapIconHelpList_C_UiToDataIndex");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, UIindex) == 0x000000, "Member 'WB_MapIconHelpList_C_UiToDataIndex::UIindex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, DataIndex) == 0x000004, "Member 'WB_MapIconHelpList_C_UiToDataIndex::DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, L_DataIndex) == 0x000008, "Member 'WB_MapIconHelpList_C_UiToDataIndex::L_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, Temp_int_Variable) == 0x00000C, "Member 'WB_MapIconHelpList_C_UiToDataIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, Temp_bool_Variable) == 0x000011, "Member 'WB_MapIconHelpList_C_UiToDataIndex::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000012, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_GetDispDataIndex_top) == 0x000014, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_GetDispDataIndex_top' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_GetDispDataIndex_Bottom) == 0x000018, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_GetDispDataIndex_Bottom' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_GetDispDataIndex_top_1) == 0x00001C, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_GetDispDataIndex_top_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_GetDispDataIndex_Bottom_1) == 0x000020, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_GetDispDataIndex_Bottom_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'WB_MapIconHelpList_C_UiToDataIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_UiToDataIndex, K2Node_Select_Default) == 0x000030, "Member 'WB_MapIconHelpList_C_UiToDataIndex::K2Node_Select_Default' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.DataToUiIndex
// 0x0028 (0x0028 - 0x0000)
struct WB_MapIconHelpList_C_DataToUiIndex final
{
public:
	int32                                         DataIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UIindex;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_UiIndex;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDispDataIndex_top;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDispDataIndex_Bottom;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC6[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDispDataIndex_top_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDispDataIndex_Bottom_1;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpList_C_DataToUiIndex) == 0x000004, "Wrong alignment on WB_MapIconHelpList_C_DataToUiIndex");
static_assert(sizeof(WB_MapIconHelpList_C_DataToUiIndex) == 0x000028, "Wrong size on WB_MapIconHelpList_C_DataToUiIndex");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, DataIndex) == 0x000000, "Member 'WB_MapIconHelpList_C_DataToUiIndex::DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, UIindex) == 0x000004, "Member 'WB_MapIconHelpList_C_DataToUiIndex::UIindex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, L_UiIndex) == 0x000008, "Member 'WB_MapIconHelpList_C_DataToUiIndex::L_UiIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_GetDispDataIndex_top) == 0x00000C, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_GetDispDataIndex_top' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_GetDispDataIndex_Bottom) == 0x000010, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_GetDispDataIndex_Bottom' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_GetDispDataIndex_top_1) == 0x00001C, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_GetDispDataIndex_top_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_GetDispDataIndex_Bottom_1) == 0x000020, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_GetDispDataIndex_Bottom_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000025, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_DataToUiIndex, CallFunc_BooleanAND_ReturnValue) == 0x000026, "Member 'WB_MapIconHelpList_C_DataToUiIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.scrollUp
// 0x0010 (0x0010 - 0x0000)
struct WB_MapIconHelpList_C_ScrollUp final
{
public:
	int32                                         NewSelect;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_OldSelect;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ScrollUp_NewSelect;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpList_C_ScrollUp) == 0x000004, "Wrong alignment on WB_MapIconHelpList_C_ScrollUp");
static_assert(sizeof(WB_MapIconHelpList_C_ScrollUp) == 0x000010, "Wrong size on WB_MapIconHelpList_C_ScrollUp");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollUp, NewSelect) == 0x000000, "Member 'WB_MapIconHelpList_C_ScrollUp::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollUp, L_OldSelect) == 0x000004, "Member 'WB_MapIconHelpList_C_ScrollUp::L_OldSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollUp, CallFunc_GetSelectDataIndex_DataIndex) == 0x000008, "Member 'WB_MapIconHelpList_C_ScrollUp::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollUp, CallFunc_ScrollUp_NewSelect) == 0x00000C, "Member 'WB_MapIconHelpList_C_ScrollUp::CallFunc_ScrollUp_NewSelect' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.scrollPageDown
// 0x0010 (0x0010 - 0x0000)
struct WB_MapIconHelpList_C_ScrollPageDown final
{
public:
	int32                                         NewSelect;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_OldSelect;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ScrollPageDown_NewSelect;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpList_C_ScrollPageDown) == 0x000004, "Wrong alignment on WB_MapIconHelpList_C_ScrollPageDown");
static_assert(sizeof(WB_MapIconHelpList_C_ScrollPageDown) == 0x000010, "Wrong size on WB_MapIconHelpList_C_ScrollPageDown");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollPageDown, NewSelect) == 0x000000, "Member 'WB_MapIconHelpList_C_ScrollPageDown::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollPageDown, L_OldSelect) == 0x000004, "Member 'WB_MapIconHelpList_C_ScrollPageDown::L_OldSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollPageDown, CallFunc_GetSelectDataIndex_DataIndex) == 0x000008, "Member 'WB_MapIconHelpList_C_ScrollPageDown::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollPageDown, CallFunc_ScrollPageDown_NewSelect) == 0x00000C, "Member 'WB_MapIconHelpList_C_ScrollPageDown::CallFunc_ScrollPageDown_NewSelect' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.scrollPageUp
// 0x0010 (0x0010 - 0x0000)
struct WB_MapIconHelpList_C_ScrollPageUp final
{
public:
	int32                                         NewSelect;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_OldSelect;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ScrollPageUp_NewSelect;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpList_C_ScrollPageUp) == 0x000004, "Wrong alignment on WB_MapIconHelpList_C_ScrollPageUp");
static_assert(sizeof(WB_MapIconHelpList_C_ScrollPageUp) == 0x000010, "Wrong size on WB_MapIconHelpList_C_ScrollPageUp");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollPageUp, NewSelect) == 0x000000, "Member 'WB_MapIconHelpList_C_ScrollPageUp::NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollPageUp, L_OldSelect) == 0x000004, "Member 'WB_MapIconHelpList_C_ScrollPageUp::L_OldSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollPageUp, CallFunc_GetSelectDataIndex_DataIndex) == 0x000008, "Member 'WB_MapIconHelpList_C_ScrollPageUp::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ScrollPageUp, CallFunc_ScrollPageUp_NewSelect) == 0x00000C, "Member 'WB_MapIconHelpList_C_ScrollPageUp::CallFunc_ScrollPageUp_NewSelect' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.ClearList
// 0x0020 (0x0020 - 0x0000)
struct WB_MapIconHelpList_C_ClearList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC7[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MapIconHelpOne_C*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpList_C_ClearList) == 0x000008, "Wrong alignment on WB_MapIconHelpList_C_ClearList");
static_assert(sizeof(WB_MapIconHelpList_C_ClearList) == 0x000020, "Wrong size on WB_MapIconHelpList_C_ClearList");
static_assert(offsetof(WB_MapIconHelpList_C_ClearList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_MapIconHelpList_C_ClearList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ClearList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_MapIconHelpList_C_ClearList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ClearList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_MapIconHelpList_C_ClearList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ClearList, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_MapIconHelpList_C_ClearList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ClearList, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_MapIconHelpList_C_ClearList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ClearList, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WB_MapIconHelpList_C_ClearList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.PlayAnimListOut
// 0x0028 (0x0028 - 0x0000)
struct WB_MapIconHelpList_C_PlayAnimListOut final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDispNum_Num;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MapIconHelpOne_C*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC8[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpList_C_PlayAnimListOut) == 0x000008, "Wrong alignment on WB_MapIconHelpList_C_PlayAnimListOut");
static_assert(sizeof(WB_MapIconHelpList_C_PlayAnimListOut) == 0x000028, "Wrong size on WB_MapIconHelpList_C_PlayAnimListOut");
static_assert(offsetof(WB_MapIconHelpList_C_PlayAnimListOut, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WB_MapIconHelpList_C_PlayAnimListOut::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_PlayAnimListOut, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_MapIconHelpList_C_PlayAnimListOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_PlayAnimListOut, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WB_MapIconHelpList_C_PlayAnimListOut::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_PlayAnimListOut, CallFunc_GetDispNum_Num) == 0x00000C, "Member 'WB_MapIconHelpList_C_PlayAnimListOut::CallFunc_GetDispNum_Num' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_PlayAnimListOut, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_MapIconHelpList_C_PlayAnimListOut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_PlayAnimListOut, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_MapIconHelpList_C_PlayAnimListOut::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_PlayAnimListOut, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WB_MapIconHelpList_C_PlayAnimListOut::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_PlayAnimListOut, CallFunc_Less_IntInt_ReturnValue_1) == 0x000020, "Member 'WB_MapIconHelpList_C_PlayAnimListOut::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.GetSelectData
// 0x00E8 (0x00E8 - 0x0000)
struct WB_MapIconHelpList_C_GetSelectData final
{
public:
	struct FMinimapIconHelpEntry                  OutEntry;                                          // 0x0000(0x0048)(Parm, OutParm)
	struct FMinimapIconHelpEntry                  K2Node_MakeStruct_MinimapIconHelpEntry;            // 0x0048(0x0048)()
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex_1;           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMinimapIconHelpEntry                  CallFunc_Array_Get_Item;                           // 0x0098(0x0048)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpList_C_GetSelectData) == 0x000008, "Wrong alignment on WB_MapIconHelpList_C_GetSelectData");
static_assert(sizeof(WB_MapIconHelpList_C_GetSelectData) == 0x0000E8, "Wrong size on WB_MapIconHelpList_C_GetSelectData");
static_assert(offsetof(WB_MapIconHelpList_C_GetSelectData, OutEntry) == 0x000000, "Member 'WB_MapIconHelpList_C_GetSelectData::OutEntry' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_GetSelectData, K2Node_MakeStruct_MinimapIconHelpEntry) == 0x000048, "Member 'WB_MapIconHelpList_C_GetSelectData::K2Node_MakeStruct_MinimapIconHelpEntry' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_GetSelectData, CallFunc_GetSelectDataIndex_DataIndex) == 0x000090, "Member 'WB_MapIconHelpList_C_GetSelectData::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_GetSelectData, CallFunc_GetSelectDataIndex_DataIndex_1) == 0x000094, "Member 'WB_MapIconHelpList_C_GetSelectData::CallFunc_GetSelectDataIndex_DataIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_GetSelectData, CallFunc_Array_Get_Item) == 0x000098, "Member 'WB_MapIconHelpList_C_GetSelectData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_GetSelectData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000E0, "Member 'WB_MapIconHelpList_C_GetSelectData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.GetEntryNnum
// 0x0008 (0x0008 - 0x0000)
struct WB_MapIconHelpList_C_GetEntryNnum final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpList_C_GetEntryNnum) == 0x000004, "Wrong alignment on WB_MapIconHelpList_C_GetEntryNnum");
static_assert(sizeof(WB_MapIconHelpList_C_GetEntryNnum) == 0x000008, "Wrong size on WB_MapIconHelpList_C_GetEntryNnum");
static_assert(offsetof(WB_MapIconHelpList_C_GetEntryNnum, Num) == 0x000000, "Member 'WB_MapIconHelpList_C_GetEntryNnum::Num' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_GetEntryNnum, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WB_MapIconHelpList_C_GetEntryNnum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.ToggleIconHideSelected
// 0x0018 (0x0018 - 0x0000)
struct WB_MapIconHelpList_C_ToggleIconHideSelected final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC9[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectDataIndex_DataIndex;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpList_C_ToggleIconHideSelected) == 0x000008, "Wrong alignment on WB_MapIconHelpList_C_ToggleIconHideSelected");
static_assert(sizeof(WB_MapIconHelpList_C_ToggleIconHideSelected) == 0x000018, "Wrong size on WB_MapIconHelpList_C_ToggleIconHideSelected");
static_assert(offsetof(WB_MapIconHelpList_C_ToggleIconHideSelected, Temp_bool_Variable) == 0x000000, "Member 'WB_MapIconHelpList_C_ToggleIconHideSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ToggleIconHideSelected, Temp_bool_Variable_1) == 0x000001, "Member 'WB_MapIconHelpList_C_ToggleIconHideSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ToggleIconHideSelected, Temp_bool_Variable_2) == 0x000002, "Member 'WB_MapIconHelpList_C_ToggleIconHideSelected::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ToggleIconHideSelected, CallFunc_GetMinimapManager_ReturnValue) == 0x000008, "Member 'WB_MapIconHelpList_C_ToggleIconHideSelected::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ToggleIconHideSelected, CallFunc_GetSelectDataIndex_DataIndex) == 0x000010, "Member 'WB_MapIconHelpList_C_ToggleIconHideSelected::CallFunc_GetSelectDataIndex_DataIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ToggleIconHideSelected, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'WB_MapIconHelpList_C_ToggleIconHideSelected::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpList_C_ToggleIconHideSelected, K2Node_Select_Default) == 0x000015, "Member 'WB_MapIconHelpList_C_ToggleIconHideSelected::K2Node_Select_Default' has a wrong offset!");

// Function WB_MapIconHelpList.WB_MapIconHelpList_C.OnHover
// 0x0014 (0x0014 - 0x0000)
struct WB_MapIconHelpList_C_OnHover final
{
