#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapIconHelpOne

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.ExecuteUbergraph_WB_MapIconHelpOne
// 0x0054 (0x0054 - 0x0000)
struct WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D18[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMouseInputEnabled_IsEnable;             // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne) == 0x000004, "Wrong alignment on WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne");
static_assert(sizeof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne) == 0x000054, "Wrong size on WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, EntryPoint) == 0x000000, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_Pos) == 0x000004, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_UV) == 0x00000C, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_UV' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000014, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_AnimationName_1) == 0x00001C, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x000024, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x000028, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00002C, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00002D, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_AnimPackName) == 0x000030, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_AnimationName) == 0x000038, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000040, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000044, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000049, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x00004A, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_Play_ReturnValue) == 0x00004B, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_Play_ReturnValue_1) == 0x00004C, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_Play_ReturnValue_2) == 0x00004D, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_IsMouseInputEnabled_IsEnable) == 0x00004E, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_IsMouseInputEnabled_IsEnable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_IsValid_ReturnValue) == 0x00004F, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WB_MapIconHelpOne_C_ExecuteUbergraph_WB_MapIconHelpOne::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_MapIconHelpOne_C_BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MapIconHelpOne_C_BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.GetPOIIcon
// 0x0001 (0x0001 - 0x0000)
struct WB_MapIconHelpOne_C_GetPOIIcon final
{
public:
	E_MINIMAP_POI_ICON                            Param_POIIcon;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpOne_C_GetPOIIcon) == 0x000001, "Wrong alignment on WB_MapIconHelpOne_C_GetPOIIcon");
static_assert(sizeof(WB_MapIconHelpOne_C_GetPOIIcon) == 0x000001, "Wrong size on WB_MapIconHelpOne_C_GetPOIIcon");
static_assert(offsetof(WB_MapIconHelpOne_C_GetPOIIcon, Param_POIIcon) == 0x000000, "Member 'WB_MapIconHelpOne_C_GetPOIIcon::Param_POIIcon' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.UpdateSelectInfo
// 0x0004 (0x0004 - 0x0000)
struct WB_MapIconHelpOne_C_UpdateSelectInfo final
{
public:
	bool                                          bInSelect;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_OldNewItem;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_OldSelect;                                       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_UpdateSelectInfo) == 0x000001, "Wrong alignment on WB_MapIconHelpOne_C_UpdateSelectInfo");
static_assert(sizeof(WB_MapIconHelpOne_C_UpdateSelectInfo) == 0x000004, "Wrong size on WB_MapIconHelpOne_C_UpdateSelectInfo");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateSelectInfo, bInSelect) == 0x000000, "Member 'WB_MapIconHelpOne_C_UpdateSelectInfo::bInSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateSelectInfo, L_OldNewItem) == 0x000001, "Member 'WB_MapIconHelpOne_C_UpdateSelectInfo::L_OldNewItem' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateSelectInfo, L_OldSelect) == 0x000002, "Member 'WB_MapIconHelpOne_C_UpdateSelectInfo::L_OldSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateSelectInfo, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000003, "Member 'WB_MapIconHelpOne_C_UpdateSelectInfo::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.PlayAnimSlotIn
// 0x0024 (0x0024 - 0x0000)
struct WB_MapIconHelpOne_C_PlayAnimSlotIn final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D19[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSelect_IsSelect;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1A[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_PlayAnimSlotIn) == 0x000004, "Wrong alignment on WB_MapIconHelpOne_C_PlayAnimSlotIn");
static_assert(sizeof(WB_MapIconHelpOne_C_PlayAnimSlotIn) == 0x000024, "Wrong size on WB_MapIconHelpOne_C_PlayAnimSlotIn");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotIn, Temp_bool_Variable) == 0x000000, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotIn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotIn, Temp_name_Variable) == 0x000004, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotIn::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotIn, Temp_name_Variable_1) == 0x00000C, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotIn::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotIn, CallFunc_Play_ReturnValue) == 0x000014, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotIn::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotIn, CallFunc_CheckSelect_IsSelect) == 0x000015, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotIn::CallFunc_CheckSelect_IsSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotIn, K2Node_Select_Default) == 0x000018, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotIn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotIn, CallFunc_Play_ReturnValue_1) == 0x000020, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotIn::CallFunc_Play_ReturnValue_1' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.PlayAnimSlotLoop
// 0x0024 (0x0024 - 0x0000)
struct WB_MapIconHelpOne_C_PlayAnimSlotLoop final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSelect_IsSelect;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1C[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_PlayAnimSlotLoop) == 0x000004, "Wrong alignment on WB_MapIconHelpOne_C_PlayAnimSlotLoop");
static_assert(sizeof(WB_MapIconHelpOne_C_PlayAnimSlotLoop) == 0x000024, "Wrong size on WB_MapIconHelpOne_C_PlayAnimSlotLoop");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotLoop, Temp_bool_Variable) == 0x000000, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotLoop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotLoop, Temp_name_Variable) == 0x000004, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotLoop::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotLoop, Temp_name_Variable_1) == 0x00000C, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotLoop::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotLoop, CallFunc_Play_ReturnValue) == 0x000014, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotLoop::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotLoop, CallFunc_CheckSelect_IsSelect) == 0x000015, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotLoop::CallFunc_CheckSelect_IsSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotLoop, K2Node_Select_Default) == 0x000018, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotLoop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotLoop, CallFunc_Play_ReturnValue_1) == 0x000020, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotLoop::CallFunc_Play_ReturnValue_1' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.PlayAnimSlotOut
// 0x0024 (0x0024 - 0x0000)
struct WB_MapIconHelpOne_C_PlayAnimSlotOut final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSelect_IsSelect;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1E[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_PlayAnimSlotOut) == 0x000004, "Wrong alignment on WB_MapIconHelpOne_C_PlayAnimSlotOut");
static_assert(sizeof(WB_MapIconHelpOne_C_PlayAnimSlotOut) == 0x000024, "Wrong size on WB_MapIconHelpOne_C_PlayAnimSlotOut");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotOut, Temp_bool_Variable) == 0x000000, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotOut::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotOut, Temp_name_Variable) == 0x000004, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotOut::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotOut, Temp_name_Variable_1) == 0x00000C, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotOut::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotOut, CallFunc_Play_ReturnValue) == 0x000014, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotOut::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotOut, CallFunc_CheckSelect_IsSelect) == 0x000015, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotOut::CallFunc_CheckSelect_IsSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotOut, K2Node_Select_Default) == 0x000018, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotOut::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotOut, CallFunc_Play_ReturnValue_1) == 0x000020, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotOut::CallFunc_Play_ReturnValue_1' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.CheckSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_MapIconHelpOne_C_CheckSelect final
{
public:
	bool                                          IsSelect;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_CheckSelect) == 0x000001, "Wrong alignment on WB_MapIconHelpOne_C_CheckSelect");
static_assert(sizeof(WB_MapIconHelpOne_C_CheckSelect) == 0x000001, "Wrong size on WB_MapIconHelpOne_C_CheckSelect");
static_assert(offsetof(WB_MapIconHelpOne_C_CheckSelect, IsSelect) == 0x000000, "Member 'WB_MapIconHelpOne_C_CheckSelect::IsSelect' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.SetupItemData
// 0x0060 (0x0060 - 0x0000)
struct WB_MapIconHelpOne_C_SetupItemData final
{
public:
	bool                                          Param_bSelect;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSkipInAnim;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1F[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapIconHelpEntry                  Entry;                                             // 0x0008(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWB_MapIconHelpList_C*                  Param_Parent;                                      // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ListIndex;                                         // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_OldSelect;                                       // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_SetupItemData) == 0x000008, "Wrong alignment on WB_MapIconHelpOne_C_SetupItemData");
static_assert(sizeof(WB_MapIconHelpOne_C_SetupItemData) == 0x000060, "Wrong size on WB_MapIconHelpOne_C_SetupItemData");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupItemData, Param_bSelect) == 0x000000, "Member 'WB_MapIconHelpOne_C_SetupItemData::Param_bSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupItemData, bSkipInAnim) == 0x000001, "Member 'WB_MapIconHelpOne_C_SetupItemData::bSkipInAnim' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupItemData, Entry) == 0x000008, "Member 'WB_MapIconHelpOne_C_SetupItemData::Entry' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupItemData, Param_Parent) == 0x000050, "Member 'WB_MapIconHelpOne_C_SetupItemData::Param_Parent' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupItemData, ListIndex) == 0x000058, "Member 'WB_MapIconHelpOne_C_SetupItemData::ListIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupItemData, L_OldSelect) == 0x00005C, "Member 'WB_MapIconHelpOne_C_SetupItemData::L_OldSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupItemData, CallFunc_Play_ReturnValue) == 0x00005D, "Member 'WB_MapIconHelpOne_C_SetupItemData::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupItemData, CallFunc_Play_ReturnValue_1) == 0x00005E, "Member 'WB_MapIconHelpOne_C_SetupItemData::CallFunc_Play_ReturnValue_1' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.GetIconUV
// 0x0030 (0x0030 - 0x0000)
struct WB_MapIconHelpOne_C_GetIconUV final
{
public:
	E_MINIMAP_POI_ICON                            Param_POIIcon;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D20[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutU;                                              // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutV;                                              // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_POI_ICON                            LPOIIcon;                                          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D21[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIconMaterial_OutU;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIconMaterial_OutV;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetIconMaterial_OutColor;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpOne_C_GetIconUV) == 0x000008, "Wrong alignment on WB_MapIconHelpOne_C_GetIconUV");
static_assert(sizeof(WB_MapIconHelpOne_C_GetIconUV) == 0x000030, "Wrong size on WB_MapIconHelpOne_C_GetIconUV");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, Param_POIIcon) == 0x000000, "Member 'WB_MapIconHelpOne_C_GetIconUV::Param_POIIcon' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, OutU) == 0x000004, "Member 'WB_MapIconHelpOne_C_GetIconUV::OutU' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, OutV) == 0x000008, "Member 'WB_MapIconHelpOne_C_GetIconUV::OutV' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, LPOIIcon) == 0x00000C, "Member 'WB_MapIconHelpOne_C_GetIconUV::LPOIIcon' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, K2Node_SwitchEnum_CmpSuccess) == 0x00000D, "Member 'WB_MapIconHelpOne_C_GetIconUV::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, CallFunc_GetMinimapManager_ReturnValue) == 0x000010, "Member 'WB_MapIconHelpOne_C_GetIconUV::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, CallFunc_GetIconMaterial_OutU) == 0x000018, "Member 'WB_MapIconHelpOne_C_GetIconUV::CallFunc_GetIconMaterial_OutU' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, CallFunc_GetIconMaterial_OutV) == 0x00001C, "Member 'WB_MapIconHelpOne_C_GetIconUV::CallFunc_GetIconMaterial_OutV' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_GetIconUV, CallFunc_GetIconMaterial_OutColor) == 0x000020, "Member 'WB_MapIconHelpOne_C_GetIconUV::CallFunc_GetIconMaterial_OutColor' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.SetupIcon
// 0x0060 (0x0060 - 0x0000)
struct WB_MapIconHelpOne_C_SetupIcon final
{
public:
	E_MINIMAP_POI_ICON                            Param_POIIcon;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D22[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIconUV_OutU;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIconUV_OutV;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIconMaterial_OutU;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIconMaterial_OutV;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetIconMaterial_OutColor;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpOne_C_SetupIcon) == 0x000008, "Wrong alignment on WB_MapIconHelpOne_C_SetupIcon");
static_assert(sizeof(WB_MapIconHelpOne_C_SetupIcon) == 0x000060, "Wrong size on WB_MapIconHelpOne_C_SetupIcon");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, Param_POIIcon) == 0x000000, "Member 'WB_MapIconHelpOne_C_SetupIcon::Param_POIIcon' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_GetIconUV_OutU) == 0x000010, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_GetIconUV_OutU' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_GetIconUV_OutV) == 0x000014, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_GetIconUV_OutV' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, K2Node_MakeStruct_LinearColor) == 0x000018, "Member 'WB_MapIconHelpOne_C_SetupIcon::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_GetMinimapManager_ReturnValue) == 0x000028, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_GetIconMaterial_OutU) == 0x000038, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_GetIconMaterial_OutU' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_GetIconMaterial_OutV) == 0x00003C, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_GetIconMaterial_OutV' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, CallFunc_GetIconMaterial_OutColor) == 0x000040, "Member 'WB_MapIconHelpOne_C_SetupIcon::CallFunc_GetIconMaterial_OutColor' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_SetupIcon, K2Node_MakeStruct_LinearColor_1) == 0x000050, "Member 'WB_MapIconHelpOne_C_SetupIcon::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.UpdateInfo
// 0x0040 (0x0040 - 0x0000)
struct WB_MapIconHelpOne_C_UpdateInfo final
{
public:
	E_SHOP_ITEM_SELECT_TYPE                       L_SelectType;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSelect_IsSelect;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D23[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D24[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
};
static_assert(alignof(WB_MapIconHelpOne_C_UpdateInfo) == 0x000008, "Wrong alignment on WB_MapIconHelpOne_C_UpdateInfo");
static_assert(sizeof(WB_MapIconHelpOne_C_UpdateInfo) == 0x000040, "Wrong size on WB_MapIconHelpOne_C_UpdateInfo");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateInfo, L_SelectType) == 0x000000, "Member 'WB_MapIconHelpOne_C_UpdateInfo::L_SelectType' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateInfo, CallFunc_CheckSelect_IsSelect) == 0x000001, "Member 'WB_MapIconHelpOne_C_UpdateInfo::CallFunc_CheckSelect_IsSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WB_MapIconHelpOne_C_UpdateInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateInfo, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WB_MapIconHelpOne_C_UpdateInfo::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_UpdateInfo, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WB_MapIconHelpOne_C_UpdateInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.ClearInfo
// 0x0002 (0x0002 - 0x0000)
struct WB_MapIconHelpOne_C_ClearInfo final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_ClearInfo) == 0x000001, "Wrong alignment on WB_MapIconHelpOne_C_ClearInfo");
static_assert(sizeof(WB_MapIconHelpOne_C_ClearInfo) == 0x000002, "Wrong size on WB_MapIconHelpOne_C_ClearInfo");
static_assert(offsetof(WB_MapIconHelpOne_C_ClearInfo, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_MapIconHelpOne_C_ClearInfo::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_ClearInfo, CallFunc_Play_ReturnValue_1) == 0x000001, "Member 'WB_MapIconHelpOne_C_ClearInfo::CallFunc_Play_ReturnValue_1' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.PlayAnimSlotContinue
// 0x007C (0x007C - 0x0000)
struct WB_MapIconHelpOne_C_PlayAnimSlotContinue final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D25[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D26[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D27[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSelect_IsSelect;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckSelect_IsSelect_1;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D28[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSelect_IsSelect_2;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D29[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_2;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpOne_C_PlayAnimSlotContinue) == 0x000004, "Wrong alignment on WB_MapIconHelpOne_C_PlayAnimSlotContinue");
static_assert(sizeof(WB_MapIconHelpOne_C_PlayAnimSlotContinue) == 0x00007C, "Wrong size on WB_MapIconHelpOne_C_PlayAnimSlotContinue");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_bool_Variable) == 0x000000, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_name_Variable) == 0x000004, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_name_Variable_1) == 0x00000C, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_bool_Variable_1) == 0x000014, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_name_Variable_2) == 0x000018, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_name_Variable_3) == 0x000020, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_bool_Variable_2) == 0x000028, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_name_Variable_4) == 0x00002C, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, Temp_name_Variable_5) == 0x000034, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_CheckSelect_IsSelect) == 0x00003C, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_CheckSelect_IsSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_CheckSelect_IsSelect_1) == 0x00003D, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_CheckSelect_IsSelect_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, K2Node_Select_Default) == 0x000040, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, K2Node_Select_Default_1) == 0x000048, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_CheckSelect_IsSelect_2) == 0x000050, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_CheckSelect_IsSelect_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_GetPlayFrame_ReturnValue) == 0x000054, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, K2Node_Select_Default_2) == 0x000058, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_FTrunc_ReturnValue) == 0x000060, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000064, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x00006C, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_Play_ReturnValue) == 0x000074, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, K2Node_SwitchName_CmpSuccess) == 0x000075, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_Play_ReturnValue_1) == 0x000076, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_Play_ReturnValue_2) == 0x000077, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_Play_ReturnValue_3) == 0x000078, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_Play_ReturnValue_4) == 0x000079, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpOne_C_PlayAnimSlotContinue, CallFunc_Play_ReturnValue_5) == 0x00007A, "Member 'WB_MapIconHelpOne_C_PlayAnimSlotContinue::CallFunc_Play_ReturnValue_5' has a wrong offset!");

// Function WB_MapIconHelpOne.WB_MapIconHelpOne_C.InitAnim
// 0x0002 (0x0002 - 0x0000)
struct WB_MapIconHelpOne_C_InitAnim final
{
public:
