#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Message_Select

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function WB_Message_Select.WB_Message_Select_C.ExecuteUbergraph_WB_Message_Select
// 0x0010 (0x0010 - 0x0000)
struct WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIListCursor*                          CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select) == 0x000008, "Wrong alignment on WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select");
static_assert(sizeof(WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select) == 0x000010, "Wrong size on WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select");
static_assert(offsetof(WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select, EntryPoint) == 0x000000, "Member 'WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WB_Message_Select_C_ExecuteUbergraph_WB_Message_Select::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.StartMessage
// 0x0020 (0x0020 - 0x0000)
struct WB_Message_Select_C_StartMessage final
{
public:
	class UScriptMessageAsset*                    InScriptMessage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 InMessageIdArray;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_AddMessagePage_PageId;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_StartMessage) == 0x000008, "Wrong alignment on WB_Message_Select_C_StartMessage");
static_assert(sizeof(WB_Message_Select_C_StartMessage) == 0x000020, "Wrong size on WB_Message_Select_C_StartMessage");
static_assert(offsetof(WB_Message_Select_C_StartMessage, InScriptMessage) == 0x000000, "Member 'WB_Message_Select_C_StartMessage::InScriptMessage' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_StartMessage, InMessageIdArray) == 0x000008, "Member 'WB_Message_Select_C_StartMessage::InMessageIdArray' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_StartMessage, CallFunc_AddMessagePage_PageId) == 0x000018, "Member 'WB_Message_Select_C_StartMessage::CallFunc_AddMessagePage_PageId' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.AddMessagePage
// 0x00E0 (0x00E0 - 0x0000)
struct WB_Message_Select_C_AddMessagePage final
{
public:
	class UScriptMessageAsset*                    ScriptMessAsset;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 MassageIdArray;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Param_PageId;                                      // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMessageData>                   MessageDatas;                                      // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMessageData                           CallFunc_GetMessageDataFromId_ReturnValue;         // 0x0048(0x0070)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMessageSelData                        K2Node_MakeStruct_MessageSelData;                  // 0x00C0(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_AddMessagePage) == 0x000008, "Wrong alignment on WB_Message_Select_C_AddMessagePage");
static_assert(sizeof(WB_Message_Select_C_AddMessagePage) == 0x0000E0, "Wrong size on WB_Message_Select_C_AddMessagePage");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, ScriptMessAsset) == 0x000000, "Member 'WB_Message_Select_C_AddMessagePage::ScriptMessAsset' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, MassageIdArray) == 0x000008, "Member 'WB_Message_Select_C_AddMessagePage::MassageIdArray' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, Param_PageId) == 0x000018, "Member 'WB_Message_Select_C_AddMessagePage::Param_PageId' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, MessageDatas) == 0x000020, "Member 'WB_Message_Select_C_AddMessagePage::MessageDatas' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WB_Message_Select_C_AddMessagePage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WB_Message_Select_C_AddMessagePage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WB_Message_Select_C_AddMessagePage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, CallFunc_Array_Get_Item) == 0x00003C, "Member 'WB_Message_Select_C_AddMessagePage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'WB_Message_Select_C_AddMessagePage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, CallFunc_GetMessageDataFromId_ReturnValue) == 0x000048, "Member 'WB_Message_Select_C_AddMessagePage::CallFunc_GetMessageDataFromId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'WB_Message_Select_C_AddMessagePage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'WB_Message_Select_C_AddMessagePage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, K2Node_MakeStruct_MessageSelData) == 0x0000C0, "Member 'WB_Message_Select_C_AddMessagePage::K2Node_MakeStruct_MessageSelData' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'WB_Message_Select_C_AddMessagePage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage, CallFunc_Array_Add_ReturnValue_1) == 0x0000DC, "Member 'WB_Message_Select_C_AddMessagePage::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.AddMessagePage_Label
// 0x00E8 (0x00E8 - 0x0000)
struct WB_Message_Select_C_AddMessagePage_Label final
{
public:
	class UScriptMessageAsset*                    ScriptMessageAsset;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           MessageLabelArray;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Param_PageId;                                      // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMessageData>                   MessDatas;                                         // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMessageData                           CallFunc_GetMessageDataFromLabel_ReturnValue;      // 0x0048(0x0070)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMessageSelData                        K2Node_MakeStruct_MessageSelData;                  // 0x00C8(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_AddMessagePage_Label) == 0x000008, "Wrong alignment on WB_Message_Select_C_AddMessagePage_Label");
static_assert(sizeof(WB_Message_Select_C_AddMessagePage_Label) == 0x0000E8, "Wrong size on WB_Message_Select_C_AddMessagePage_Label");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, ScriptMessageAsset) == 0x000000, "Member 'WB_Message_Select_C_AddMessagePage_Label::ScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, MessageLabelArray) == 0x000008, "Member 'WB_Message_Select_C_AddMessagePage_Label::MessageLabelArray' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, Param_PageId) == 0x000018, "Member 'WB_Message_Select_C_AddMessagePage_Label::Param_PageId' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, MessDatas) == 0x000020, "Member 'WB_Message_Select_C_AddMessagePage_Label::MessDatas' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WB_Message_Select_C_AddMessagePage_Label::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WB_Message_Select_C_AddMessagePage_Label::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WB_Message_Select_C_AddMessagePage_Label::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, CallFunc_Array_Get_Item) == 0x00003C, "Member 'WB_Message_Select_C_AddMessagePage_Label::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000044, "Member 'WB_Message_Select_C_AddMessagePage_Label::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, CallFunc_GetMessageDataFromLabel_ReturnValue) == 0x000048, "Member 'WB_Message_Select_C_AddMessagePage_Label::CallFunc_GetMessageDataFromLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'WB_Message_Select_C_AddMessagePage_Label::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'WB_Message_Select_C_AddMessagePage_Label::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, CallFunc_Array_Add_ReturnValue) == 0x0000C0, "Member 'WB_Message_Select_C_AddMessagePage_Label::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, K2Node_MakeStruct_MessageSelData) == 0x0000C8, "Member 'WB_Message_Select_C_AddMessagePage_Label::K2Node_MakeStruct_MessageSelData' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddMessagePage_Label, CallFunc_Array_Add_ReturnValue_1) == 0x0000E0, "Member 'WB_Message_Select_C_AddMessagePage_Label::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.ChangePage
// 0x00B0 (0x00B0 - 0x0000)
struct WB_Message_Select_C_ChangePage final
{
public:
	int32                                         Param_PageId;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMessageSelData                        CallFunc_Array_Get_Item;                           // 0x0010(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMessageData                           CallFunc_Array_Get_Item_1;                         // 0x0030(0x0070)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_ChangePage) == 0x000008, "Wrong alignment on WB_Message_Select_C_ChangePage");
static_assert(sizeof(WB_Message_Select_C_ChangePage) == 0x0000B0, "Wrong size on WB_Message_Select_C_ChangePage");
static_assert(offsetof(WB_Message_Select_C_ChangePage, Param_PageId) == 0x000000, "Member 'WB_Message_Select_C_ChangePage::Param_PageId' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_Message_Select_C_ChangePage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WB_Message_Select_C_ChangePage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_Message_Select_C_ChangePage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_Message_Select_C_ChangePage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WB_Message_Select_C_ChangePage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WB_Message_Select_C_ChangePage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'WB_Message_Select_C_ChangePage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'WB_Message_Select_C_ChangePage::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_Array_Length_ReturnValue_2) == 0x0000A4, "Member 'WB_Message_Select_C_ChangePage::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WB_Message_Select_C_ChangePage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'WB_Message_Select_C_ChangePage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangePage, CallFunc_Array_Length_ReturnValue_3) == 0x0000AC, "Member 'WB_Message_Select_C_ChangePage::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.ClearNowWidget
// 0x0020 (0x0020 - 0x0000)
struct WB_Message_Select_C_ClearNowWidget final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Message_SelectItem_C*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Select_C_ClearNowWidget) == 0x000008, "Wrong alignment on WB_Message_Select_C_ClearNowWidget");
static_assert(sizeof(WB_Message_Select_C_ClearNowWidget) == 0x000020, "Wrong size on WB_Message_Select_C_ClearNowWidget");
static_assert(offsetof(WB_Message_Select_C_ClearNowWidget, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_Message_Select_C_ClearNowWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ClearNowWidget, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_Message_Select_C_ClearNowWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ClearNowWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_Message_Select_C_ClearNowWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ClearNowWidget, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_Message_Select_C_ClearNowWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ClearNowWidget, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_Message_Select_C_ClearNowWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ClearNowWidget, CallFunc_RemoveChild_ReturnValue) == 0x00001C, "Member 'WB_Message_Select_C_ClearNowWidget::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ClearNowWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'WB_Message_Select_C_ClearNowWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.AddWidget
// 0x0098 (0x0098 - 0x0000)
struct WB_Message_Select_C_AddWidget final
{
public:
	class UScriptMessageAsset*                    InScriptMessage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMessageData                           MessData;                                          // 0x0008(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWB_Message_SelectItem_C*               Widget;                                            // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Message_SelectItem_C*               CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_AddWidget) == 0x000008, "Wrong alignment on WB_Message_Select_C_AddWidget");
static_assert(sizeof(WB_Message_Select_C_AddWidget) == 0x000098, "Wrong size on WB_Message_Select_C_AddWidget");
static_assert(offsetof(WB_Message_Select_C_AddWidget, InScriptMessage) == 0x000000, "Member 'WB_Message_Select_C_AddWidget::InScriptMessage' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddWidget, MessData) == 0x000008, "Member 'WB_Message_Select_C_AddWidget::MessData' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddWidget, Widget) == 0x000078, "Member 'WB_Message_Select_C_AddWidget::Widget' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddWidget, CallFunc_Create_ReturnValue) == 0x000080, "Member 'WB_Message_Select_C_AddWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddWidget, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'WB_Message_Select_C_AddWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_AddWidget, CallFunc_AddChild_ReturnValue) == 0x000090, "Member 'WB_Message_Select_C_AddWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.SetView
// 0x0001 (0x0001 - 0x0000)
struct WB_Message_Select_C_SetView final
{
public:
	bool                                          IsView;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Select_C_SetView) == 0x000001, "Wrong alignment on WB_Message_Select_C_SetView");
static_assert(sizeof(WB_Message_Select_C_SetView) == 0x000001, "Wrong size on WB_Message_Select_C_SetView");
static_assert(offsetof(WB_Message_Select_C_SetView, IsView) == 0x000000, "Member 'WB_Message_Select_C_SetView::IsView' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.SetBgSize
// 0x0040 (0x0040 - 0x0000)
struct WB_Message_Select_C_SetBgSize final
{
public:
	float                                         ConstSpaceY;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConstItemY;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeY;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_SetBgSize) == 0x000008, "Wrong alignment on WB_Message_Select_C_SetBgSize");
static_assert(sizeof(WB_Message_Select_C_SetBgSize) == 0x000040, "Wrong size on WB_Message_Select_C_SetBgSize");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, ConstSpaceY) == 0x000000, "Member 'WB_Message_Select_C_SetBgSize::ConstSpaceY' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, ConstItemY) == 0x000004, "Member 'WB_Message_Select_C_SetBgSize::ConstItemY' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, SizeY) == 0x000008, "Member 'WB_Message_Select_C_SetBgSize::SizeY' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_Message_Select_C_SetBgSize::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, CallFunc_GetSize_ReturnValue) == 0x000018, "Member 'WB_Message_Select_C_SetBgSize::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WB_Message_Select_C_SetBgSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'WB_Message_Select_C_SetBgSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'WB_Message_Select_C_SetBgSize::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WB_Message_Select_C_SetBgSize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000034, "Member 'WB_Message_Select_C_SetBgSize::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SetBgSize, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'WB_Message_Select_C_SetBgSize::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.MoveCursor
// 0x0018 (0x0018 - 0x0000)
struct WB_Message_Select_C_MoveCursor final
{
public:
	int32                                         Add;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLimitStop;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsMove;                                            // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BackCursor;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNowIndex_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MoveCursor_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNowIndex_ReturnValue_1;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_MoveCursor) == 0x000004, "Wrong alignment on WB_Message_Select_C_MoveCursor");
static_assert(sizeof(WB_Message_Select_C_MoveCursor) == 0x000018, "Wrong size on WB_Message_Select_C_MoveCursor");
static_assert(offsetof(WB_Message_Select_C_MoveCursor, Add) == 0x000000, "Member 'WB_Message_Select_C_MoveCursor::Add' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_MoveCursor, IsLimitStop) == 0x000004, "Member 'WB_Message_Select_C_MoveCursor::IsLimitStop' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_MoveCursor, IsMove) == 0x000005, "Member 'WB_Message_Select_C_MoveCursor::IsMove' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_MoveCursor, BackCursor) == 0x000008, "Member 'WB_Message_Select_C_MoveCursor::BackCursor' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_MoveCursor, CallFunc_GetNowIndex_ReturnValue) == 0x00000C, "Member 'WB_Message_Select_C_MoveCursor::CallFunc_GetNowIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_MoveCursor, CallFunc_MoveCursor_ReturnValue) == 0x000010, "Member 'WB_Message_Select_C_MoveCursor::CallFunc_MoveCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_MoveCursor, CallFunc_GetNowIndex_ReturnValue_1) == 0x000014, "Member 'WB_Message_Select_C_MoveCursor::CallFunc_GetNowIndex_ReturnValue_1' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.ChangeCursor
// 0x0038 (0x0038 - 0x0000)
struct WB_Message_Select_C_ChangeCursor final
{
public:
	int32                                         BackCursor;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCursor;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_ResetCursor;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_SetCursor;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Message_SelectItem_C*               CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Message_SelectItem_C*               CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Select_C_ChangeCursor) == 0x000008, "Wrong alignment on WB_Message_Select_C_ChangeCursor");
static_assert(sizeof(WB_Message_Select_C_ChangeCursor) == 0x000038, "Wrong size on WB_Message_Select_C_ChangeCursor");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, BackCursor) == 0x000000, "Member 'WB_Message_Select_C_ChangeCursor::BackCursor' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, NewCursor) == 0x000004, "Member 'WB_Message_Select_C_ChangeCursor::NewCursor' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, Param_ResetCursor) == 0x000008, "Member 'WB_Message_Select_C_ChangeCursor::Param_ResetCursor' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, Param_SetCursor) == 0x00000C, "Member 'WB_Message_Select_C_ChangeCursor::Param_SetCursor' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_BooleanOR_ReturnValue) == 0x00002D, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00002E, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_Less_IntInt_ReturnValue_1) == 0x00002F, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ChangeCursor, CallFunc_BooleanOR_ReturnValue_1) == 0x000030, "Member 'WB_Message_Select_C_ChangeCursor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.GetSelData
// 0x0030 (0x0030 - 0x0000)
struct WB_Message_Select_C_GetSelData final
{
public:
	int32                                         CursorIndex;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MessageID;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MessageLabel;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNowIndex_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Message_SelectItem_C*               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Select_C_GetSelData) == 0x000008, "Wrong alignment on WB_Message_Select_C_GetSelData");
static_assert(sizeof(WB_Message_Select_C_GetSelData) == 0x000030, "Wrong size on WB_Message_Select_C_GetSelData");
static_assert(offsetof(WB_Message_Select_C_GetSelData, CursorIndex) == 0x000000, "Member 'WB_Message_Select_C_GetSelData::CursorIndex' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_GetSelData, MessageID) == 0x000004, "Member 'WB_Message_Select_C_GetSelData::MessageID' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_GetSelData, MessageLabel) == 0x000008, "Member 'WB_Message_Select_C_GetSelData::MessageLabel' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_GetSelData, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WB_Message_Select_C_GetSelData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_GetSelData, CallFunc_GetNowIndex_ReturnValue) == 0x000014, "Member 'WB_Message_Select_C_GetSelData::CallFunc_GetNowIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_GetSelData, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_Message_Select_C_GetSelData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_GetSelData, CallFunc_Array_Get_Item) == 0x000020, "Member 'WB_Message_Select_C_GetSelData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_GetSelData, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'WB_Message_Select_C_GetSelData::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_GetSelData, CallFunc_BooleanOR_ReturnValue) == 0x000029, "Member 'WB_Message_Select_C_GetSelData::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.StartMessage_Label
// 0x0020 (0x0020 - 0x0000)
struct WB_Message_Select_C_StartMessage_Label final
{
public:
	class UScriptMessageAsset*                    ScriptMessageAsset;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           MessageLabelArray;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_AddMessagePage_Label_PageId;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_StartMessage_Label) == 0x000008, "Wrong alignment on WB_Message_Select_C_StartMessage_Label");
static_assert(sizeof(WB_Message_Select_C_StartMessage_Label) == 0x000020, "Wrong size on WB_Message_Select_C_StartMessage_Label");
static_assert(offsetof(WB_Message_Select_C_StartMessage_Label, ScriptMessageAsset) == 0x000000, "Member 'WB_Message_Select_C_StartMessage_Label::ScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_StartMessage_Label, MessageLabelArray) == 0x000008, "Member 'WB_Message_Select_C_StartMessage_Label::MessageLabelArray' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_StartMessage_Label, CallFunc_AddMessagePage_Label_PageId) == 0x000018, "Member 'WB_Message_Select_C_StartMessage_Label::CallFunc_AddMessagePage_Label_PageId' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.ToNextPage
// 0x0024 (0x0024 - 0x0000)
struct WB_Message_Select_C_ToNextPage final
{
public:
	bool                                          IsBack;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID;                                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Select_C_ToNextPage) == 0x000004, "Wrong alignment on WB_Message_Select_C_ToNextPage");
static_assert(sizeof(WB_Message_Select_C_ToNextPage) == 0x000024, "Wrong size on WB_Message_Select_C_ToNextPage");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, IsBack) == 0x000000, "Member 'WB_Message_Select_C_ToNextPage::IsBack' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, ID) == 0x000004, "Member 'WB_Message_Select_C_ToNextPage::ID' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WB_Message_Select_C_ToNextPage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WB_Message_Select_C_ToNextPage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'WB_Message_Select_C_ToNextPage::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WB_Message_Select_C_ToNextPage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_Message_Select_C_ToNextPage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_Message_Select_C_ToNextPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_ToNextPage, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000020, "Member 'WB_Message_Select_C_ToNextPage::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_Message_Select.WB_Message_Select_C.SettingCursor
// 0x0018 (0x0018 - 0x0000)
struct WB_Message_Select_C_SettingCursor final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMove;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BackCursor;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNowIndex_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNowIndex_ReturnValue_1;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MoveCursor_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Select_C_SettingCursor) == 0x000004, "Wrong alignment on WB_Message_Select_C_SettingCursor");
static_assert(sizeof(WB_Message_Select_C_SettingCursor) == 0x000018, "Wrong size on WB_Message_Select_C_SettingCursor");
static_assert(offsetof(WB_Message_Select_C_SettingCursor, Param_Index) == 0x000000, "Member 'WB_Message_Select_C_SettingCursor::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SettingCursor, IsMove) == 0x000004, "Member 'WB_Message_Select_C_SettingCursor::IsMove' has a wrong offset!");
static_assert(offsetof(WB_Message_Select_C_SettingCursor, BackCursor) == 0x000008, "Member 'WB_Message_Select_C_SettingCursor::BackCursor' has a wrong offset!");
