#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MsgSelect

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_MsgSelect.WB_MsgSelect_C.OnMouseClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_MsgSelect_C_OnMouseClicked__DelegateSignature final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_OnMouseClicked__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgSelect_C_OnMouseClicked__DelegateSignature");
static_assert(sizeof(WB_MsgSelect_C_OnMouseClicked__DelegateSignature) == 0x000004, "Wrong size on WB_MsgSelect_C_OnMouseClicked__DelegateSignature");
static_assert(offsetof(WB_MsgSelect_C_OnMouseClicked__DelegateSignature, InIndex) == 0x000000, "Member 'WB_MsgSelect_C_OnMouseClicked__DelegateSignature::InIndex' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.OnMouseSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_MsgSelect_C_OnMouseSelected__DelegateSignature final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_OnMouseSelected__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgSelect_C_OnMouseSelected__DelegateSignature");
static_assert(sizeof(WB_MsgSelect_C_OnMouseSelected__DelegateSignature) == 0x000004, "Wrong size on WB_MsgSelect_C_OnMouseSelected__DelegateSignature");
static_assert(offsetof(WB_MsgSelect_C_OnMouseSelected__DelegateSignature, InIndex) == 0x000000, "Member 'WB_MsgSelect_C_OnMouseSelected__DelegateSignature::InIndex' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.ExecuteUbergraph_WB_MsgSelect
// 0x00C0 (0x00C0 - 0x0000)
struct WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22EB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    K2Node_CustomEvent_argscriptmessagelabel;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ArgIndex;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InAfterBuild;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22EC[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_InNewIconFrame;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22ED[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22EE[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22EF[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptMessageAsset*                    K2Node_CustomEvent_argscriptmessagelabel_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_argselectitemname;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InAfterBuild_1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F0[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x00AC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x00B4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect) == 0x000008, "Wrong alignment on WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect");
static_assert(sizeof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect) == 0x0000C0, "Wrong size on WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, EntryPoint) == 0x000000, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_CustomEvent_argscriptmessagelabel) == 0x000008, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_CustomEvent_argscriptmessagelabel' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_CustomEvent_ArgIndex) == 0x000010, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_CustomEvent_ArgIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_CustomEvent_InAfterBuild) == 0x000014, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_CustomEvent_InAfterBuild' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000018, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_AnimationName_1) == 0x000020, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x000028, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x00002C, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, CallFunc_Play_ReturnValue) == 0x000031, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, CallFunc_Play_ReturnValue_1) == 0x000032, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, CallFunc_Play_ReturnValue_2) == 0x000033, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_CustomEvent_InNewIconFrame) == 0x000034, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_CustomEvent_InNewIconFrame' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, CallFunc_Play_ReturnValue_3) == 0x000038, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_AnimPackName) == 0x00003C, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_AnimationName) == 0x000044, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x00004C, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000050, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_SwitchName_CmpSuccess_1) == 0x000054, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_Event_MyGeometry) == 0x000058, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_Event_InDeltaTime) == 0x000090, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, CallFunc_Play_ReturnValue_4) == 0x000094, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_CustomEvent_argscriptmessagelabel_1) == 0x000098, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_CustomEvent_argscriptmessagelabel_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_CustomEvent_argselectitemname) == 0x0000A0, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_CustomEvent_argselectitemname' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_CustomEvent_InAfterBuild_1) == 0x0000A8, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_CustomEvent_InAfterBuild_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, CallFunc_Play_ReturnValue_5) == 0x0000A9, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_Pos) == 0x0000AC, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect, K2Node_ComponentBoundEvent_UV) == 0x0000B4, "Member 'WB_MsgSelect_C_ExecuteUbergraph_WB_MsgSelect::K2Node_ComponentBoundEvent_UV' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_MsgSelect_C_BndEvt__WB_MsgSelect_ButtonS5MouseCursor_K2Node_ComponentBoundEvent_2_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_MsgSelect_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_Tick) == 0x000004, "Wrong alignment on WB_MsgSelect_C_Tick");
static_assert(sizeof(WB_MsgSelect_C_Tick) == 0x00003C, "Wrong size on WB_MsgSelect_C_Tick");
static_assert(offsetof(WB_MsgSelect_C_Tick, MyGeometry) == 0x000000, "Member 'WB_MsgSelect_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_MsgSelect_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MsgSelect_C_BndEvt__selectitem_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.MsgSelect_In
// 0x0004 (0x0004 - 0x0000)
struct WB_MsgSelect_C_MsgSelect_In final
{
public:
	int32                                         InNewIconFrame;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_MsgSelect_In) == 0x000004, "Wrong alignment on WB_MsgSelect_C_MsgSelect_In");
static_assert(sizeof(WB_MsgSelect_C_MsgSelect_In) == 0x000004, "Wrong size on WB_MsgSelect_C_MsgSelect_In");
static_assert(offsetof(WB_MsgSelect_C_MsgSelect_In, InNewIconFrame) == 0x000000, "Member 'WB_MsgSelect_C_MsgSelect_In::InNewIconFrame' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MsgSelect_C_BndEvt__SsPlayerSelectCursor_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SetSelectItemNameByIndex
// 0x0010 (0x0010 - 0x0000)
struct WB_MsgSelect_C_SetSelectItemNameByIndex final
{
public:
	class UScriptMessageAsset*                    ArgScriptMessageLabel;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Argindex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAfterBuild;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SetSelectItemNameByIndex) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SetSelectItemNameByIndex");
static_assert(sizeof(WB_MsgSelect_C_SetSelectItemNameByIndex) == 0x000010, "Wrong size on WB_MsgSelect_C_SetSelectItemNameByIndex");
static_assert(offsetof(WB_MsgSelect_C_SetSelectItemNameByIndex, ArgScriptMessageLabel) == 0x000000, "Member 'WB_MsgSelect_C_SetSelectItemNameByIndex::ArgScriptMessageLabel' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetSelectItemNameByIndex, Argindex) == 0x000008, "Member 'WB_MsgSelect_C_SetSelectItemNameByIndex::Argindex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetSelectItemNameByIndex, InAfterBuild) == 0x00000C, "Member 'WB_MsgSelect_C_SetSelectItemNameByIndex::InAfterBuild' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SetSelectItemName
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgSelect_C_SetSelectItemName final
{
public:
	class UScriptMessageAsset*                    ArgScriptMessageLabel;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Argselectitemname;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAfterBuild;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SetSelectItemName) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SetSelectItemName");
static_assert(sizeof(WB_MsgSelect_C_SetSelectItemName) == 0x000018, "Wrong size on WB_MsgSelect_C_SetSelectItemName");
static_assert(offsetof(WB_MsgSelect_C_SetSelectItemName, ArgScriptMessageLabel) == 0x000000, "Member 'WB_MsgSelect_C_SetSelectItemName::ArgScriptMessageLabel' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetSelectItemName, Argselectitemname) == 0x000008, "Member 'WB_MsgSelect_C_SetSelectItemName::Argselectitemname' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetSelectItemName, InAfterBuild) == 0x000010, "Member 'WB_MsgSelect_C_SetSelectItemName::InAfterBuild' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.GetText
// 0x0030 (0x0030 - 0x0000)
struct WB_MsgSelect_C_GetText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
};
static_assert(alignof(WB_MsgSelect_C_GetText) == 0x000008, "Wrong alignment on WB_MsgSelect_C_GetText");
static_assert(sizeof(WB_MsgSelect_C_GetText) == 0x000030, "Wrong size on WB_MsgSelect_C_GetText");
static_assert(offsetof(WB_MsgSelect_C_GetText, OutText) == 0x000000, "Member 'WB_MsgSelect_C_GetText::OutText' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_GetText, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'WB_MsgSelect_C_GetText::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgSelect_C_SetText final
{
public:
	bool                                          InAfterBuild;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_GetSelectText_Text;                       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SetText) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SetText");
static_assert(sizeof(WB_MsgSelect_C_SetText) == 0x000018, "Wrong size on WB_MsgSelect_C_SetText");
static_assert(offsetof(WB_MsgSelect_C_SetText, InAfterBuild) == 0x000000, "Member 'WB_MsgSelect_C_SetText::InAfterBuild' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetText, CallFunc_GetSelectText_Text) == 0x000008, "Member 'WB_MsgSelect_C_SetText::CallFunc_GetSelectText_Text' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.NewIconOn
// 0x0008 (0x0008 - 0x0000)
struct WB_MsgSelect_C_NewIconOn final
{
public:
	int32                                         InStartFrame;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInitialize;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_NewIconOn) == 0x000004, "Wrong alignment on WB_MsgSelect_C_NewIconOn");
static_assert(sizeof(WB_MsgSelect_C_NewIconOn) == 0x000008, "Wrong size on WB_MsgSelect_C_NewIconOn");
static_assert(offsetof(WB_MsgSelect_C_NewIconOn, InStartFrame) == 0x000000, "Member 'WB_MsgSelect_C_NewIconOn::InStartFrame' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_NewIconOn, InInitialize) == 0x000004, "Member 'WB_MsgSelect_C_NewIconOn::InInitialize' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_NewIconOn, CallFunc_Play_ReturnValue) == 0x000005, "Member 'WB_MsgSelect_C_NewIconOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.IsNewIconOn
// 0x0002 (0x0002 - 0x0000)
struct WB_MsgSelect_C_IsNewIconOn final
{
public:
	bool                                          Outnewicon;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewLocalVar_0;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_IsNewIconOn) == 0x000001, "Wrong alignment on WB_MsgSelect_C_IsNewIconOn");
static_assert(sizeof(WB_MsgSelect_C_IsNewIconOn) == 0x000002, "Wrong size on WB_MsgSelect_C_IsNewIconOn");
static_assert(offsetof(WB_MsgSelect_C_IsNewIconOn, Outnewicon) == 0x000000, "Member 'WB_MsgSelect_C_IsNewIconOn::Outnewicon' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_IsNewIconOn, NewLocalVar_0) == 0x000001, "Member 'WB_MsgSelect_C_IsNewIconOn::NewLocalVar_0' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SetTextByIndex
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgSelect_C_SetTextByIndex final
{
public:
	bool                                          InAfterBuild;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_GetSelectText_Text;                       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SetTextByIndex) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SetTextByIndex");
static_assert(sizeof(WB_MsgSelect_C_SetTextByIndex) == 0x000018, "Wrong size on WB_MsgSelect_C_SetTextByIndex");
static_assert(offsetof(WB_MsgSelect_C_SetTextByIndex, InAfterBuild) == 0x000000, "Member 'WB_MsgSelect_C_SetTextByIndex::InAfterBuild' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextByIndex, CallFunc_GetSelectText_Text) == 0x000008, "Member 'WB_MsgSelect_C_SetTextByIndex::CallFunc_GetSelectText_Text' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SelectCursorNewIconOn
// 0x000C (0x000C - 0x0000)
struct WB_MsgSelect_C_SelectCursorNewIconOn final
{
public:
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SelectCursorNewIconOn) == 0x000004, "Wrong alignment on WB_MsgSelect_C_SelectCursorNewIconOn");
static_assert(sizeof(WB_MsgSelect_C_SelectCursorNewIconOn) == 0x00000C, "Wrong size on WB_MsgSelect_C_SelectCursorNewIconOn");
static_assert(offsetof(WB_MsgSelect_C_SelectCursorNewIconOn, CallFunc_GetPlayFrame_ReturnValue) == 0x000000, "Member 'WB_MsgSelect_C_SelectCursorNewIconOn::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SelectCursorNewIconOn, CallFunc_FTrunc_ReturnValue) == 0x000004, "Member 'WB_MsgSelect_C_SelectCursorNewIconOn::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SelectCursorNewIconOn, CallFunc_Play_ReturnValue) == 0x000008, "Member 'WB_MsgSelect_C_SelectCursorNewIconOn::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SelectCursorOn
// 0x0002 (0x0002 - 0x0000)
struct WB_MsgSelect_C_SelectCursorOn final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SelectCursorOn) == 0x000001, "Wrong alignment on WB_MsgSelect_C_SelectCursorOn");
static_assert(sizeof(WB_MsgSelect_C_SelectCursorOn) == 0x000002, "Wrong size on WB_MsgSelect_C_SelectCursorOn");
static_assert(offsetof(WB_MsgSelect_C_SelectCursorOn, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_MsgSelect_C_SelectCursorOn::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SelectCursorOn, CallFunc_Play_ReturnValue_1) == 0x000001, "Member 'WB_MsgSelect_C_SelectCursorOn::CallFunc_Play_ReturnValue_1' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SelectCursorOff
// 0x0001 (0x0001 - 0x0000)
struct WB_MsgSelect_C_SelectCursorOff final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SelectCursorOff) == 0x000001, "Wrong alignment on WB_MsgSelect_C_SelectCursorOff");
static_assert(sizeof(WB_MsgSelect_C_SelectCursorOff) == 0x000001, "Wrong size on WB_MsgSelect_C_SelectCursorOff");
static_assert(offsetof(WB_MsgSelect_C_SelectCursorOff, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_MsgSelect_C_SelectCursorOff::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.sSetSelectCursorTextParam
// 0x0068 (0x0068 - 0x0000)
struct WB_MsgSelect_C_SSetSelectCursorTextParam final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_BuildText_self_CastInput;                 // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IMessageTagInterface>  CallFunc_GetSelectText_Text;                       // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValueParam_ReturnValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F3[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetValueParam_self_CastInput;             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SSetSelectCursorTextParam) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SSetSelectCursorTextParam");
static_assert(sizeof(WB_MsgSelect_C_SSetSelectCursorTextParam) == 0x000068, "Wrong size on WB_MsgSelect_C_SSetSelectCursorTextParam");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, CallFunc_BuildText_self_CastInput) == 0x000000, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::CallFunc_BuildText_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, CallFunc_GetSelectText_Text) == 0x000010, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::CallFunc_GetSelectText_Text' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000020, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000030, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, Temp_int_Variable) == 0x000040, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, CallFunc_GetValueParam_ReturnValue) == 0x000048, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::CallFunc_GetValueParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, CallFunc_SetValueParam_self_CastInput) == 0x000050, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::CallFunc_SetValueParam_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SSetSelectCursorTextParam, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'WB_MsgSelect_C_SSetSelectCursorTextParam::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SetBuildTextLater
// 0x0010 (0x0010 - 0x0000)
struct WB_MsgSelect_C_SetBuildTextLater final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_GetSelectText_Text;                       // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SetBuildTextLater) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SetBuildTextLater");
static_assert(sizeof(WB_MsgSelect_C_SetBuildTextLater) == 0x000010, "Wrong size on WB_MsgSelect_C_SetBuildTextLater");
static_assert(offsetof(WB_MsgSelect_C_SetBuildTextLater, CallFunc_GetSelectText_Text) == 0x000000, "Member 'WB_MsgSelect_C_SetBuildTextLater::CallFunc_GetSelectText_Text' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SetRichTextValueParam
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgSelect_C_SetRichTextValueParam final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValueParam;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMessageTagInterface>  CallFunc_GetSelectText_Text;                       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_SetRichTextValueParam) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SetRichTextValueParam");
static_assert(sizeof(WB_MsgSelect_C_SetRichTextValueParam) == 0x000018, "Wrong size on WB_MsgSelect_C_SetRichTextValueParam");
static_assert(offsetof(WB_MsgSelect_C_SetRichTextValueParam, InIndex) == 0x000000, "Member 'WB_MsgSelect_C_SetRichTextValueParam::InIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetRichTextValueParam, InValueParam) == 0x000004, "Member 'WB_MsgSelect_C_SetRichTextValueParam::InValueParam' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetRichTextValueParam, CallFunc_GetSelectText_Text) == 0x000008, "Member 'WB_MsgSelect_C_SetRichTextValueParam::CallFunc_GetSelectText_Text' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.IsFinishedSelect
// 0x0002 (0x0002 - 0x0000)
struct WB_MsgSelect_C_IsFinishedSelect final
{
public:
	bool                                          OutParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNAND_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_IsFinishedSelect) == 0x000001, "Wrong alignment on WB_MsgSelect_C_IsFinishedSelect");
static_assert(sizeof(WB_MsgSelect_C_IsFinishedSelect) == 0x000002, "Wrong size on WB_MsgSelect_C_IsFinishedSelect");
static_assert(offsetof(WB_MsgSelect_C_IsFinishedSelect, OutParam) == 0x000000, "Member 'WB_MsgSelect_C_IsFinishedSelect::OutParam' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_IsFinishedSelect, CallFunc_BooleanNAND_ReturnValue) == 0x000001, "Member 'WB_MsgSelect_C_IsFinishedSelect::CallFunc_BooleanNAND_ReturnValue' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.GetNewIconFrame
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgSelect_C_GetNewIconFrame final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutFrame;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Retframe;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F4[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayFrame_ReturnValue_1;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_GetNewIconFrame) == 0x000004, "Wrong alignment on WB_MsgSelect_C_GetNewIconFrame");
static_assert(sizeof(WB_MsgSelect_C_GetNewIconFrame) == 0x000018, "Wrong size on WB_MsgSelect_C_GetNewIconFrame");
static_assert(offsetof(WB_MsgSelect_C_GetNewIconFrame, InType) == 0x000000, "Member 'WB_MsgSelect_C_GetNewIconFrame::InType' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_GetNewIconFrame, OutFrame) == 0x000004, "Member 'WB_MsgSelect_C_GetNewIconFrame::OutFrame' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_GetNewIconFrame, Retframe) == 0x000008, "Member 'WB_MsgSelect_C_GetNewIconFrame::Retframe' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_GetNewIconFrame, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'WB_MsgSelect_C_GetNewIconFrame::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_GetNewIconFrame, CallFunc_GetPlayFrame_ReturnValue) == 0x000010, "Member 'WB_MsgSelect_C_GetNewIconFrame::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_GetNewIconFrame, CallFunc_GetPlayFrame_ReturnValue_1) == 0x000014, "Member 'WB_MsgSelect_C_GetNewIconFrame::CallFunc_GetPlayFrame_ReturnValue_1' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SetTextColor
// 0x0188 (0x0188 - 0x0000)
struct WB_MsgSelect_C_SetTextColor final
{
public:
	bool                                          Disabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F6[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0018(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0038(0x0058)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings_1;           // 0x00A0(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x00C0(0x0058)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0128(0x0028)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0160(0x0028)()
};
static_assert(alignof(WB_MsgSelect_C_SetTextColor) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SetTextColor");
static_assert(sizeof(WB_MsgSelect_C_SetTextColor) == 0x000188, "Wrong size on WB_MsgSelect_C_SetTextColor");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, Disabled) == 0x000000, "Member 'WB_MsgSelect_C_SetTextColor::Disabled' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WB_MsgSelect_C_SetTextColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, K2Node_MakeStruct_FontOutlineSettings) == 0x000018, "Member 'WB_MsgSelect_C_SetTextColor::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, K2Node_MakeStruct_SlateFontInfo) == 0x000038, "Member 'WB_MsgSelect_C_SetTextColor::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, CallFunc_SelectColor_ReturnValue_1) == 0x000090, "Member 'WB_MsgSelect_C_SetTextColor::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, K2Node_MakeStruct_FontOutlineSettings_1) == 0x0000A0, "Member 'WB_MsgSelect_C_SetTextColor::K2Node_MakeStruct_FontOutlineSettings_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, K2Node_MakeStruct_SlateFontInfo_1) == 0x0000C0, "Member 'WB_MsgSelect_C_SetTextColor::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, CallFunc_SelectColor_ReturnValue_2) == 0x000118, "Member 'WB_MsgSelect_C_SetTextColor::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, K2Node_MakeStruct_SlateColor) == 0x000128, "Member 'WB_MsgSelect_C_SetTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, CallFunc_SelectColor_ReturnValue_3) == 0x000150, "Member 'WB_MsgSelect_C_SetTextColor::CallFunc_SelectColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetTextColor, K2Node_MakeStruct_SlateColor_1) == 0x000160, "Member 'WB_MsgSelect_C_SetTextColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.GetSelectText
// 0x0010 (0x0010 - 0x0000)
struct WB_MsgSelect_C_GetSelectText final
{
public:
	TScriptInterface<class IMessageTagInterface>  Text;                                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelect_C_GetSelectText) == 0x000008, "Wrong alignment on WB_MsgSelect_C_GetSelectText");
static_assert(sizeof(WB_MsgSelect_C_GetSelectText) == 0x000010, "Wrong size on WB_MsgSelect_C_GetSelectText");
static_assert(offsetof(WB_MsgSelect_C_GetSelectText, Text) == 0x000000, "Member 'WB_MsgSelect_C_GetSelectText::Text' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.SetGardenTalkIcon
// 0x0098 (0x0098 - 0x0000)
struct WB_MsgSelect_C_SetGardenTalkIcon final
{
public:
	TMap<int32, E_MINIMAP_POI_ICON>               NewLocalVar_1;                                     // 0x0000(0x0050)(Edit, BlueprintVisible)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGardenTalkPointManager*                CallFunc_GetGardenTalkPointManager_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MINIMAP_POI_ICON                            CallFunc_CheckGardenTalkFlag_Any_DisplayIconType;  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGardenTalkFlag_Any_ReturnValue;      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F7[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGardenTalkIconUV_OutU;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGardenTalkIconUV_OutV;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelect_C_SetGardenTalkIcon) == 0x000008, "Wrong alignment on WB_MsgSelect_C_SetGardenTalkIcon");
static_assert(sizeof(WB_MsgSelect_C_SetGardenTalkIcon) == 0x000098, "Wrong size on WB_MsgSelect_C_SetGardenTalkIcon");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, NewLocalVar_1) == 0x000000, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000058, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, CallFunc_GetGardenTalkPointManager_ReturnValue) == 0x000060, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::CallFunc_GetGardenTalkPointManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, CallFunc_CheckGardenTalkFlag_Any_DisplayIconType) == 0x000069, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::CallFunc_CheckGardenTalkFlag_Any_DisplayIconType' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, CallFunc_CheckGardenTalkFlag_Any_ReturnValue) == 0x00006A, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::CallFunc_CheckGardenTalkFlag_Any_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, CallFunc_GetGardenTalkIconUV_OutU) == 0x00006C, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::CallFunc_GetGardenTalkIconUV_OutU' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, CallFunc_GetGardenTalkIconUV_OutV) == 0x000070, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::CallFunc_GetGardenTalkIconUV_OutV' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, K2Node_MakeStruct_LinearColor) == 0x000074, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_MsgSelect_C_SetGardenTalkIcon, K2Node_MakeStruct_LinearColor_1) == 0x000084, "Member 'WB_MsgSelect_C_SetGardenTalkIcon::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");

// Function WB_MsgSelect.WB_MsgSelect_C.GetGardenTalkIconUV
// 0x0038 (0x0038 - 0x0000)
struct WB_MsgSelect_C_GetGardenTalkIconUV final
{
public:
	E_MINIMAP_POI_ICON                            InIconType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutU;                                              // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutV;                                              // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_POI_ICON                            Loicon;                                            // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F9[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22FA[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetIconMaterial_OutU;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIconMaterial_OutV;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetIconMaterial_OutColor;                 // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
