#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MsgSelectMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MsgSelectMenu.WB_MsgSelectMenu_C
// 0x00B0 (0x0310 - 0x0260)
class UWB_MsgSelectMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           MainPanel;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SelectPanel;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidgetIcon;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        WB_MsgSelect0;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        WB_MsgSelect1;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        WB_MsgSelect2;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        WB_MsgSelect3;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        WB_MsgSelect4;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        WB_MsgSelect5;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        WB_MsgSelect6;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        WB_MsgSelect7;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Cursornum;                                         // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CursorIndex;                                       // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Oldcursor;                                         // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Localcursor;                                       // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Localmax;                                          // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344A[0x4];                                     // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_MsgSelect_C*>                Msgselectwork;                                     // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsBuildLater;                                      // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344B[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Defaultcursorpos;                                  // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnAnyItemClicked;                                  // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnAnyItemSelected;                                 // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnAnyItemClicked__DelegateSignature(int32 InIndex);
	void OnAnyItemSelected__DelegateSignature(int32 InIndex);
	void ExecuteUbergraph_WB_MsgSelectMenu(int32 EntryPoint);
	void OnMouseSelected(int32 InIndex);
	void OnMouseClicked(int32 InIndex);
	void InitializeSelectMenu();
	void SetMsgSelectOut();
	void SetMsgSelectIn();
	void BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void MessageSelect_Out();
	void MessageSelect_In(int32 MenuNum, int32 InDefaultCursor);
	void Construct();
	void MessageSelectEnd();
	void AddSelect();
	void DecSelect();
	void SetSelectCursorOffset(int32 Param_Defaultcursorpos, bool InInitPositionFlag);
	void SetSelectMessage(class UScriptMessageAsset* ScriptMessageAsset, class FName Selectitem0, class FName Selectitem1, class FName Selectitem2, class FName Selectitem3, class FName Selectitem4, class FName Selectitem5, class FName Selectitem6, class FName Selectitem7);
	void SetSelectCursorText(int32 CursorPos);
	void SetSelectNewIcon(bool Argnewicon0, bool Argnewicon1, bool Argnewicon2, bool Argnewicon3, bool Argnewicon4);
	void PresetSelectNewIcon();
	void SetSelectCursorNewIcon();
	void ResetSelectNewIcon();
	void GetSelectCursorIndex(int32* Outcursorindex);
	void SetSelectMessageByIndex(class UScriptMessageAsset* InScriptMessageAsset, int32 InSelectItem0, int32 InSelectItem1, int32 InSelectItem2, int32 InSelectItem3, int32 InSelectItem4, int32 InSelectItem5, int32 InSelectItem6, int32 InSelectItem7);
	void SetSelectMessageBuildLater(bool InBuildLater);
	void SetSelectMessageBuildText();
	void SetRichSelectTextValueParam(int32 InSelectIndex, int32 InIndex, int32 InValueParam);
	void IsFinishedSelectMenu(bool* OutParam);
	void GetNewIconFrame(int32* OutFrame);
	void SetSelectTextColor(TArray<bool>& Disabled);
	void SetSelectNewIconArray(bool UseNew, TArray<bool>& New);
	void SetMenuNum(int32 MenuNum);
	void SetSelectCursorMin();
	void SetSelectCursorMax();
	void GetSelectCursorNum(int32* OutCursorNum);
	void CreateMsgSelectWork();
	void GetMsgSelectWork(int32 InIndex, class UWB_MsgSelect_C** OutMsgSelctWork);
	void SetGardenTalkIcon(int32 InCursorIndex);
	void ResetGardenTalkIcon(int32 InCursorIndex);
	void OldSelectCursorOff(bool InAllClear);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MsgSelectMenu_C">();
	}
	static class UWB_MsgSelectMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MsgSelectMenu_C>();
	}
};
static_assert(alignof(UWB_MsgSelectMenu_C) == 0x000008, "Wrong alignment on UWB_MsgSelectMenu_C");
static_assert(sizeof(UWB_MsgSelectMenu_C) == 0x000310, "Wrong size on UWB_MsgSelectMenu_C");
static_assert(offsetof(UWB_MsgSelectMenu_C, UberGraphFrame) == 0x000260, "Member 'UWB_MsgSelectMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, MainPanel) == 0x000268, "Member 'UWB_MsgSelectMenu_C::MainPanel' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, SelectPanel) == 0x000270, "Member 'UWB_MsgSelectMenu_C::SelectPanel' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, SsPlayerWidgetIcon) == 0x000278, "Member 'UWB_MsgSelectMenu_C::SsPlayerWidgetIcon' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, WB_MsgSelect0) == 0x000280, "Member 'UWB_MsgSelectMenu_C::WB_MsgSelect0' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, WB_MsgSelect1) == 0x000288, "Member 'UWB_MsgSelectMenu_C::WB_MsgSelect1' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, WB_MsgSelect2) == 0x000290, "Member 'UWB_MsgSelectMenu_C::WB_MsgSelect2' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, WB_MsgSelect3) == 0x000298, "Member 'UWB_MsgSelectMenu_C::WB_MsgSelect3' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, WB_MsgSelect4) == 0x0002A0, "Member 'UWB_MsgSelectMenu_C::WB_MsgSelect4' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, WB_MsgSelect5) == 0x0002A8, "Member 'UWB_MsgSelectMenu_C::WB_MsgSelect5' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, WB_MsgSelect6) == 0x0002B0, "Member 'UWB_MsgSelectMenu_C::WB_MsgSelect6' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, WB_MsgSelect7) == 0x0002B8, "Member 'UWB_MsgSelectMenu_C::WB_MsgSelect7' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, Cursornum) == 0x0002C0, "Member 'UWB_MsgSelectMenu_C::Cursornum' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, CursorIndex) == 0x0002C4, "Member 'UWB_MsgSelectMenu_C::CursorIndex' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, Oldcursor) == 0x0002C8, "Member 'UWB_MsgSelectMenu_C::Oldcursor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, Localcursor) == 0x0002CC, "Member 'UWB_MsgSelectMenu_C::Localcursor' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, Localmax) == 0x0002D0, "Member 'UWB_MsgSelectMenu_C::Localmax' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, Msgselectwork) == 0x0002D8, "Member 'UWB_MsgSelectMenu_C::Msgselectwork' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, IsBuildLater) == 0x0002E8, "Member 'UWB_MsgSelectMenu_C::IsBuildLater' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, Defaultcursorpos) == 0x0002EC, "Member 'UWB_MsgSelectMenu_C::Defaultcursorpos' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, OnAnyItemClicked) == 0x0002F0, "Member 'UWB_MsgSelectMenu_C::OnAnyItemClicked' has a wrong offset!");
static_assert(offsetof(UWB_MsgSelectMenu_C, OnAnyItemSelected) == 0x000300, "Member 'UWB_MsgSelectMenu_C::OnAnyItemSelected' has a wrong offset!");

}

