#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapIconHelpWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_SortState_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MapIconHelpWindow.WB_MapIconHelpWindow_C
// 0x0038 (0x0298 - 0x0260)
class UWB_MapIconHelpWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USsPlayerWidget*                        SsPlayerWidget_BG;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_ScrollBar;                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_title;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MapIconHelpList_C*                  WB_MapIconHelpList;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ScrollBar_C*                        WB_ScrollBar;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         M_MaxDisplayCount;                                 // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SortState                                   M_State;                                           // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableMouseInput;                                // 0x0295(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_MapIconHelpWindow(int32 EntryPoint);
	void BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void ScrollPageDown(bool IsTrigger);
	void Construct();
	void ScrollPageUp(bool IsTrigger);
	void ScrollUp(bool IsTrigger);
	void ScrollDown(bool IsTrigger);
	void BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Open(const class USsPlayerWidget* SsPos);
	void Close();
	void InitScrollBarPosition(class USsPlayerWidget*& SsPos);
	void CheckShowScrollBar();
	bool IsShowScrollBar();
	void UpdateScrollBar();
	void SetHelpMessage();
	void UpdateTitle(class USsPlayerWidget*& SsPos);
	void UpdateBG(class USsPlayerWidget*& SsPos);
	void ListIn(class USsPlayerWidget*& SsPos);
	void ListOut();
	void ExecuteActionSelected();
	void ScollBarScrolledByMouse(float Position);
	void BindEvents();
	void OnListSelectionChanged();
	void UnbindEvents();
	void UpdateMouseWheel();
	void IsMouseWheelArea(bool* Inside);
	void EnableMouseInput();
	void DisableMouseInput();
	void CheckMouseInputEnabled(bool* Enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MapIconHelpWindow_C">();
	}
	static class UWB_MapIconHelpWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MapIconHelpWindow_C>();
	}
};
static_assert(alignof(UWB_MapIconHelpWindow_C) == 0x000008, "Wrong alignment on UWB_MapIconHelpWindow_C");
static_assert(sizeof(UWB_MapIconHelpWindow_C) == 0x000298, "Wrong size on UWB_MapIconHelpWindow_C");
static_assert(offsetof(UWB_MapIconHelpWindow_C, UberGraphFrame) == 0x000260, "Member 'UWB_MapIconHelpWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpWindow_C, SsPlayerWidget_BG) == 0x000268, "Member 'UWB_MapIconHelpWindow_C::SsPlayerWidget_BG' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpWindow_C, SsPlayerWidget_ScrollBar) == 0x000270, "Member 'UWB_MapIconHelpWindow_C::SsPlayerWidget_ScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpWindow_C, SsPlayerWidget_title) == 0x000278, "Member 'UWB_MapIconHelpWindow_C::SsPlayerWidget_title' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpWindow_C, WB_MapIconHelpList) == 0x000280, "Member 'UWB_MapIconHelpWindow_C::WB_MapIconHelpList' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpWindow_C, WB_ScrollBar) == 0x000288, "Member 'UWB_MapIconHelpWindow_C::WB_ScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpWindow_C, M_MaxDisplayCount) == 0x000290, "Member 'UWB_MapIconHelpWindow_C::M_MaxDisplayCount' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpWindow_C, M_State) == 0x000294, "Member 'UWB_MapIconHelpWindow_C::M_State' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpWindow_C, IsEnableMouseInput) == 0x000295, "Member 'UWB_MapIconHelpWindow_C::IsEnableMouseInput' has a wrong offset!");

}

