#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MsgSelectMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.OnAnyItemClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_MsgSelectMenu_C_OnAnyItemClicked__DelegateSignature final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_OnAnyItemClicked__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_OnAnyItemClicked__DelegateSignature");
static_assert(sizeof(WB_MsgSelectMenu_C_OnAnyItemClicked__DelegateSignature) == 0x000004, "Wrong size on WB_MsgSelectMenu_C_OnAnyItemClicked__DelegateSignature");
static_assert(offsetof(WB_MsgSelectMenu_C_OnAnyItemClicked__DelegateSignature, InIndex) == 0x000000, "Member 'WB_MsgSelectMenu_C_OnAnyItemClicked__DelegateSignature::InIndex' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.OnAnyItemSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_MsgSelectMenu_C_OnAnyItemSelected__DelegateSignature final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_OnAnyItemSelected__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_OnAnyItemSelected__DelegateSignature");
static_assert(sizeof(WB_MsgSelectMenu_C_OnAnyItemSelected__DelegateSignature) == 0x000004, "Wrong size on WB_MsgSelectMenu_C_OnAnyItemSelected__DelegateSignature");
static_assert(offsetof(WB_MsgSelectMenu_C_OnAnyItemSelected__DelegateSignature, InIndex) == 0x000000, "Member 'WB_MsgSelectMenu_C_OnAnyItemSelected__DelegateSignature::InIndex' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.ExecuteUbergraph_WB_MsgSelectMenu
// 0x00D8 (0x00D8 - 0x0000)
struct WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_menunum;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InDefaultCursor;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344C[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_6;             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(int32 InIndex)>                K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_7;             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_8;             // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_9;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_10;            // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_10;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_11;            // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_11;               // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_12;            // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_12;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_13;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_13;               // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344D[0x1];                                     // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344E[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_3;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344F[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_4;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3450[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNewIconFrame_OutFrame;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNewIconFrame_OutFrame_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNewIconFrame_OutFrame_2;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNewIconFrame_OutFrame_3;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNewIconFrame_OutFrame_4;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InIndex)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetNewIconFrame_OutFrame_5;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_5;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3451[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNewIconFrame_OutFrame_6;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_7;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_6;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3452[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNewIconFrame_OutFrame_7;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_8;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_7;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3453[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InIndex_1;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InIndex;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_9;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_10;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_11;           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu");
static_assert(sizeof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu) == 0x0000D8, "Wrong size on WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, EntryPoint) == 0x000000, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_CustomEvent_menunum) == 0x000004, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_CustomEvent_menunum' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_CustomEvent_InDefaultCursor) == 0x000008, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_CustomEvent_InDefaultCursor' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Play_ReturnValue) == 0x000011, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_ComponentBoundEvent_AnimPackName) == 0x000014, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_ComponentBoundEvent_AnimationName) == 0x00001C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000024, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000028, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_SwitchName_CmpSuccess) == 0x00002C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Play_ReturnValue_1) == 0x00002D, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x00002E, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00002F, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000030, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x000031, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000032, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_2) == 0x000033, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000034, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_3) == 0x000035, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_4) == 0x000036, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_4) == 0x000037, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_5) == 0x000038, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_5) == 0x000039, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_6) == 0x00003A, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_6) == 0x00003B, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Play_ReturnValue_2) == 0x00004C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_7) == 0x00004D, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_7) == 0x00004E, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_8) == 0x00004F, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_8) == 0x000050, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_9) == 0x000051, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_9) == 0x000052, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_10) == 0x000053, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_10) == 0x000054, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_11) == 0x000055, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_11) == 0x000056, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_12) == 0x000057, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_12) == 0x000058, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Greater_IntInt_ReturnValue_13) == 0x000059, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Greater_IntInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Less_IntInt_ReturnValue_13) == 0x00005A, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Less_IntInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00005C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000060, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000064, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000065, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000068, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x00006C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x000070, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue_3) == 0x000071, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_5) == 0x000074, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue_4) == 0x000078, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Play_ReturnValue_3) == 0x000079, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_GetNewIconFrame_OutFrame) == 0x00007C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_GetNewIconFrame_OutFrame' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_GetNewIconFrame_OutFrame_1) == 0x000080, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_GetNewIconFrame_OutFrame_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_GetNewIconFrame_OutFrame_2) == 0x000084, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_GetNewIconFrame_OutFrame_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_GetNewIconFrame_OutFrame_3) == 0x000088, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_GetNewIconFrame_OutFrame_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_GetNewIconFrame_OutFrame_4) == 0x00008C, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_GetNewIconFrame_OutFrame_4' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_GetNewIconFrame_OutFrame_5) == 0x0000A0, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_GetNewIconFrame_OutFrame_5' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_6) == 0x0000A4, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue_5) == 0x0000A8, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_GetNewIconFrame_OutFrame_6) == 0x0000AC, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_GetNewIconFrame_OutFrame_6' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_7) == 0x0000B0, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue_6) == 0x0000B4, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_GetNewIconFrame_OutFrame_7) == 0x0000B8, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_GetNewIconFrame_OutFrame_7' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_8) == 0x0000BC, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_NotEqual_IntInt_ReturnValue_7) == 0x0000C0, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_NotEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_CustomEvent_InIndex_1) == 0x0000C4, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_CustomEvent_InIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, K2Node_CustomEvent_InIndex) == 0x0000C8, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::K2Node_CustomEvent_InIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_9) == 0x0000CC, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_10) == 0x0000D0, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu, CallFunc_Subtract_IntInt_ReturnValue_11) == 0x0000D4, "Member 'WB_MsgSelectMenu_C_ExecuteUbergraph_WB_MsgSelectMenu::CallFunc_Subtract_IntInt_ReturnValue_11' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.OnMouseSelected
// 0x0004 (0x0004 - 0x0000)
struct WB_MsgSelectMenu_C_OnMouseSelected final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_OnMouseSelected) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_OnMouseSelected");
static_assert(sizeof(WB_MsgSelectMenu_C_OnMouseSelected) == 0x000004, "Wrong size on WB_MsgSelectMenu_C_OnMouseSelected");
static_assert(offsetof(WB_MsgSelectMenu_C_OnMouseSelected, InIndex) == 0x000000, "Member 'WB_MsgSelectMenu_C_OnMouseSelected::InIndex' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.OnMouseClicked
// 0x0004 (0x0004 - 0x0000)
struct WB_MsgSelectMenu_C_OnMouseClicked final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_OnMouseClicked) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_OnMouseClicked");
static_assert(sizeof(WB_MsgSelectMenu_C_OnMouseClicked) == 0x000004, "Wrong size on WB_MsgSelectMenu_C_OnMouseClicked");
static_assert(offsetof(WB_MsgSelectMenu_C_OnMouseClicked, InIndex) == 0x000000, "Member 'WB_MsgSelectMenu_C_OnMouseClicked::InIndex' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MsgSelectMenu_C_BndEvt__SelectPanel_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.MessageSelect_In
// 0x0008 (0x0008 - 0x0000)
struct WB_MsgSelectMenu_C_MessageSelect_In final
{
public:
	int32                                         MenuNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDefaultCursor;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_MessageSelect_In) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_MessageSelect_In");
static_assert(sizeof(WB_MsgSelectMenu_C_MessageSelect_In) == 0x000008, "Wrong size on WB_MsgSelectMenu_C_MessageSelect_In");
static_assert(offsetof(WB_MsgSelectMenu_C_MessageSelect_In, MenuNum) == 0x000000, "Member 'WB_MsgSelectMenu_C_MessageSelect_In::MenuNum' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_MessageSelect_In, InDefaultCursor) == 0x000004, "Member 'WB_MsgSelectMenu_C_MessageSelect_In::InDefaultCursor' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.AddSelect
// 0x0010 (0x0010 - 0x0000)
struct WB_MsgSelectMenu_C_AddSelect final
{
public:
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3454[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3455[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_AddSelect) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_AddSelect");
static_assert(sizeof(WB_MsgSelectMenu_C_AddSelect) == 0x000010, "Wrong size on WB_MsgSelectMenu_C_AddSelect");
static_assert(offsetof(WB_MsgSelectMenu_C_AddSelect, CallFunc_Greater_IntInt_ReturnValue) == 0x000000, "Member 'WB_MsgSelectMenu_C_AddSelect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_AddSelect, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_MsgSelectMenu_C_AddSelect::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_AddSelect, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'WB_MsgSelectMenu_C_AddSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_AddSelect, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_MsgSelectMenu_C_AddSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.DecSelect
// 0x000C (0x000C - 0x0000)
struct WB_MsgSelectMenu_C_DecSelect final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3456[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_DecSelect) == 0x000004, "Wrong alignment on WB_MsgSelectMenu_C_DecSelect");
static_assert(sizeof(WB_MsgSelectMenu_C_DecSelect) == 0x00000C, "Wrong size on WB_MsgSelectMenu_C_DecSelect");
static_assert(offsetof(WB_MsgSelectMenu_C_DecSelect, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WB_MsgSelectMenu_C_DecSelect::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_DecSelect, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WB_MsgSelectMenu_C_DecSelect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_DecSelect, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'WB_MsgSelectMenu_C_DecSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_DecSelect, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000008, "Member 'WB_MsgSelectMenu_C_DecSelect::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.SetSelectCursorOffset
// 0x0030 (0x0030 - 0x0000)
struct WB_MsgSelectMenu_C_SetSelectCursorOffset final
{
public:
	int32                                         Param_Defaultcursorpos;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InInitPositionFlag;                                // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3457[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MsgSelect_C*                        CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3458[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MsgSelect_C*                        CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3459[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MsgSelect_C*                        CallFunc_Array_Get_Item_2;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgSelectMenu_C_SetSelectCursorOffset) == 0x000008, "Wrong alignment on WB_MsgSelectMenu_C_SetSelectCursorOffset");
static_assert(sizeof(WB_MsgSelectMenu_C_SetSelectCursorOffset) == 0x000030, "Wrong size on WB_MsgSelectMenu_C_SetSelectCursorOffset");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, Param_Defaultcursorpos) == 0x000000, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::Param_Defaultcursorpos' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, InInitPositionFlag) == 0x000004, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::InInitPositionFlag' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_Less_IntInt_ReturnValue) == 0x000006, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_Less_IntInt_ReturnValue_1) == 0x000024, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectCursorOffset, CallFunc_Array_Get_Item_2) == 0x000028, "Member 'WB_MsgSelectMenu_C_SetSelectCursorOffset::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.SetSelectMessage
// 0x00A0 (0x00A0 - 0x0000)
struct WB_MsgSelectMenu_C_SetSelectMessage final
{
public:
	class UScriptMessageAsset*                    ScriptMessageAsset;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitem0;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitem1;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitem2;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitem3;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitem4;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitem5;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitem6;                                       // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Selectitem7;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345A[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MsgSelect_C*                        CallFunc_GetMsgSelectWork_OutMsgSelctWork;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        CallFunc_GetMsgSelectWork_OutMsgSelctWork_1;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        CallFunc_GetMsgSelectWork_OutMsgSelctWork_2;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        CallFunc_GetMsgSelectWork_OutMsgSelctWork_3;       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        CallFunc_GetMsgSelectWork_OutMsgSelctWork_4;       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        CallFunc_GetMsgSelectWork_OutMsgSelctWork_5;       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        CallFunc_GetMsgSelectWork_OutMsgSelctWork_6;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MsgSelect_C*                        CallFunc_GetMsgSelectWork_OutMsgSelctWork_7;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgSelectMenu_C_SetSelectMessage) == 0x000008, "Wrong alignment on WB_MsgSelectMenu_C_SetSelectMessage");
static_assert(sizeof(WB_MsgSelectMenu_C_SetSelectMessage) == 0x0000A0, "Wrong size on WB_MsgSelectMenu_C_SetSelectMessage");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, ScriptMessageAsset) == 0x000000, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::ScriptMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Selectitem0) == 0x000008, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Selectitem0' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Selectitem1) == 0x000010, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Selectitem1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Selectitem2) == 0x000018, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Selectitem2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Selectitem3) == 0x000020, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Selectitem3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Selectitem4) == 0x000028, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Selectitem4' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Selectitem5) == 0x000030, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Selectitem5' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Selectitem6) == 0x000038, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Selectitem6' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Selectitem7) == 0x000040, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Selectitem7' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, Temp_int_Variable) == 0x00004C, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_GetMsgSelectWork_OutMsgSelctWork) == 0x000058, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_GetMsgSelectWork_OutMsgSelctWork' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_GetMsgSelectWork_OutMsgSelctWork_1) == 0x000060, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_GetMsgSelectWork_OutMsgSelctWork_1' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_GetMsgSelectWork_OutMsgSelctWork_2) == 0x000068, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_GetMsgSelectWork_OutMsgSelctWork_2' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_GetMsgSelectWork_OutMsgSelctWork_3) == 0x000070, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_GetMsgSelectWork_OutMsgSelctWork_3' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_GetMsgSelectWork_OutMsgSelctWork_4) == 0x000078, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_GetMsgSelectWork_OutMsgSelctWork_4' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_GetMsgSelectWork_OutMsgSelctWork_5) == 0x000080, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_GetMsgSelectWork_OutMsgSelctWork_5' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_GetMsgSelectWork_OutMsgSelctWork_6) == 0x000088, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_GetMsgSelectWork_OutMsgSelctWork_6' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_GetMsgSelectWork_OutMsgSelctWork_7) == 0x000090, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_GetMsgSelectWork_OutMsgSelctWork_7' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, K2Node_SwitchInteger_CmpSuccess) == 0x000098, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MsgSelectMenu_C_SetSelectMessage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000099, "Member 'WB_MsgSelectMenu_C_SetSelectMessage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_MsgSelectMenu.WB_MsgSelectMenu_C.SetSelectCursorText
// 0x0010 (0x0010 - 0x0000)
struct WB_MsgSelectMenu_C_SetSelectCursorText final
{
public:
