#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MinimapOnOffList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MinimapOnOffList.WB_MinimapOnOffList_C
// 0x0038 (0x0298 - 0x0260)
class UWB_MinimapOnOffList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasForSlate;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ImageOverlay;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_MinimapOnOffEffect_C*>       EffectArray;                                       // 0x0278(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ENTRY_MAX;                                         // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RingBufferIndex;                                   // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CreateNum;                                         // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_MinimapOnOffList(int32 EntryPoint);
	void Construct();
	void CreateData();
	void Hide();
	void CreateOnOffEffectIcon(E_MINIMAP_POI_ICON Icon);
	void RingBufferRequest(int32* Param_Index);
	void CreateOnOffEffectAll();
	void CreateOnOffEffectRyuketsu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MinimapOnOffList_C">();
	}
	static class UWB_MinimapOnOffList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MinimapOnOffList_C>();
	}
};
static_assert(alignof(UWB_MinimapOnOffList_C) == 0x000008, "Wrong alignment on UWB_MinimapOnOffList_C");
static_assert(sizeof(UWB_MinimapOnOffList_C) == 0x000298, "Wrong size on UWB_MinimapOnOffList_C");
static_assert(offsetof(UWB_MinimapOnOffList_C, UberGraphFrame) == 0x000260, "Member 'UWB_MinimapOnOffList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MinimapOnOffList_C, CanvasForSlate) == 0x000268, "Member 'UWB_MinimapOnOffList_C::CanvasForSlate' has a wrong offset!");
static_assert(offsetof(UWB_MinimapOnOffList_C, ImageOverlay) == 0x000270, "Member 'UWB_MinimapOnOffList_C::ImageOverlay' has a wrong offset!");
static_assert(offsetof(UWB_MinimapOnOffList_C, EffectArray) == 0x000278, "Member 'UWB_MinimapOnOffList_C::EffectArray' has a wrong offset!");
static_assert(offsetof(UWB_MinimapOnOffList_C, ENTRY_MAX) == 0x000288, "Member 'UWB_MinimapOnOffList_C::ENTRY_MAX' has a wrong offset!");
static_assert(offsetof(UWB_MinimapOnOffList_C, RingBufferIndex) == 0x00028C, "Member 'UWB_MinimapOnOffList_C::RingBufferIndex' has a wrong offset!");
static_assert(offsetof(UWB_MinimapOnOffList_C, CreateNum) == 0x000290, "Member 'UWB_MinimapOnOffList_C::CreateNum' has a wrong offset!");

}

