#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MagatsuhiGauge

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.ExecuteUbergraph_WB_MagatsuhiGauge
// 0x008C (0x008C - 0x0000)
struct WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B4E[0x1];                                     // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B4F[0x1];                                     // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B50[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge) == 0x000004, "Wrong alignment on WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge");
static_assert(sizeof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge) == 0x00008C, "Wrong size on WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, EntryPoint) == 0x000000, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_Event_MyGeometry) == 0x000004, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000040, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_ComponentBoundEvent_AnimationName_1) == 0x000048, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x000050, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x000054, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_SwitchInteger_CmpSuccess) == 0x000058, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_SelectInt_ReturnValue) == 0x00005C, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_SelectInt_ReturnValue_1) == 0x000060, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_Not_PreBool_ReturnValue) == 0x000064, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000065, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_BooleanAND_ReturnValue_1) == 0x000066, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_ComponentBoundEvent_AnimPackName) == 0x000068, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_ComponentBoundEvent_AnimationName) == 0x000070, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000078, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, K2Node_ComponentBoundEvent_AnimationIndex) == 0x00007C, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_Less_IntInt_ReturnValue_1) == 0x000080, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_SelectInt_ReturnValue_2) == 0x000084, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge, CallFunc_SelectInt_ReturnValue_3) == 0x000088, "Member 'WB_MagatsuhiGauge_C_ExecuteUbergraph_WB_MagatsuhiGauge::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MagatsuhiGauge_C_BndEvt__WB_UpliftingGauge_SsPlayer_GaugeFlash_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MagatsuhiGauge_C_BndEvt__SsPlayer_BG_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_MagatsuhiGauge_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MagatsuhiGauge_C_Tick) == 0x000004, "Wrong alignment on WB_MagatsuhiGauge_C_Tick");
static_assert(sizeof(WB_MagatsuhiGauge_C_Tick) == 0x00003C, "Wrong size on WB_MagatsuhiGauge_C_Tick");
static_assert(offsetof(WB_MagatsuhiGauge_C_Tick, MyGeometry) == 0x000000, "Member 'WB_MagatsuhiGauge_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_MagatsuhiGauge_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.StartGaugeMax
// 0x0001 (0x0001 - 0x0000)
struct WB_MagatsuhiGauge_C_StartGaugeMax final
{
public:
	bool                                          CallFunc_IsDisappeared_IsDisappeared;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_StartGaugeMax) == 0x000001, "Wrong alignment on WB_MagatsuhiGauge_C_StartGaugeMax");
static_assert(sizeof(WB_MagatsuhiGauge_C_StartGaugeMax) == 0x000001, "Wrong size on WB_MagatsuhiGauge_C_StartGaugeMax");
static_assert(offsetof(WB_MagatsuhiGauge_C_StartGaugeMax, CallFunc_IsDisappeared_IsDisappeared) == 0x000000, "Member 'WB_MagatsuhiGauge_C_StartGaugeMax::CallFunc_IsDisappeared_IsDisappeared' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.EndGaugeMax
// 0x0001 (0x0001 - 0x0000)
struct WB_MagatsuhiGauge_C_EndGaugeMax final
{
public:
	bool                                          CallFunc_IsDisappeared_IsDisappeared;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_EndGaugeMax) == 0x000001, "Wrong alignment on WB_MagatsuhiGauge_C_EndGaugeMax");
static_assert(sizeof(WB_MagatsuhiGauge_C_EndGaugeMax) == 0x000001, "Wrong size on WB_MagatsuhiGauge_C_EndGaugeMax");
static_assert(offsetof(WB_MagatsuhiGauge_C_EndGaugeMax, CallFunc_IsDisappeared_IsDisappeared) == 0x000000, "Member 'WB_MagatsuhiGauge_C_EndGaugeMax::CallFunc_IsDisappeared_IsDisappeared' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.SetGaugeProgress
// 0x0010 (0x0010 - 0x0000)
struct WB_MagatsuhiGauge_C_SetGaugeProgress final
{
public:
	int32                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_CurrentGage;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayByIndex_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_SetGaugeProgress) == 0x000004, "Wrong alignment on WB_MagatsuhiGauge_C_SetGaugeProgress");
static_assert(sizeof(WB_MagatsuhiGauge_C_SetGaugeProgress) == 0x000010, "Wrong size on WB_MagatsuhiGauge_C_SetGaugeProgress");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeProgress, Progress) == 0x000000, "Member 'WB_MagatsuhiGauge_C_SetGaugeProgress::Progress' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeProgress, Lo_CurrentGage) == 0x000004, "Member 'WB_MagatsuhiGauge_C_SetGaugeProgress::Lo_CurrentGage' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeProgress, CallFunc_Clamp_ReturnValue) == 0x000008, "Member 'WB_MagatsuhiGauge_C_SetGaugeProgress::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeProgress, CallFunc_PlayByIndex_ReturnValue) == 0x00000C, "Member 'WB_MagatsuhiGauge_C_SetGaugeProgress::CallFunc_PlayByIndex_ReturnValue' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.PlayBG Anim
// 0x0030 (0x0030 - 0x0000)
struct WB_MagatsuhiGauge_C_PlayBG_Anim final
{
public:
	int32                                         AnimIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B51[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Lo_AnimNames;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_PlayBG_Anim) == 0x000008, "Wrong alignment on WB_MagatsuhiGauge_C_PlayBG_Anim");
static_assert(sizeof(WB_MagatsuhiGauge_C_PlayBG_Anim) == 0x000030, "Wrong size on WB_MagatsuhiGauge_C_PlayBG_Anim");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlayBG_Anim, AnimIndex) == 0x000000, "Member 'WB_MagatsuhiGauge_C_PlayBG_Anim::AnimIndex' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlayBG_Anim, IsLoop) == 0x000004, "Member 'WB_MagatsuhiGauge_C_PlayBG_Anim::IsLoop' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlayBG_Anim, Lo_AnimNames) == 0x000008, "Member 'WB_MagatsuhiGauge_C_PlayBG_Anim::Lo_AnimNames' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlayBG_Anim, K2Node_MakeArray_Array) == 0x000018, "Member 'WB_MagatsuhiGauge_C_PlayBG_Anim::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlayBG_Anim, CallFunc_SelectInt_ReturnValue) == 0x000028, "Member 'WB_MagatsuhiGauge_C_PlayBG_Anim::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlayBG_Anim, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00002C, "Member 'WB_MagatsuhiGauge_C_PlayBG_Anim::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlayBG_Anim, CallFunc_Play_ReturnValue) == 0x00002D, "Member 'WB_MagatsuhiGauge_C_PlayBG_Anim::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.InitializePos
// 0x0038 (0x0038 - 0x0000)
struct WB_MagatsuhiGauge_C_InitializePos final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B52[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B53[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayByIndex_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_InitializePos) == 0x000008, "Wrong alignment on WB_MagatsuhiGauge_C_InitializePos");
static_assert(sizeof(WB_MagatsuhiGauge_C_InitializePos) == 0x000038, "Wrong size on WB_MagatsuhiGauge_C_InitializePos");
static_assert(offsetof(WB_MagatsuhiGauge_C_InitializePos, Temp_bool_Variable) == 0x000000, "Member 'WB_MagatsuhiGauge_C_InitializePos::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_InitializePos, Temp_name_Variable) == 0x000004, "Member 'WB_MagatsuhiGauge_C_InitializePos::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_InitializePos, Temp_name_Variable_1) == 0x00000C, "Member 'WB_MagatsuhiGauge_C_InitializePos::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_InitializePos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WB_MagatsuhiGauge_C_InitializePos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_InitializePos, K2Node_Select_Default) == 0x000020, "Member 'WB_MagatsuhiGauge_C_InitializePos::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_InitializePos, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000028, "Member 'WB_MagatsuhiGauge_C_InitializePos::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_InitializePos, CallFunc_PlayByIndex_ReturnValue) == 0x000030, "Member 'WB_MagatsuhiGauge_C_InitializePos::CallFunc_PlayByIndex_ReturnValue' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.Set Gauge Tip Reduce Loop
// 0x0038 (0x0038 - 0x0000)
struct WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B54[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Lo_AnimNames;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B55[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop) == 0x000008, "Wrong alignment on WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop");
static_assert(sizeof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop) == 0x000038, "Wrong size on WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop");
static_assert(offsetof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop, Show) == 0x000000, "Member 'WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop::Show' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop, Lo_AnimNames) == 0x000008, "Member 'WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop::Lo_AnimNames' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop, Temp_bool_Variable) == 0x000018, "Member 'WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop, Temp_byte_Variable) == 0x000019, "Member 'WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop, Temp_byte_Variable_1) == 0x00001A, "Member 'WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop, K2Node_MakeArray_Array) == 0x000020, "Member 'WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop, K2Node_Select_Default) == 0x000030, "Member 'WB_MagatsuhiGauge_C_Set_Gauge_Tip_Reduce_Loop::K2Node_Select_Default' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.IsDisappeared
// 0x0001 (0x0001 - 0x0000)
struct WB_MagatsuhiGauge_C_IsDisappeared final
{
public:
	bool                                          Param_IsDisappeared;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_IsDisappeared) == 0x000001, "Wrong alignment on WB_MagatsuhiGauge_C_IsDisappeared");
static_assert(sizeof(WB_MagatsuhiGauge_C_IsDisappeared) == 0x000001, "Wrong size on WB_MagatsuhiGauge_C_IsDisappeared");
static_assert(offsetof(WB_MagatsuhiGauge_C_IsDisappeared, Param_IsDisappeared) == 0x000000, "Member 'WB_MagatsuhiGauge_C_IsDisappeared::Param_IsDisappeared' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.UpdateGauge
// 0x0010 (0x0010 - 0x0000)
struct WB_MagatsuhiGauge_C_UpdateGauge final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_UpdateGauge) == 0x000004, "Wrong alignment on WB_MagatsuhiGauge_C_UpdateGauge");
static_assert(sizeof(WB_MagatsuhiGauge_C_UpdateGauge) == 0x000010, "Wrong size on WB_MagatsuhiGauge_C_UpdateGauge");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateGauge, Temp_int_Variable) == 0x000000, "Member 'WB_MagatsuhiGauge_C_UpdateGauge::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateGauge, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_MagatsuhiGauge_C_UpdateGauge::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateGauge, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WB_MagatsuhiGauge_C_UpdateGauge::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateGauge, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000009, "Member 'WB_MagatsuhiGauge_C_UpdateGauge::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateGauge, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000A, "Member 'WB_MagatsuhiGauge_C_UpdateGauge::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateGauge, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000B, "Member 'WB_MagatsuhiGauge_C_UpdateGauge::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateGauge, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WB_MagatsuhiGauge_C_UpdateGauge::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateGauge, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'WB_MagatsuhiGauge_C_UpdateGauge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.SetGaugeTip
// 0x0038 (0x0038 - 0x0000)
struct WB_MagatsuhiGauge_C_SetGaugeTip final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B56[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Lo_AnimNames;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B57[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MagatsuhiGauge_C_SetGaugeTip) == 0x000008, "Wrong alignment on WB_MagatsuhiGauge_C_SetGaugeTip");
static_assert(sizeof(WB_MagatsuhiGauge_C_SetGaugeTip) == 0x000038, "Wrong size on WB_MagatsuhiGauge_C_SetGaugeTip");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTip, Show) == 0x000000, "Member 'WB_MagatsuhiGauge_C_SetGaugeTip::Show' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTip, Lo_AnimNames) == 0x000008, "Member 'WB_MagatsuhiGauge_C_SetGaugeTip::Lo_AnimNames' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTip, Temp_bool_Variable) == 0x000018, "Member 'WB_MagatsuhiGauge_C_SetGaugeTip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTip, Temp_byte_Variable) == 0x000019, "Member 'WB_MagatsuhiGauge_C_SetGaugeTip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTip, Temp_byte_Variable_1) == 0x00001A, "Member 'WB_MagatsuhiGauge_C_SetGaugeTip::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTip, K2Node_MakeArray_Array) == 0x000020, "Member 'WB_MagatsuhiGauge_C_SetGaugeTip::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTip, K2Node_Select_Default) == 0x000030, "Member 'WB_MagatsuhiGauge_C_SetGaugeTip::K2Node_Select_Default' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.PlaySetGaugeTipFlash
// 0x0050 (0x0050 - 0x0000)
struct WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash final
{
public:
	bool                                          IsIncrease;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B58[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Lo_AnimNames;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B59[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5A[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	class FName                                   K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash) == 0x000008, "Wrong alignment on WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash");
static_assert(sizeof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash) == 0x000050, "Wrong size on WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash, IsIncrease) == 0x000000, "Member 'WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash::IsIncrease' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash, Lo_AnimNames) == 0x000008, "Member 'WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash::Lo_AnimNames' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash, Temp_bool_Variable) == 0x000018, "Member 'WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash, Temp_name_Variable) == 0x00001C, "Member 'WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash, Temp_name_Variable_1) == 0x000024, "Member 'WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash, K2Node_MakeArray_Array) == 0x000030, "Member 'WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash, K2Node_Select_Default) == 0x000040, "Member 'WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash, CallFunc_Play_ReturnValue) == 0x000048, "Member 'WB_MagatsuhiGauge_C_PlaySetGaugeTipFlash::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.SetGaugeTipFlash
// 0x0038 (0x0038 - 0x0000)
struct WB_MagatsuhiGauge_C_SetGaugeTipFlash final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B5B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Lo_AnimNames;                                      // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5C[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MagatsuhiGauge_C_SetGaugeTipFlash) == 0x000008, "Wrong alignment on WB_MagatsuhiGauge_C_SetGaugeTipFlash");
static_assert(sizeof(WB_MagatsuhiGauge_C_SetGaugeTipFlash) == 0x000038, "Wrong size on WB_MagatsuhiGauge_C_SetGaugeTipFlash");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTipFlash, Show) == 0x000000, "Member 'WB_MagatsuhiGauge_C_SetGaugeTipFlash::Show' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTipFlash, Lo_AnimNames) == 0x000008, "Member 'WB_MagatsuhiGauge_C_SetGaugeTipFlash::Lo_AnimNames' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTipFlash, Temp_bool_Variable) == 0x000018, "Member 'WB_MagatsuhiGauge_C_SetGaugeTipFlash::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTipFlash, Temp_byte_Variable) == 0x000019, "Member 'WB_MagatsuhiGauge_C_SetGaugeTipFlash::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTipFlash, Temp_byte_Variable_1) == 0x00001A, "Member 'WB_MagatsuhiGauge_C_SetGaugeTipFlash::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTipFlash, K2Node_MakeArray_Array) == 0x000020, "Member 'WB_MagatsuhiGauge_C_SetGaugeTipFlash::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetGaugeTipFlash, K2Node_Select_Default) == 0x000030, "Member 'WB_MagatsuhiGauge_C_SetGaugeTipFlash::K2Node_Select_Default' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.SetSlideInPos
// 0x0001 (0x0001 - 0x0000)
struct WB_MagatsuhiGauge_C_SetSlideInPos final
{
public:
	bool                                          UpperPos;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_SetSlideInPos) == 0x000001, "Wrong alignment on WB_MagatsuhiGauge_C_SetSlideInPos");
static_assert(sizeof(WB_MagatsuhiGauge_C_SetSlideInPos) == 0x000001, "Wrong size on WB_MagatsuhiGauge_C_SetSlideInPos");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetSlideInPos, UpperPos) == 0x000000, "Member 'WB_MagatsuhiGauge_C_SetSlideInPos::UpperPos' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.SetSlideInImmediately
// 0x0001 (0x0001 - 0x0000)
struct WB_MagatsuhiGauge_C_SetSlideInImmediately final
{
public:
	bool                                          Immediately;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_SetSlideInImmediately) == 0x000001, "Wrong alignment on WB_MagatsuhiGauge_C_SetSlideInImmediately");
static_assert(sizeof(WB_MagatsuhiGauge_C_SetSlideInImmediately) == 0x000001, "Wrong size on WB_MagatsuhiGauge_C_SetSlideInImmediately");
static_assert(offsetof(WB_MagatsuhiGauge_C_SetSlideInImmediately, Immediately) == 0x000000, "Member 'WB_MagatsuhiGauge_C_SetSlideInImmediately::Immediately' has a wrong offset!");

// Function WB_MagatsuhiGauge.WB_MagatsuhiGauge_C.UpdateReduceGaugeFlash
// 0x0006 (0x0006 - 0x0000)
struct WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash) == 0x000001, "Wrong alignment on WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash");
static_assert(sizeof(WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash) == 0x000006, "Wrong size on WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000001, "Member 'WB_MagatsuhiGauge_C_UpdateReduceGaugeFlash::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
