#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Message_Select

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Message_Select.WB_Message_Select_C
// 0x0050 (0x02B0 - 0x0260)
class UWB_Message_Select_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_Bg;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_SelectMess;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Vertical_SelBox;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_Message_SelectItem_C*>       MessWB;                                            // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUIListCursor*                          ListCursor;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMessageSelData>                PageData;                                          // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PageId;                                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Message_Select(int32 EntryPoint);
	void Construct();
	void StartMessage(class UScriptMessageAsset* InScriptMessage, TArray<int32>& InMessageIdArray);
	void AddMessagePage(class UScriptMessageAsset* ScriptMessAsset, TArray<int32>& MassageIdArray, int32* Param_PageId);
	void AddMessagePage_Label(class UScriptMessageAsset* ScriptMessageAsset, TArray<class FName>& MessageLabelArray, int32* Param_PageId);
	void ChangePage(int32 Param_PageId);
	void ClearAllData();
	void EndMessage();
	void ClearNowWidget();
	void AddWidget(class UScriptMessageAsset* InScriptMessage, const struct FMessageData& MessData);
	void SetView(bool IsView);
	void SetBgSize();
	void MoveCursor(int32 Add, bool IsLimitStop, bool* IsMove);
	void ChangeCursor(int32 BackCursor, int32 NewCursor);
	void GetSelData(int32* CursorIndex, int32* MessageID, class FName* MessageLabel);
	void StartMessage_Label(class UScriptMessageAsset* ScriptMessageAsset, TArray<class FName>& MessageLabelArray);
	void ToNextPage(bool IsBack);
	void SettingCursor(int32 Param_Index, bool* IsMove);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Message_Select_C">();
	}
	static class UWB_Message_Select_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Message_Select_C>();
	}
};
static_assert(alignof(UWB_Message_Select_C) == 0x000008, "Wrong alignment on UWB_Message_Select_C");
static_assert(sizeof(UWB_Message_Select_C) == 0x0002B0, "Wrong size on UWB_Message_Select_C");
static_assert(offsetof(UWB_Message_Select_C, UberGraphFrame) == 0x000260, "Member 'UWB_Message_Select_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Message_Select_C, Canvas_Bg) == 0x000268, "Member 'UWB_Message_Select_C::Canvas_Bg' has a wrong offset!");
static_assert(offsetof(UWB_Message_Select_C, Canvas_SelectMess) == 0x000270, "Member 'UWB_Message_Select_C::Canvas_SelectMess' has a wrong offset!");
static_assert(offsetof(UWB_Message_Select_C, Vertical_SelBox) == 0x000278, "Member 'UWB_Message_Select_C::Vertical_SelBox' has a wrong offset!");
static_assert(offsetof(UWB_Message_Select_C, MessWB) == 0x000280, "Member 'UWB_Message_Select_C::MessWB' has a wrong offset!");
static_assert(offsetof(UWB_Message_Select_C, ListCursor) == 0x000290, "Member 'UWB_Message_Select_C::ListCursor' has a wrong offset!");
static_assert(offsetof(UWB_Message_Select_C, PageData) == 0x000298, "Member 'UWB_Message_Select_C::PageData' has a wrong offset!");
static_assert(offsetof(UWB_Message_Select_C, PageId) == 0x0002A8, "Member 'UWB_Message_Select_C::PageId' has a wrong offset!");

}

