#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MsgWindow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Project_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_MsgWindow.WB_MsgWindow_C.ExecuteUbergraph_WB_MsgWindow
// 0x0170 (0x0170 - 0x0000)
struct WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActionPadCheck_Success;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_1;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_2;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_2;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_2;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_2;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CBE[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CBF[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x00A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x00A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC0[0x1];                                     // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC1[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundAtomCue>           CallFunc_Array_Get_Item;                           // 0x00D0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_GetDrawStrLen_ReturnValue;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDrawStrLen_ReturnValue_1;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPageCompleted_ReturnValue;              // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMessageCompleted_ReturnValue;           // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_VoiceLoadProc_IsLoaded;                   // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionPadCheck_Success_2;               // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetRevealPerSecond_ReturnValue;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_OPTION_MESSAGE_SPEED_TYPE                   CallFunc_GetMessageSpeedType_ReturnValue;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC2[0x1];                                     // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetRevealPerSecond_ReturnValue_1;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC3[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC4[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC5[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetVoiceName_OutVoiceName;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USoundAtomCue*                          CallFunc_GetVoiceAsset_OutSoundAtomCue;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC6[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_6;                       // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_7;                       // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_8;                       // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC7[0x2];                                     // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow) == 0x000008, "Wrong alignment on WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow");
static_assert(sizeof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow) == 0x000170, "Wrong size on WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, EntryPoint) == 0x000000, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsActionPadCheck_Success) == 0x000008, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsActionPadCheck_Success' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsActionPadCheck_Success_1) == 0x000009, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsActionPadCheck_Success_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_Event_IsDesignTime) == 0x00000A, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_Event_MyGeometry) == 0x00000C, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_Event_InDeltaTime) == 0x000044, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimPackName_2) == 0x000048, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimationName_2) == 0x000050, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimPackIndex_2) == 0x000058, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimPackIndex_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimationIndex_2) == 0x00005C, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimationIndex_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_SwitchName_CmpSuccess) == 0x000060, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue) == 0x000061, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000064, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimationName_1) == 0x00006C, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x000074, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x000078, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_SwitchName_CmpSuccess_1) == 0x00007C, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_CustomEvent_Loaded) == 0x000080, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimPackName) == 0x000088, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimationName) == 0x000090, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000098, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_AnimationIndex) == 0x00009C, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_Pos) == 0x0000A0, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_ComponentBoundEvent_UV) == 0x0000A8, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_ComponentBoundEvent_UV' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_SwitchName_CmpSuccess_2) == 0x0000B0, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue_1) == 0x0000B1, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue_2) == 0x0000B2, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue_3) == 0x0000B3, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsVisible_ReturnValue) == 0x0000C4, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsVisible_ReturnValue_1) == 0x0000C5, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsVisible_ReturnValue_2) == 0x0000C6, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_GetDrawStrLen_ReturnValue) == 0x0000F8, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_GetDrawStrLen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_GetDrawStrLen_ReturnValue_1) == 0x0000FC, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_GetDrawStrLen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_SwitchInteger_CmpSuccess) == 0x000100, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_SwitchInteger_CmpSuccess_1) == 0x000101, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsPageCompleted_ReturnValue) == 0x000102, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsPageCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsMessageCompleted_ReturnValue) == 0x000103, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsMessageCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsValid_ReturnValue) == 0x000104, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsValid_ReturnValue_1) == 0x000105, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_VoiceLoadProc_IsLoaded) == 0x000106, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_VoiceLoadProc_IsLoaded' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsActionPadCheck_Success_2) == 0x000107, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsActionPadCheck_Success_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_SetRevealPerSecond_ReturnValue) == 0x000108, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_SetRevealPerSecond_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_GetMessageSpeedType_ReturnValue) == 0x000109, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_GetMessageSpeedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_SwitchEnum_CmpSuccess) == 0x00010A, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, Temp_int_Loop_Counter_Variable) == 0x00010C, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_SetRevealPerSecond_ReturnValue_1) == 0x000110, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_SetRevealPerSecond_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Less_IntInt_ReturnValue) == 0x000111, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Add_IntInt_ReturnValue) == 0x000114, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsValid_ReturnValue_2) == 0x000118, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, Temp_object_Variable) == 0x000120, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_DynamicCast_AsSound_Atom_Cue) == 0x000128, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_DynamicCast_AsSound_Atom_Cue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Array_Add_ReturnValue) == 0x000134, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_GetVoiceName_OutVoiceName) == 0x000138, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_GetVoiceName_OutVoiceName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_GetVoiceAsset_OutSoundAtomCue) == 0x000148, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_GetVoiceAsset_OutSoundAtomCue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsValid_ReturnValue_3) == 0x000150, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_SpawnSound2D_ReturnValue) == 0x000158, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue_4) == 0x000160, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue_5) == 0x000161, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue_6) == 0x000162, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue_7) == 0x000163, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Play_ReturnValue_8) == 0x000164, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Play_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000165, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow, CallFunc_Array_Add_ReturnValue_1) == 0x000168, "Member 'WB_MsgWindow_C_ExecuteUbergraph_WB_MsgWindow::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_MsgWindow_C_BndEvt__WB_MsgWindow_ButtonS5PageIcon_K2Node_ComponentBoundEvent_0_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MsgWindow_C_BndEvt__MessagePageIcon_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MsgWindow_C_BndEvt__NameWindow_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MsgWindow_C_BndEvt__MessageWindow_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_MsgWindow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_Tick) == 0x000004, "Wrong alignment on WB_MsgWindow_C_Tick");
static_assert(sizeof(WB_MsgWindow_C_Tick) == 0x00003C, "Wrong size on WB_MsgWindow_C_Tick");
static_assert(offsetof(WB_MsgWindow_C_Tick, MyGeometry) == 0x000000, "Member 'WB_MsgWindow_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_MsgWindow_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_MsgWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgWindow_C_PreConstruct) == 0x000001, "Wrong alignment on WB_MsgWindow_C_PreConstruct");
static_assert(sizeof(WB_MsgWindow_C_PreConstruct) == 0x000001, "Wrong size on WB_MsgWindow_C_PreConstruct");
static_assert(offsetof(WB_MsgWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_MsgWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.OnLoaded_522740664FF1A06057B4DD8760092DA1
// 0x0008 (0x0008 - 0x0000)
struct WB_MsgWindow_C_OnLoaded_522740664FF1A06057B4DD8760092DA1 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_OnLoaded_522740664FF1A06057B4DD8760092DA1) == 0x000008, "Wrong alignment on WB_MsgWindow_C_OnLoaded_522740664FF1A06057B4DD8760092DA1");
static_assert(sizeof(WB_MsgWindow_C_OnLoaded_522740664FF1A06057B4DD8760092DA1) == 0x000008, "Wrong size on WB_MsgWindow_C_OnLoaded_522740664FF1A06057B4DD8760092DA1");
static_assert(offsetof(WB_MsgWindow_C_OnLoaded_522740664FF1A06057B4DD8760092DA1, Loaded) == 0x000000, "Member 'WB_MsgWindow_C_OnLoaded_522740664FF1A06057B4DD8760092DA1::Loaded' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.GetText_0
// 0x00B0 (0x00B0 - 0x0000)
struct WB_MsgWindow_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsNameText_namewindow;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScriptMessagePageData                 CallFunc_GetCurrentPageData_ReturnValue;           // 0x0020(0x0070)(ConstParm)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC9[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharaName_ReturnValue;                 // 0x0098(0x0018)(ConstParm)
};
static_assert(alignof(WB_MsgWindow_C_GetText_0) == 0x000008, "Wrong alignment on WB_MsgWindow_C_GetText_0");
static_assert(sizeof(WB_MsgWindow_C_GetText_0) == 0x0000B0, "Wrong size on WB_MsgWindow_C_GetText_0");
static_assert(offsetof(WB_MsgWindow_C_GetText_0, ReturnValue) == 0x000000, "Member 'WB_MsgWindow_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_GetText_0, CallFunc_IsNameText_namewindow) == 0x000018, "Member 'WB_MsgWindow_C_GetText_0::CallFunc_IsNameText_namewindow' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_GetText_0, CallFunc_GetCurrentPageData_ReturnValue) == 0x000020, "Member 'WB_MsgWindow_C_GetText_0::CallFunc_GetCurrentPageData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_GetText_0, CallFunc_Conv_StringToInt_ReturnValue) == 0x000090, "Member 'WB_MsgWindow_C_GetText_0::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_GetText_0, CallFunc_GetCharaName_ReturnValue) == 0x000098, "Member 'WB_MsgWindow_C_GetText_0::CallFunc_GetCharaName_ReturnValue' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.messagetextstop
// 0x0018 (0x0018 - 0x0000)
struct WB_MsgWindow_C_Messagetextstop final
{
public:
	bool                                          InNonClearText;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CCA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgWindow_C_Messagetextstop) == 0x000008, "Wrong alignment on WB_MsgWindow_C_Messagetextstop");
static_assert(sizeof(WB_MsgWindow_C_Messagetextstop) == 0x000018, "Wrong size on WB_MsgWindow_C_Messagetextstop");
static_assert(offsetof(WB_MsgWindow_C_Messagetextstop, InNonClearText) == 0x000000, "Member 'WB_MsgWindow_C_Messagetextstop::InNonClearText' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_Messagetextstop, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000008, "Member 'WB_MsgWindow_C_Messagetextstop::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.messagetextplay
// 0x0005 (0x0005 - 0x0000)
struct WB_MsgWindow_C_Messagetextplay final
{
public:
	bool                                          OutCompleted;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Messagecompleted;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMessageCompleted_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPageCompleted_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMessageCompleted_ReturnValue_1;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgWindow_C_Messagetextplay) == 0x000001, "Wrong alignment on WB_MsgWindow_C_Messagetextplay");
static_assert(sizeof(WB_MsgWindow_C_Messagetextplay) == 0x000005, "Wrong size on WB_MsgWindow_C_Messagetextplay");
static_assert(offsetof(WB_MsgWindow_C_Messagetextplay, OutCompleted) == 0x000000, "Member 'WB_MsgWindow_C_Messagetextplay::OutCompleted' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_Messagetextplay, Messagecompleted) == 0x000001, "Member 'WB_MsgWindow_C_Messagetextplay::Messagecompleted' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_Messagetextplay, CallFunc_IsMessageCompleted_ReturnValue) == 0x000002, "Member 'WB_MsgWindow_C_Messagetextplay::CallFunc_IsMessageCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_Messagetextplay, CallFunc_IsPageCompleted_ReturnValue) == 0x000003, "Member 'WB_MsgWindow_C_Messagetextplay::CallFunc_IsPageCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_Messagetextplay, CallFunc_IsMessageCompleted_ReturnValue_1) == 0x000004, "Member 'WB_MsgWindow_C_Messagetextplay::CallFunc_IsMessageCompleted_ReturnValue_1' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.IsNameText
// 0x0080 (0x0080 - 0x0000)
struct WB_MsgWindow_C_IsNameText final
{
public:
	bool                                          Param_NameWindow;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Nameon;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CCB[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScriptMessagePageData                 CallFunc_GetCurrentPageData_ReturnValue;           // 0x0008(0x0070)(ConstParm)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MsgWindow_C_IsNameText) == 0x000008, "Wrong alignment on WB_MsgWindow_C_IsNameText");
static_assert(sizeof(WB_MsgWindow_C_IsNameText) == 0x000080, "Wrong size on WB_MsgWindow_C_IsNameText");
static_assert(offsetof(WB_MsgWindow_C_IsNameText, Param_NameWindow) == 0x000000, "Member 'WB_MsgWindow_C_IsNameText::Param_NameWindow' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_IsNameText, Nameon) == 0x000001, "Member 'WB_MsgWindow_C_IsNameText::Nameon' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_IsNameText, CallFunc_GetCurrentPageData_ReturnValue) == 0x000008, "Member 'WB_MsgWindow_C_IsNameText::CallFunc_GetCurrentPageData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_IsNameText, CallFunc_Conv_StringToInt_ReturnValue) == 0x000078, "Member 'WB_MsgWindow_C_IsNameText::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_IsNameText, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007C, "Member 'WB_MsgWindow_C_IsNameText::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.SetSelectCursorOffsest
// 0x0004 (0x0004 - 0x0000)
struct WB_MsgWindow_C_SetSelectCursorOffsest final
{
public:
	int32                                         Defaultcursorpos;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_SetSelectCursorOffsest) == 0x000004, "Wrong alignment on WB_MsgWindow_C_SetSelectCursorOffsest");
static_assert(sizeof(WB_MsgWindow_C_SetSelectCursorOffsest) == 0x000004, "Wrong size on WB_MsgWindow_C_SetSelectCursorOffsest");
static_assert(offsetof(WB_MsgWindow_C_SetSelectCursorOffsest, Defaultcursorpos) == 0x000000, "Member 'WB_MsgWindow_C_SetSelectCursorOffsest::Defaultcursorpos' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.SetNameWindow
// 0x00B0 (0x00B0 - 0x0000)
struct WB_MsgWindow_C_SetNameWindow final
{
public:
	bool                                          InExecution;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Executionflag;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CCC[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              baseposition;                                      // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDecorator_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CCD[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0060(0x0028)()
	bool                                          CallFunc_IsNameText_namewindow;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CCE[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPositionDataByPartsName_OutVec;        // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameText_namewindow_1;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CCF[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPositionDataByPartsName_OutVec_1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CD0[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_SetNameWindow) == 0x000008, "Wrong alignment on WB_MsgWindow_C_SetNameWindow");
static_assert(sizeof(WB_MsgWindow_C_SetNameWindow) == 0x0000B0, "Wrong size on WB_MsgWindow_C_SetNameWindow");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, InExecution) == 0x000000, "Member 'WB_MsgWindow_C_SetNameWindow::InExecution' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, Executionflag) == 0x000001, "Member 'WB_MsgWindow_C_SetNameWindow::Executionflag' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, baseposition) == 0x000004, "Member 'WB_MsgWindow_C_SetNameWindow::baseposition' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, CallFunc_SetDecorator_ReturnValue) == 0x00000C, "Member 'WB_MsgWindow_C_SetNameWindow::CallFunc_SetDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'WB_MsgWindow_C_SetNameWindow::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'WB_MsgWindow_C_SetNameWindow::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, K2Node_MakeStruct_SlateColor_2) == 0x000060, "Member 'WB_MsgWindow_C_SetNameWindow::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, CallFunc_IsNameText_namewindow) == 0x000088, "Member 'WB_MsgWindow_C_SetNameWindow::CallFunc_IsNameText_namewindow' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, CallFunc_GetPositionDataByPartsName_OutVec) == 0x00008C, "Member 'WB_MsgWindow_C_SetNameWindow::CallFunc_GetPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, CallFunc_IsNameText_namewindow_1) == 0x000094, "Member 'WB_MsgWindow_C_SetNameWindow::CallFunc_IsNameText_namewindow_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, CallFunc_GetPositionDataByPartsName_OutVec_1) == 0x000098, "Member 'WB_MsgWindow_C_SetNameWindow::CallFunc_GetPositionDataByPartsName_OutVec_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, CallFunc_Play_ReturnValue) == 0x0000A0, "Member 'WB_MsgWindow_C_SetNameWindow::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, CallFunc_Play_ReturnValue_1) == 0x0000A1, "Member 'WB_MsgWindow_C_SetNameWindow::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MsgWindow_C_SetNameWindow, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000A8, "Member 'WB_MsgWindow_C_SetNameWindow::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_MsgWindow.WB_MsgWindow_C.DecidesSelectCursor
// 0x000C (0x000C - 0x0000)
struct WB_MsgWindow_C_DecidesSelectCursor final
{
public:
	int32                                         OutParam;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Retparam;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectCursorIndex_outcursorindex;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MsgWindow_C_DecidesSelectCursor) == 0x000004, "Wrong alignment on WB_MsgWindow_C_DecidesSelectCursor");
