#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapCharaPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_MapCharaPanel.WB_MapCharaPanel_C.ExecuteUbergraph_WB_MapCharaPanel
// 0x0004 (0x0004 - 0x0000)
struct WB_MapCharaPanel_C_ExecuteUbergraph_WB_MapCharaPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapCharaPanel_C_ExecuteUbergraph_WB_MapCharaPanel) == 0x000004, "Wrong alignment on WB_MapCharaPanel_C_ExecuteUbergraph_WB_MapCharaPanel");
static_assert(sizeof(WB_MapCharaPanel_C_ExecuteUbergraph_WB_MapCharaPanel) == 0x000004, "Wrong size on WB_MapCharaPanel_C_ExecuteUbergraph_WB_MapCharaPanel");
static_assert(offsetof(WB_MapCharaPanel_C_ExecuteUbergraph_WB_MapCharaPanel, EntryPoint) == 0x000000, "Member 'WB_MapCharaPanel_C_ExecuteUbergraph_WB_MapCharaPanel::EntryPoint' has a wrong offset!");

// Function WB_MapCharaPanel.WB_MapCharaPanel_C.GetWBCharaPanel
// 0x0020 (0x0020 - 0x0000)
struct WB_MapCharaPanel_C_GetWBCharaPanel final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CharaPanel_C*                       OutWidget;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CharaPanel_C*                       Retwidget;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapCharaPanel_C_GetWBCharaPanel) == 0x000008, "Wrong alignment on WB_MapCharaPanel_C_GetWBCharaPanel");
static_assert(sizeof(WB_MapCharaPanel_C_GetWBCharaPanel) == 0x000020, "Wrong size on WB_MapCharaPanel_C_GetWBCharaPanel");
static_assert(offsetof(WB_MapCharaPanel_C_GetWBCharaPanel, InIndex) == 0x000000, "Member 'WB_MapCharaPanel_C_GetWBCharaPanel::InIndex' has a wrong offset!");
static_assert(offsetof(WB_MapCharaPanel_C_GetWBCharaPanel, OutWidget) == 0x000008, "Member 'WB_MapCharaPanel_C_GetWBCharaPanel::OutWidget' has a wrong offset!");
static_assert(offsetof(WB_MapCharaPanel_C_GetWBCharaPanel, Retwidget) == 0x000010, "Member 'WB_MapCharaPanel_C_GetWBCharaPanel::Retwidget' has a wrong offset!");
static_assert(offsetof(WB_MapCharaPanel_C_GetWBCharaPanel, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_MapCharaPanel_C_GetWBCharaPanel::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

