#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Message_Base

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_Message_Base.WB_Message_Base_C.ExecuteUbergraph_WB_Message_Base
// 0x01D0 (0x01D0 - 0x0000)
struct WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE7[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE8[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCue*                          K2Node_DynamicCast_AsSound_Atom_Cue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BE9[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BEA[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BEB[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BEC[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundAtomCue>           CallFunc_Array_Get_Item;                           // 0x00A0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BED[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEE[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCharaLipSync>           CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BEF[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF0[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharaLipSync*                          K2Node_DynamicCast_AsChara_Lip_Sync;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BF1[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF2[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0178(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF3[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base) == 0x000008, "Wrong alignment on WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base");
static_assert(sizeof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base) == 0x0001D0, "Wrong size on WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, EntryPoint) == 0x000000, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_object_Variable) == 0x000020, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_DynamicCast_AsSound_Atom_Cue) == 0x000030, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_DynamicCast_AsSound_Atom_Cue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_int_Variable) == 0x000074, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_CustomEvent_Loaded_1) == 0x000078, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008C, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_BooleanOR_ReturnValue) == 0x00008D, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_int_Variable_1) == 0x000090, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Add_IntInt_ReturnValue_2) == 0x000094, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000098, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Array_Length_ReturnValue_2) == 0x0000C8, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000CC, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Array_Add_ReturnValue) == 0x0000E0, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000E4, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_int_Variable_2) == 0x0000E8, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Array_Length_ReturnValue_3) == 0x000118, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Less_IntInt_ReturnValue_3) == 0x00011C, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Add_IntInt_ReturnValue_4) == 0x000130, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, Temp_object_Variable_1) == 0x000138, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_DynamicCast_AsChara_Lip_Sync) == 0x000140, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_DynamicCast_AsChara_Lip_Sync' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_GetDisplayName_ReturnValue_1) == 0x000150, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Array_Add_ReturnValue_1) == 0x000160, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000168, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_Event_MyGeometry) == 0x000178, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, K2Node_Event_InDeltaTime) == 0x0001B0, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001B8, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001C8, "Member 'WB_Message_Base_C_ExecuteUbergraph_WB_Message_Base::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Message_Base_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_Tick) == 0x000004, "Wrong alignment on WB_Message_Base_C_Tick");
static_assert(sizeof(WB_Message_Base_C_Tick) == 0x00003C, "Wrong size on WB_Message_Base_C_Tick");
static_assert(offsetof(WB_Message_Base_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Message_Base_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Message_Base_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.OnLoaded_89E1F62C404C8EB45F348296954C33C2
// 0x0008 (0x0008 - 0x0000)
struct WB_Message_Base_C_OnLoaded_89E1F62C404C8EB45F348296954C33C2 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_OnLoaded_89E1F62C404C8EB45F348296954C33C2) == 0x000008, "Wrong alignment on WB_Message_Base_C_OnLoaded_89E1F62C404C8EB45F348296954C33C2");
static_assert(sizeof(WB_Message_Base_C_OnLoaded_89E1F62C404C8EB45F348296954C33C2) == 0x000008, "Wrong size on WB_Message_Base_C_OnLoaded_89E1F62C404C8EB45F348296954C33C2");
static_assert(offsetof(WB_Message_Base_C_OnLoaded_89E1F62C404C8EB45F348296954C33C2, Loaded) == 0x000000, "Member 'WB_Message_Base_C_OnLoaded_89E1F62C404C8EB45F348296954C33C2::Loaded' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.OnLoaded_7CB15FEB41AFDD98894A479C0666E2A3
// 0x0008 (0x0008 - 0x0000)
struct WB_Message_Base_C_OnLoaded_7CB15FEB41AFDD98894A479C0666E2A3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_OnLoaded_7CB15FEB41AFDD98894A479C0666E2A3) == 0x000008, "Wrong alignment on WB_Message_Base_C_OnLoaded_7CB15FEB41AFDD98894A479C0666E2A3");
static_assert(sizeof(WB_Message_Base_C_OnLoaded_7CB15FEB41AFDD98894A479C0666E2A3) == 0x000008, "Wrong size on WB_Message_Base_C_OnLoaded_7CB15FEB41AFDD98894A479C0666E2A3");
static_assert(offsetof(WB_Message_Base_C_OnLoaded_7CB15FEB41AFDD98894A479C0666E2A3, Loaded) == 0x000000, "Member 'WB_Message_Base_C_OnLoaded_7CB15FEB41AFDD98894A479C0666E2A3::Loaded' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.StartMessage
// 0x00B0 (0x00B0 - 0x0000)
struct WB_Message_Base_C_StartMessage final
{
public:
	class UScriptMessageAsset*                    InScriptMessage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMessageId;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsReval;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BF4[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            FontColor;                                         // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Param_NoVoice;                                     // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewLocalVar_1;                                     // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetDecorator_ReturnValue;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BF5[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMessageData                           CallFunc_GetMessageDataFromId_ReturnValue;         // 0x0040(0x0070)()
};
static_assert(alignof(WB_Message_Base_C_StartMessage) == 0x000008, "Wrong alignment on WB_Message_Base_C_StartMessage");
static_assert(sizeof(WB_Message_Base_C_StartMessage) == 0x0000B0, "Wrong size on WB_Message_Base_C_StartMessage");
static_assert(offsetof(WB_Message_Base_C_StartMessage, InScriptMessage) == 0x000000, "Member 'WB_Message_Base_C_StartMessage::InScriptMessage' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage, InMessageId) == 0x000008, "Member 'WB_Message_Base_C_StartMessage::InMessageId' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage, Param_IsReval) == 0x00000C, "Member 'WB_Message_Base_C_StartMessage::Param_IsReval' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage, FontColor) == 0x000010, "Member 'WB_Message_Base_C_StartMessage::FontColor' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage, Param_NoVoice) == 0x000038, "Member 'WB_Message_Base_C_StartMessage::Param_NoVoice' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage, NewLocalVar_1) == 0x000039, "Member 'WB_Message_Base_C_StartMessage::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage, CallFunc_SetDecorator_ReturnValue) == 0x00003A, "Member 'WB_Message_Base_C_StartMessage::CallFunc_SetDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage, CallFunc_GetMessageDataFromId_ReturnValue) == 0x000040, "Member 'WB_Message_Base_C_StartMessage::CallFunc_GetMessageDataFromId_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.SetRevealPage
// 0x0001 (0x0001 - 0x0000)
struct WB_Message_Base_C_SetRevealPage final
{
public:
	bool                                          IsVoiceEnd;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_SetRevealPage) == 0x000001, "Wrong alignment on WB_Message_Base_C_SetRevealPage");
static_assert(sizeof(WB_Message_Base_C_SetRevealPage) == 0x000001, "Wrong size on WB_Message_Base_C_SetRevealPage");
static_assert(offsetof(WB_Message_Base_C_SetRevealPage, IsVoiceEnd) == 0x000000, "Member 'WB_Message_Base_C_SetRevealPage::IsVoiceEnd' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.IsPageComplet
// 0x0005 (0x0005 - 0x0000)
struct WB_Message_Base_C_IsPageComplet final
{
public:
	bool                                          IsCheckVoice;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsComplet;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPageCompleted_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVoicePlayEnd_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_IsPageComplet) == 0x000001, "Wrong alignment on WB_Message_Base_C_IsPageComplet");
static_assert(sizeof(WB_Message_Base_C_IsPageComplet) == 0x000005, "Wrong size on WB_Message_Base_C_IsPageComplet");
static_assert(offsetof(WB_Message_Base_C_IsPageComplet, IsCheckVoice) == 0x000000, "Member 'WB_Message_Base_C_IsPageComplet::IsCheckVoice' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_IsPageComplet, IsComplet) == 0x000001, "Member 'WB_Message_Base_C_IsPageComplet::IsComplet' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_IsPageComplet, CallFunc_IsPageCompleted_ReturnValue) == 0x000002, "Member 'WB_Message_Base_C_IsPageComplet::CallFunc_IsPageCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_IsPageComplet, CallFunc_IsVoicePlayEnd_ReturnValue) == 0x000003, "Member 'WB_Message_Base_C_IsPageComplet::CallFunc_IsVoicePlayEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_IsPageComplet, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'WB_Message_Base_C_IsPageComplet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.IsMessageCompleted
// 0x0002 (0x0002 - 0x0000)
struct WB_Message_Base_C_IsMessageCompleted final
{
public:
	bool                                          IsComplet;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMessageCompleted_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_IsMessageCompleted) == 0x000001, "Wrong alignment on WB_Message_Base_C_IsMessageCompleted");
static_assert(sizeof(WB_Message_Base_C_IsMessageCompleted) == 0x000002, "Wrong size on WB_Message_Base_C_IsMessageCompleted");
static_assert(offsetof(WB_Message_Base_C_IsMessageCompleted, IsComplet) == 0x000000, "Member 'WB_Message_Base_C_IsMessageCompleted::IsComplet' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_IsMessageCompleted, CallFunc_IsMessageCompleted_ReturnValue) == 0x000001, "Member 'WB_Message_Base_C_IsMessageCompleted::CallFunc_IsMessageCompleted_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.GetVoiceName
// 0x0028 (0x0028 - 0x0000)
struct WB_Message_Base_C_GetVoiceName final
{
public:
	class FString                                 VoiceName;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UScriptMessageAsset*                    NewLocalVar_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetVoiceName_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_GetVoiceName) == 0x000008, "Wrong alignment on WB_Message_Base_C_GetVoiceName");
static_assert(sizeof(WB_Message_Base_C_GetVoiceName) == 0x000028, "Wrong size on WB_Message_Base_C_GetVoiceName");
static_assert(offsetof(WB_Message_Base_C_GetVoiceName, VoiceName) == 0x000000, "Member 'WB_Message_Base_C_GetVoiceName::VoiceName' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceName, NewLocalVar_0) == 0x000010, "Member 'WB_Message_Base_C_GetVoiceName::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceName, CallFunc_GetVoiceName_ReturnValue) == 0x000018, "Member 'WB_Message_Base_C_GetVoiceName::CallFunc_GetVoiceName_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.GetSpeakerName
// 0x0080 (0x0080 - 0x0000)
struct WB_Message_Base_C_GetSpeakerName final
{
public:
	class FString                                 SpeakerName;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	struct FScriptMessagePageData                 CallFunc_GetCurrentPageData_ReturnValue;           // 0x0010(0x0070)(ConstParm)
};
static_assert(alignof(WB_Message_Base_C_GetSpeakerName) == 0x000008, "Wrong alignment on WB_Message_Base_C_GetSpeakerName");
static_assert(sizeof(WB_Message_Base_C_GetSpeakerName) == 0x000080, "Wrong size on WB_Message_Base_C_GetSpeakerName");
static_assert(offsetof(WB_Message_Base_C_GetSpeakerName, SpeakerName) == 0x000000, "Member 'WB_Message_Base_C_GetSpeakerName::SpeakerName' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetSpeakerName, CallFunc_GetCurrentPageData_ReturnValue) == 0x000010, "Member 'WB_Message_Base_C_GetSpeakerName::CallFunc_GetCurrentPageData_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.SetJustification
// 0x0001 (0x0001 - 0x0000)
struct WB_Message_Base_C_SetJustification final
{
public:
	ETextJustify                                  InJustification;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_SetJustification) == 0x000001, "Wrong alignment on WB_Message_Base_C_SetJustification");
static_assert(sizeof(WB_Message_Base_C_SetJustification) == 0x000001, "Wrong size on WB_Message_Base_C_SetJustification");
static_assert(offsetof(WB_Message_Base_C_SetJustification, InJustification) == 0x000000, "Member 'WB_Message_Base_C_SetJustification::InJustification' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.ToNextPage
// 0x0001 (0x0001 - 0x0000)
struct WB_Message_Base_C_ToNextPage final
{
public:
	bool                                          IsReveal;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_ToNextPage) == 0x000001, "Wrong alignment on WB_Message_Base_C_ToNextPage");
static_assert(sizeof(WB_Message_Base_C_ToNextPage) == 0x000001, "Wrong size on WB_Message_Base_C_ToNextPage");
static_assert(offsetof(WB_Message_Base_C_ToNextPage, IsReveal) == 0x000000, "Member 'WB_Message_Base_C_ToNextPage::IsReveal' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.SetPosition
// 0x0028 (0x0028 - 0x0000)
struct WB_Message_Base_C_SetPosition final
{
public:
	struct FAnchors                               InAnchors;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FVector2D                              InPosition;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InAlignment;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_SetPosition) == 0x000008, "Wrong alignment on WB_Message_Base_C_SetPosition");
static_assert(sizeof(WB_Message_Base_C_SetPosition) == 0x000028, "Wrong size on WB_Message_Base_C_SetPosition");
static_assert(offsetof(WB_Message_Base_C_SetPosition, InAnchors) == 0x000000, "Member 'WB_Message_Base_C_SetPosition::InAnchors' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetPosition, InPosition) == 0x000010, "Member 'WB_Message_Base_C_SetPosition::InPosition' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetPosition, InAlignment) == 0x000018, "Member 'WB_Message_Base_C_SetPosition::InAlignment' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WB_Message_Base_C_SetPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.ClearMessage
// 0x0003 (0x0003 - 0x0000)
struct WB_Message_Base_C_ClearMessage final
{
public:
	bool                                          CallFunc_IsMessageCompleted_IsComplet;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPageComplet_IsComplet;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_ClearMessage) == 0x000001, "Wrong alignment on WB_Message_Base_C_ClearMessage");
static_assert(sizeof(WB_Message_Base_C_ClearMessage) == 0x000003, "Wrong size on WB_Message_Base_C_ClearMessage");
static_assert(offsetof(WB_Message_Base_C_ClearMessage, CallFunc_IsMessageCompleted_IsComplet) == 0x000000, "Member 'WB_Message_Base_C_ClearMessage::CallFunc_IsMessageCompleted_IsComplet' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ClearMessage, CallFunc_IsPageComplet_IsComplet) == 0x000001, "Member 'WB_Message_Base_C_ClearMessage::CallFunc_IsPageComplet_IsComplet' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_ClearMessage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000002, "Member 'WB_Message_Base_C_ClearMessage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.StartMessage_Label
// 0x00B0 (0x00B0 - 0x0000)
struct WB_Message_Base_C_StartMessage_Label final
{
public:
	class UScriptMessageAsset*                    InScriptMessage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InMessageLabel;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsReval;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BF6[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            FontColor;                                         // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FMessageData                           CallFunc_GetMessageDataFromLabel_ReturnValue;      // 0x0040(0x0070)()
};
static_assert(alignof(WB_Message_Base_C_StartMessage_Label) == 0x000008, "Wrong alignment on WB_Message_Base_C_StartMessage_Label");
static_assert(sizeof(WB_Message_Base_C_StartMessage_Label) == 0x0000B0, "Wrong size on WB_Message_Base_C_StartMessage_Label");
static_assert(offsetof(WB_Message_Base_C_StartMessage_Label, InScriptMessage) == 0x000000, "Member 'WB_Message_Base_C_StartMessage_Label::InScriptMessage' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage_Label, InMessageLabel) == 0x000008, "Member 'WB_Message_Base_C_StartMessage_Label::InMessageLabel' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage_Label, Param_IsReval) == 0x000010, "Member 'WB_Message_Base_C_StartMessage_Label::Param_IsReval' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage_Label, FontColor) == 0x000018, "Member 'WB_Message_Base_C_StartMessage_Label::FontColor' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_StartMessage_Label, CallFunc_GetMessageDataFromLabel_ReturnValue) == 0x000040, "Member 'WB_Message_Base_C_StartMessage_Label::CallFunc_GetMessageDataFromLabel_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.IsNextPage
// 0x0002 (0x0002 - 0x0000)
struct WB_Message_Base_C_IsNextPage final
{
public:
	bool                                          Ret;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNextPage_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_IsNextPage) == 0x000001, "Wrong alignment on WB_Message_Base_C_IsNextPage");
static_assert(sizeof(WB_Message_Base_C_IsNextPage) == 0x000002, "Wrong size on WB_Message_Base_C_IsNextPage");
static_assert(offsetof(WB_Message_Base_C_IsNextPage, Ret) == 0x000000, "Member 'WB_Message_Base_C_IsNextPage::Ret' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_IsNextPage, CallFunc_IsNextPage_ReturnValue) == 0x000001, "Member 'WB_Message_Base_C_IsNextPage::CallFunc_IsNextPage_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.SetFontColor
// 0x0028 (0x0028 - 0x0000)
struct WB_Message_Base_C_SetFontColor final
{
public:
	struct FSlateColor                            InColorAndOpacity;                                 // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_Message_Base_C_SetFontColor) == 0x000008, "Wrong alignment on WB_Message_Base_C_SetFontColor");
static_assert(sizeof(WB_Message_Base_C_SetFontColor) == 0x000028, "Wrong size on WB_Message_Base_C_SetFontColor");
static_assert(offsetof(WB_Message_Base_C_SetFontColor, InColorAndOpacity) == 0x000000, "Member 'WB_Message_Base_C_SetFontColor::InColorAndOpacity' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.SetVoiceAsset
// 0x0060 (0x0060 - 0x0000)
struct WB_Message_Base_C_SetVoiceAsset final
{
public:
	TSoftObjectPtr<class UCharaLipSync>           Lo_LipAsset;                                       // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundAtomCue>           Lo_Asset;                                          // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BF7[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_SetVoiceAsset) == 0x000008, "Wrong alignment on WB_Message_Base_C_SetVoiceAsset");
static_assert(sizeof(WB_Message_Base_C_SetVoiceAsset) == 0x000060, "Wrong size on WB_Message_Base_C_SetVoiceAsset");
static_assert(offsetof(WB_Message_Base_C_SetVoiceAsset, Lo_LipAsset) == 0x000000, "Member 'WB_Message_Base_C_SetVoiceAsset::Lo_LipAsset' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetVoiceAsset, Lo_Asset) == 0x000028, "Member 'WB_Message_Base_C_SetVoiceAsset::Lo_Asset' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetVoiceAsset, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'WB_Message_Base_C_SetVoiceAsset::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetVoiceAsset, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000054, "Member 'WB_Message_Base_C_SetVoiceAsset::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetVoiceAsset, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000055, "Member 'WB_Message_Base_C_SetVoiceAsset::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetVoiceAsset, CallFunc_Array_Add_ReturnValue_1) == 0x000058, "Member 'WB_Message_Base_C_SetVoiceAsset::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.PlayMessage
// 0x0018 (0x0018 - 0x0000)
struct WB_Message_Base_C_PlayMessage final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BF8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_PlayMessage) == 0x000008, "Wrong alignment on WB_Message_Base_C_PlayMessage");
static_assert(sizeof(WB_Message_Base_C_PlayMessage) == 0x000018, "Wrong size on WB_Message_Base_C_PlayMessage");
static_assert(offsetof(WB_Message_Base_C_PlayMessage, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WB_Message_Base_C_PlayMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_PlayMessage, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000008, "Member 'WB_Message_Base_C_PlayMessage::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.GetVoiceAsset
// 0x0050 (0x0050 - 0x0000)
struct WB_Message_Base_C_GetVoiceAsset final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class USoundAtomCue*                          Array_Element;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BF9[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_GetVoiceAsset) == 0x000008, "Wrong alignment on WB_Message_Base_C_GetVoiceAsset");
static_assert(sizeof(WB_Message_Base_C_GetVoiceAsset) == 0x000050, "Wrong size on WB_Message_Base_C_GetVoiceAsset");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, Param_Name) == 0x000000, "Member 'WB_Message_Base_C_GetVoiceAsset::Param_Name' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, Array_Element) == 0x000010, "Member 'WB_Message_Base_C_GetVoiceAsset::Array_Element' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WB_Message_Base_C_GetVoiceAsset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WB_Message_Base_C_GetVoiceAsset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WB_Message_Base_C_GetVoiceAsset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WB_Message_Base_C_GetVoiceAsset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, CallFunc_Array_Get_Item) == 0x000028, "Member 'WB_Message_Base_C_GetVoiceAsset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WB_Message_Base_C_GetVoiceAsset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, CallFunc_GetObjectName_ReturnValue) == 0x000038, "Member 'WB_Message_Base_C_GetVoiceAsset::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetVoiceAsset, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000048, "Member 'WB_Message_Base_C_GetVoiceAsset::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.DeleteMessage
// 0x0018 (0x0018 - 0x0000)
struct WB_Message_Base_C_DeleteMessage final
{
public:
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_DeleteMessage) == 0x000008, "Wrong alignment on WB_Message_Base_C_DeleteMessage");
static_assert(sizeof(WB_Message_Base_C_DeleteMessage) == 0x000018, "Wrong size on WB_Message_Base_C_DeleteMessage");
static_assert(offsetof(WB_Message_Base_C_DeleteMessage, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000000, "Member 'WB_Message_Base_C_DeleteMessage::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_DeleteMessage, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WB_Message_Base_C_DeleteMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.GetLipSyncAsset
// 0x0050 (0x0050 - 0x0000)
struct WB_Message_Base_C_GetLipSyncAsset final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UCharaLipSync*                          Array_Element;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharaLipSync*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BFA[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_Base_C_GetLipSyncAsset) == 0x000008, "Wrong alignment on WB_Message_Base_C_GetLipSyncAsset");
static_assert(sizeof(WB_Message_Base_C_GetLipSyncAsset) == 0x000050, "Wrong size on WB_Message_Base_C_GetLipSyncAsset");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, Param_Name) == 0x000000, "Member 'WB_Message_Base_C_GetLipSyncAsset::Param_Name' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, Array_Element) == 0x000010, "Member 'WB_Message_Base_C_GetLipSyncAsset::Array_Element' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WB_Message_Base_C_GetLipSyncAsset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WB_Message_Base_C_GetLipSyncAsset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WB_Message_Base_C_GetLipSyncAsset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WB_Message_Base_C_GetLipSyncAsset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, CallFunc_Array_Get_Item) == 0x000028, "Member 'WB_Message_Base_C_GetLipSyncAsset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WB_Message_Base_C_GetLipSyncAsset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, CallFunc_GetObjectName_ReturnValue) == 0x000038, "Member 'WB_Message_Base_C_GetLipSyncAsset::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_GetLipSyncAsset, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000048, "Member 'WB_Message_Base_C_GetLipSyncAsset::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function WB_Message_Base.WB_Message_Base_C.SetSearchPath
// 0x0014 (0x0014 - 0x0000)
struct WB_Message_Base_C_SetSearchPath final
{
public:
	bool                                          IsUse;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BFB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VoicePath;                                         // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LipSyncPath;                                       // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_Base_C_SetSearchPath) == 0x000004, "Wrong alignment on WB_Message_Base_C_SetSearchPath");
static_assert(sizeof(WB_Message_Base_C_SetSearchPath) == 0x000014, "Wrong size on WB_Message_Base_C_SetSearchPath");
static_assert(offsetof(WB_Message_Base_C_SetSearchPath, IsUse) == 0x000000, "Member 'WB_Message_Base_C_SetSearchPath::IsUse' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetSearchPath, VoicePath) == 0x000004, "Member 'WB_Message_Base_C_SetSearchPath::VoicePath' has a wrong offset!");
static_assert(offsetof(WB_Message_Base_C_SetSearchPath, LipSyncPath) == 0x00000C, "Member 'WB_Message_Base_C_SetSearchPath::LipSyncPath' has a wrong offset!");

}

