#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapIconHelpOne

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MapIconHelpOne.WB_MapIconHelpOne_C
// 0x0070 (0x02D0 - 0x0260)
class UWB_MapIconHelpOne_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconMain;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconSub;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButtonS5*                              OnOffButton;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_ItemSlot;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_ItemSlotSelect;                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_Off;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_On;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_NElementIcon_C*                     WB_NElementIcon;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bSelect;                                           // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_MINIMAP_POI_ICON                            POIIcon;                                           // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3893[0x2];                                     // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimPlayRate;                                      // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitialState;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIconHide;                                         // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3894[0x6];                                     // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_MapIconHelpList_C*                  Parent;                                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MyListIndex;                                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_ICON_HELP_TYPE                      HelpType;                                          // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_MapIconHelpOne(int32 EntryPoint);
	void BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature(const struct FVector2D& Pos, const struct FVector2D& UV);
	void BndEvt__WB_MapIconHelpOne_OnOffButton_K2Node_ComponentBoundEvent_1_ButtonSimpleEventS5__DelegateSignature();
	void Construct();
	void BndEvt__SsPlayerWidget_ItemSlotSelect_K2Node_ComponentBoundEvent_2_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void BndEvt__SsPlayerWidget_ItemSlot_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void GetPOIIcon(E_MINIMAP_POI_ICON* Param_POIIcon);
	void UpdateSelectInfo(bool bInSelect);
	void PlayAnimSlotIn();
	void PlayAnimSlotLoop();
	void PlayAnimSlotOut();
	void CheckSelect(bool* IsSelect);
	void SetupItemData(bool Param_bSelect, bool bSkipInAnim, const struct FMinimapIconHelpEntry& Entry, class UWB_MapIconHelpList_C* Param_Parent, int32 ListIndex);
	void GetIconUV(E_MINIMAP_POI_ICON Param_POIIcon, float* OutU, float* OutV);
	void SetupIcon(E_MINIMAP_POI_ICON Param_POIIcon);
	void UpdateInfo();
	void ClearInfo();
	void PlayAnimSlotContinue();
	void InitAnim();
	void IsInitialState(bool* InitialState);
	void UpdateIconHide();
	void GetText(class FText* Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MapIconHelpOne_C">();
	}
	static class UWB_MapIconHelpOne_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MapIconHelpOne_C>();
	}
};
static_assert(alignof(UWB_MapIconHelpOne_C) == 0x000008, "Wrong alignment on UWB_MapIconHelpOne_C");
static_assert(sizeof(UWB_MapIconHelpOne_C) == 0x0002D0, "Wrong size on UWB_MapIconHelpOne_C");
static_assert(offsetof(UWB_MapIconHelpOne_C, UberGraphFrame) == 0x000260, "Member 'UWB_MapIconHelpOne_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, IconMain) == 0x000268, "Member 'UWB_MapIconHelpOne_C::IconMain' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, IconSub) == 0x000270, "Member 'UWB_MapIconHelpOne_C::IconSub' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, OnOffButton) == 0x000278, "Member 'UWB_MapIconHelpOne_C::OnOffButton' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, SsPlayerWidget_ItemSlot) == 0x000280, "Member 'UWB_MapIconHelpOne_C::SsPlayerWidget_ItemSlot' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, SsPlayerWidget_ItemSlotSelect) == 0x000288, "Member 'UWB_MapIconHelpOne_C::SsPlayerWidget_ItemSlotSelect' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, SsPlayerWidget_Off) == 0x000290, "Member 'UWB_MapIconHelpOne_C::SsPlayerWidget_Off' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, SsPlayerWidget_On) == 0x000298, "Member 'UWB_MapIconHelpOne_C::SsPlayerWidget_On' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, TextBlock_ItemName) == 0x0002A0, "Member 'UWB_MapIconHelpOne_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, WB_NElementIcon) == 0x0002A8, "Member 'UWB_MapIconHelpOne_C::WB_NElementIcon' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, bSelect) == 0x0002B0, "Member 'UWB_MapIconHelpOne_C::bSelect' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, POIIcon) == 0x0002B1, "Member 'UWB_MapIconHelpOne_C::POIIcon' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, AnimPlayRate) == 0x0002B4, "Member 'UWB_MapIconHelpOne_C::AnimPlayRate' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, bInitialState) == 0x0002B8, "Member 'UWB_MapIconHelpOne_C::bInitialState' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, bIconHide) == 0x0002B9, "Member 'UWB_MapIconHelpOne_C::bIconHide' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, Parent) == 0x0002C0, "Member 'UWB_MapIconHelpOne_C::Parent' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, MyListIndex) == 0x0002C8, "Member 'UWB_MapIconHelpOne_C::MyListIndex' has a wrong offset!");
static_assert(offsetof(UWB_MapIconHelpOne_C, HelpType) == 0x0002CC, "Member 'UWB_MapIconHelpOne_C::HelpType' has a wrong offset!");

}

