#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapSiegeAreaName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MapSiegeAreaName.WB_MapSiegeAreaName_C
// 0x0040 (0x02A0 - 0x0260)
class UWB_MapSiegeAreaName_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AreaText;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   AreaName;                                          // 0x0278(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             EvtDis_Finish;                                     // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EvtDis_Finish__DelegateSignature();
	void ExecuteUbergraph_WB_MapSiegeAreaName(int32 EntryPoint);
	void EndAnim();
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MapSiegeAreaName_C">();
	}
	static class UWB_MapSiegeAreaName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MapSiegeAreaName_C>();
	}
};
static_assert(alignof(UWB_MapSiegeAreaName_C) == 0x000008, "Wrong alignment on UWB_MapSiegeAreaName_C");
static_assert(sizeof(UWB_MapSiegeAreaName_C) == 0x0002A0, "Wrong size on UWB_MapSiegeAreaName_C");
static_assert(offsetof(UWB_MapSiegeAreaName_C, UberGraphFrame) == 0x000260, "Member 'UWB_MapSiegeAreaName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MapSiegeAreaName_C, Anim) == 0x000268, "Member 'UWB_MapSiegeAreaName_C::Anim' has a wrong offset!");
static_assert(offsetof(UWB_MapSiegeAreaName_C, AreaText) == 0x000270, "Member 'UWB_MapSiegeAreaName_C::AreaText' has a wrong offset!");
static_assert(offsetof(UWB_MapSiegeAreaName_C, AreaName) == 0x000278, "Member 'UWB_MapSiegeAreaName_C::AreaName' has a wrong offset!");
static_assert(offsetof(UWB_MapSiegeAreaName_C, EvtDis_Finish) == 0x000290, "Member 'UWB_MapSiegeAreaName_C::EvtDis_Finish' has a wrong offset!");

}

