#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapIconHelpWindow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.ExecuteUbergraph_WB_MapIconHelpWindow
// 0x00D0 (0x00D0 - 0x0000)
struct WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_2;         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_2;        // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_2;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_2;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E66[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E67[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex_1;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex_1;       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E68[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class USsPlayerWidget*                  K2Node_CustomEvent_SsPos;                          // 0x0080(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectTop_bTop;                         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E69[0x2];                                     // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ScrollDown_NewSelect;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E6A[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ScrollUp_NewSelect;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsTrigger;                            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsTrigger_2;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectBottom_bBottom;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsTrigger_1;                    // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E6B[0x1];                                     // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ScrollPageUp_NewSelect;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsTrigger;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectTop_bTop_1;                       // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectBottom_bBottom_1;                 // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E6C[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ScrollPageDown_NewSelect;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E6D[0x2];                                     // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow) == 0x000008, "Wrong alignment on WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow");
static_assert(sizeof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow) == 0x0000D0, "Wrong size on WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, EntryPoint) == 0x000000, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimPackName_2) == 0x000004, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimPackName_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimationName_2) == 0x00000C, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimationName_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimPackIndex_2) == 0x000014, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimPackIndex_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimationIndex_2) == 0x000018, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimationIndex_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_SwitchName_CmpSuccess) == 0x00001C, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_Event_MyGeometry) == 0x000020, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Play_ReturnValue) == 0x00005C, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Play_ReturnValue_1) == 0x00005D, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimPackName_1) == 0x000060, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimationName_1) == 0x000068, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimPackIndex_1) == 0x000070, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimationIndex_1) == 0x000074, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Play_ReturnValue_2) == 0x000078, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_SwitchName_CmpSuccess_1) == 0x000079, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_CustomEvent_SsPos) == 0x000080, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_CustomEvent_SsPos' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Play_ReturnValue_3) == 0x000088, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_IsSelectTop_bTop) == 0x000089, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_IsSelectTop_bTop' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_ScrollDown_NewSelect) == 0x00008C, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_ScrollDown_NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_ScrollUp_NewSelect) == 0x000094, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_ScrollUp_NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_Event_IsTrigger) == 0x000098, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_Event_IsTrigger' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_CustomEvent_IsTrigger_2) == 0x000099, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_CustomEvent_IsTrigger_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_IsSelectBottom_bBottom) == 0x00009A, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_IsSelectBottom_bBottom' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_BooleanOR_ReturnValue) == 0x00009B, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Not_PreBool_ReturnValue_1) == 0x00009C, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_BooleanOR_ReturnValue_1) == 0x00009D, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_CustomEvent_IsTrigger_1) == 0x00009E, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_CustomEvent_IsTrigger_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_ScrollPageUp_NewSelect) == 0x0000A0, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_ScrollPageUp_NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_CustomEvent_IsTrigger) == 0x0000A4, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_CustomEvent_IsTrigger' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_IsSelectTop_bTop_1) == 0x0000A5, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_IsSelectTop_bTop_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_IsSelectBottom_bBottom_1) == 0x0000A6, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_IsSelectBottom_bBottom_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000A7, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000A8, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_BooleanOR_ReturnValue_2) == 0x0000A9, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_BooleanOR_ReturnValue_3) == 0x0000AA, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_ScrollPageDown_NewSelect) == 0x0000AC, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_ScrollPageDown_NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_Play_ReturnValue_4) == 0x0000B0, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_SwitchEnum_CmpSuccess) == 0x0000B1, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimPackName) == 0x0000B4, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimationName) == 0x0000BC, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x0000C4, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_ComponentBoundEvent_AnimationIndex) == 0x0000C8, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000CC, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000CD, "Member 'WB_MapIconHelpWindow_C_ExecuteUbergraph_WB_MapIconHelpWindow::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MapIconHelpWindow_C_BndEvt__WB_MapIconHelpWindow_SsPlayerWidget_ScrollBar_K2Node_ComponentBoundEvent_4_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.scrollPageDown
// 0x0001 (0x0001 - 0x0000)
struct WB_MapIconHelpWindow_C_ScrollPageDown final
{
public:
	bool                                          IsTrigger;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_ScrollPageDown) == 0x000001, "Wrong alignment on WB_MapIconHelpWindow_C_ScrollPageDown");
static_assert(sizeof(WB_MapIconHelpWindow_C_ScrollPageDown) == 0x000001, "Wrong size on WB_MapIconHelpWindow_C_ScrollPageDown");
static_assert(offsetof(WB_MapIconHelpWindow_C_ScrollPageDown, IsTrigger) == 0x000000, "Member 'WB_MapIconHelpWindow_C_ScrollPageDown::IsTrigger' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.scrollPageUp
// 0x0001 (0x0001 - 0x0000)
struct WB_MapIconHelpWindow_C_ScrollPageUp final
{
public:
	bool                                          IsTrigger;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_ScrollPageUp) == 0x000001, "Wrong alignment on WB_MapIconHelpWindow_C_ScrollPageUp");
static_assert(sizeof(WB_MapIconHelpWindow_C_ScrollPageUp) == 0x000001, "Wrong size on WB_MapIconHelpWindow_C_ScrollPageUp");
static_assert(offsetof(WB_MapIconHelpWindow_C_ScrollPageUp, IsTrigger) == 0x000000, "Member 'WB_MapIconHelpWindow_C_ScrollPageUp::IsTrigger' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.scrollUp
// 0x0001 (0x0001 - 0x0000)
struct WB_MapIconHelpWindow_C_ScrollUp final
{
public:
	bool                                          IsTrigger;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_ScrollUp) == 0x000001, "Wrong alignment on WB_MapIconHelpWindow_C_ScrollUp");
static_assert(sizeof(WB_MapIconHelpWindow_C_ScrollUp) == 0x000001, "Wrong size on WB_MapIconHelpWindow_C_ScrollUp");
static_assert(offsetof(WB_MapIconHelpWindow_C_ScrollUp, IsTrigger) == 0x000000, "Member 'WB_MapIconHelpWindow_C_ScrollUp::IsTrigger' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.scrollDown
// 0x0001 (0x0001 - 0x0000)
struct WB_MapIconHelpWindow_C_ScrollDown final
{
public:
	bool                                          IsTrigger;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_ScrollDown) == 0x000001, "Wrong alignment on WB_MapIconHelpWindow_C_ScrollDown");
static_assert(sizeof(WB_MapIconHelpWindow_C_ScrollDown) == 0x000001, "Wrong size on WB_MapIconHelpWindow_C_ScrollDown");
static_assert(offsetof(WB_MapIconHelpWindow_C_ScrollDown, IsTrigger) == 0x000000, "Member 'WB_MapIconHelpWindow_C_ScrollDown::IsTrigger' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_BG_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_MapIconHelpWindow_C_BndEvt__SsPlayerWidget_Title_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_MapIconHelpWindow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_Tick) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_Tick");
static_assert(sizeof(WB_MapIconHelpWindow_C_Tick) == 0x00003C, "Wrong size on WB_MapIconHelpWindow_C_Tick");
static_assert(offsetof(WB_MapIconHelpWindow_C_Tick, MyGeometry) == 0x000000, "Member 'WB_MapIconHelpWindow_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_MapIconHelpWindow_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.Open
// 0x0008 (0x0008 - 0x0000)
struct WB_MapIconHelpWindow_C_Open final
{
public:
	const class USsPlayerWidget*                  SsPos;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_Open) == 0x000008, "Wrong alignment on WB_MapIconHelpWindow_C_Open");
static_assert(sizeof(WB_MapIconHelpWindow_C_Open) == 0x000008, "Wrong size on WB_MapIconHelpWindow_C_Open");
static_assert(offsetof(WB_MapIconHelpWindow_C_Open, SsPos) == 0x000000, "Member 'WB_MapIconHelpWindow_C_Open::SsPos' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.initScrollBarPosition
// 0x0020 (0x0020 - 0x0000)
struct WB_MapIconHelpWindow_C_InitScrollBarPosition final
{
public:
	class USsPlayerWidget*                        SsPos;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E6E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_InitScrollBarPosition) == 0x000008, "Wrong alignment on WB_MapIconHelpWindow_C_InitScrollBarPosition");
static_assert(sizeof(WB_MapIconHelpWindow_C_InitScrollBarPosition) == 0x000020, "Wrong size on WB_MapIconHelpWindow_C_InitScrollBarPosition");
static_assert(offsetof(WB_MapIconHelpWindow_C_InitScrollBarPosition, SsPos) == 0x000000, "Member 'WB_MapIconHelpWindow_C_InitScrollBarPosition::SsPos' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_InitScrollBarPosition, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_MapIconHelpWindow_C_InitScrollBarPosition::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_InitScrollBarPosition, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_MapIconHelpWindow_C_InitScrollBarPosition::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_InitScrollBarPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WB_MapIconHelpWindow_C_InitScrollBarPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.checkShowScrollBar
// 0x0005 (0x0005 - 0x0000)
struct WB_MapIconHelpWindow_C_CheckShowScrollBar final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isShowScrollBar_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_CheckShowScrollBar) == 0x000001, "Wrong alignment on WB_MapIconHelpWindow_C_CheckShowScrollBar");
static_assert(sizeof(WB_MapIconHelpWindow_C_CheckShowScrollBar) == 0x000005, "Wrong size on WB_MapIconHelpWindow_C_CheckShowScrollBar");
static_assert(offsetof(WB_MapIconHelpWindow_C_CheckShowScrollBar, Temp_bool_Variable) == 0x000000, "Member 'WB_MapIconHelpWindow_C_CheckShowScrollBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_CheckShowScrollBar, Temp_byte_Variable) == 0x000001, "Member 'WB_MapIconHelpWindow_C_CheckShowScrollBar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_CheckShowScrollBar, Temp_byte_Variable_1) == 0x000002, "Member 'WB_MapIconHelpWindow_C_CheckShowScrollBar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_CheckShowScrollBar, CallFunc_isShowScrollBar_ReturnValue) == 0x000003, "Member 'WB_MapIconHelpWindow_C_CheckShowScrollBar::CallFunc_isShowScrollBar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_CheckShowScrollBar, K2Node_Select_Default) == 0x000004, "Member 'WB_MapIconHelpWindow_C_CheckShowScrollBar::K2Node_Select_Default' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.isShowScrollBar
// 0x000C (0x000C - 0x0000)
struct WB_MapIconHelpWindow_C_IsShowScrollBar final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E6F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEntryNnum_Num;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_IsShowScrollBar) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_IsShowScrollBar");
static_assert(sizeof(WB_MapIconHelpWindow_C_IsShowScrollBar) == 0x00000C, "Wrong size on WB_MapIconHelpWindow_C_IsShowScrollBar");
static_assert(offsetof(WB_MapIconHelpWindow_C_IsShowScrollBar, ReturnValue) == 0x000000, "Member 'WB_MapIconHelpWindow_C_IsShowScrollBar::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_IsShowScrollBar, CallFunc_GetEntryNnum_Num) == 0x000004, "Member 'WB_MapIconHelpWindow_C_IsShowScrollBar::CallFunc_GetEntryNnum_Num' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_IsShowScrollBar, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WB_MapIconHelpWindow_C_IsShowScrollBar::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.updateScrollBar
// 0x0004 (0x0004 - 0x0000)
struct WB_MapIconHelpWindow_C_UpdateScrollBar final
{
public:
	float                                         CallFunc_GetScrollRate_rate;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_UpdateScrollBar) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_UpdateScrollBar");
static_assert(sizeof(WB_MapIconHelpWindow_C_UpdateScrollBar) == 0x000004, "Wrong size on WB_MapIconHelpWindow_C_UpdateScrollBar");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateScrollBar, CallFunc_GetScrollRate_rate) == 0x000000, "Member 'WB_MapIconHelpWindow_C_UpdateScrollBar::CallFunc_GetScrollRate_rate' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.SetHelpMessage
// 0x0078 (0x0078 - 0x0000)
struct WB_MapIconHelpWindow_C_SetHelpMessage final
{
public:
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMinimapIconHelpEntry                  CallFunc_GetSelectData_OutEntry;                   // 0x0008(0x0048)()
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E70[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_SetHelpMessage) == 0x000008, "Wrong alignment on WB_MapIconHelpWindow_C_SetHelpMessage");
static_assert(sizeof(WB_MapIconHelpWindow_C_SetHelpMessage) == 0x000078, "Wrong size on WB_MapIconHelpWindow_C_SetHelpMessage");
static_assert(offsetof(WB_MapIconHelpWindow_C_SetHelpMessage, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WB_MapIconHelpWindow_C_SetHelpMessage::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_SetHelpMessage, CallFunc_GetSelectData_OutEntry) == 0x000008, "Member 'WB_MapIconHelpWindow_C_SetHelpMessage::CallFunc_GetSelectData_OutEntry' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_SetHelpMessage, K2Node_DynamicCast_AsBPI_UIManager) == 0x000050, "Member 'WB_MapIconHelpWindow_C_SetHelpMessage::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_SetHelpMessage, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WB_MapIconHelpWindow_C_SetHelpMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_SetHelpMessage, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x000068, "Member 'WB_MapIconHelpWindow_C_SetHelpMessage::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.UpdateTitle
// 0x0020 (0x0020 - 0x0000)
struct WB_MapIconHelpWindow_C_UpdateTitle final
{
public:
	class USsPlayerWidget*                        SsPos;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_UpdateTitle) == 0x000008, "Wrong alignment on WB_MapIconHelpWindow_C_UpdateTitle");
static_assert(sizeof(WB_MapIconHelpWindow_C_UpdateTitle) == 0x000020, "Wrong size on WB_MapIconHelpWindow_C_UpdateTitle");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateTitle, SsPos) == 0x000000, "Member 'WB_MapIconHelpWindow_C_UpdateTitle::SsPos' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateTitle, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_MapIconHelpWindow_C_UpdateTitle::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateTitle, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_MapIconHelpWindow_C_UpdateTitle::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateTitle, CallFunc_Play_ReturnValue) == 0x000018, "Member 'WB_MapIconHelpWindow_C_UpdateTitle::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.UpdateBG
// 0x0020 (0x0020 - 0x0000)
struct WB_MapIconHelpWindow_C_UpdateBG final
{
public:
	class USsPlayerWidget*                        SsPos;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_UpdateBG) == 0x000008, "Wrong alignment on WB_MapIconHelpWindow_C_UpdateBG");
static_assert(sizeof(WB_MapIconHelpWindow_C_UpdateBG) == 0x000020, "Wrong size on WB_MapIconHelpWindow_C_UpdateBG");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateBG, SsPos) == 0x000000, "Member 'WB_MapIconHelpWindow_C_UpdateBG::SsPos' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateBG, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_MapIconHelpWindow_C_UpdateBG::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateBG, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_MapIconHelpWindow_C_UpdateBG::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateBG, CallFunc_Play_ReturnValue) == 0x000018, "Member 'WB_MapIconHelpWindow_C_UpdateBG::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.ListIn
// 0x0048 (0x0048 - 0x0000)
struct WB_MapIconHelpWindow_C_ListIn final
{
public:
	class USsPlayerWidget*                        SsPos;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutMapId;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutAreaId;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapIconHelpManager*                CallFunc_GetIconHelpManager_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMinimapIconHelpEntry>          CallFunc_GetDisplayList_ReturnValue;               // 0x0030(0x0010)(ReferenceParm)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_ListIn) == 0x000008, "Wrong alignment on WB_MapIconHelpWindow_C_ListIn");
static_assert(sizeof(WB_MapIconHelpWindow_C_ListIn) == 0x000048, "Wrong size on WB_MapIconHelpWindow_C_ListIn");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, SsPos) == 0x000000, "Member 'WB_MapIconHelpWindow_C_ListIn::SsPos' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000008, "Member 'WB_MapIconHelpWindow_C_ListIn::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, CallFunc_GetMinimapManager_ReturnValue) == 0x000010, "Member 'WB_MapIconHelpWindow_C_ListIn::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, CallFunc_GetMinimapManager_ReturnValue_1) == 0x000018, "Member 'WB_MapIconHelpWindow_C_ListIn::CallFunc_GetMinimapManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, CallFunc_GetShowingId_OutMapId) == 0x000020, "Member 'WB_MapIconHelpWindow_C_ListIn::CallFunc_GetShowingId_OutMapId' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, CallFunc_GetShowingId_OutAreaId) == 0x000024, "Member 'WB_MapIconHelpWindow_C_ListIn::CallFunc_GetShowingId_OutAreaId' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, CallFunc_GetIconHelpManager_ReturnValue) == 0x000028, "Member 'WB_MapIconHelpWindow_C_ListIn::CallFunc_GetIconHelpManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, CallFunc_GetDisplayList_ReturnValue) == 0x000030, "Member 'WB_MapIconHelpWindow_C_ListIn::CallFunc_GetDisplayList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_ListIn, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'WB_MapIconHelpWindow_C_ListIn::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.ScollBarScrolledByMouse
// 0x0004 (0x0004 - 0x0000)
struct WB_MapIconHelpWindow_C_ScollBarScrolledByMouse final
{
public:
	float                                         Position;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_ScollBarScrolledByMouse) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_ScollBarScrolledByMouse");
static_assert(sizeof(WB_MapIconHelpWindow_C_ScollBarScrolledByMouse) == 0x000004, "Wrong size on WB_MapIconHelpWindow_C_ScollBarScrolledByMouse");
static_assert(offsetof(WB_MapIconHelpWindow_C_ScollBarScrolledByMouse, Position) == 0x000000, "Member 'WB_MapIconHelpWindow_C_ScollBarScrolledByMouse::Position' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.BindEvents
// 0x0020 (0x0020 - 0x0000)
struct WB_MapIconHelpWindow_C_BindEvents final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float Position)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_BindEvents) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_BindEvents");
static_assert(sizeof(WB_MapIconHelpWindow_C_BindEvents) == 0x000020, "Wrong size on WB_MapIconHelpWindow_C_BindEvents");
static_assert(offsetof(WB_MapIconHelpWindow_C_BindEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WB_MapIconHelpWindow_C_BindEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_BindEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WB_MapIconHelpWindow_C_BindEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.OnListSelectionChanged
// 0x0008 (0x0008 - 0x0000)
struct WB_MapIconHelpWindow_C_OnListSelectionChanged final
{
public:
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_MapIconHelpWindow_C_OnListSelectionChanged) == 0x000008, "Wrong alignment on WB_MapIconHelpWindow_C_OnListSelectionChanged");
static_assert(sizeof(WB_MapIconHelpWindow_C_OnListSelectionChanged) == 0x000008, "Wrong size on WB_MapIconHelpWindow_C_OnListSelectionChanged");
static_assert(offsetof(WB_MapIconHelpWindow_C_OnListSelectionChanged, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WB_MapIconHelpWindow_C_OnListSelectionChanged::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function WB_MapIconHelpWindow.WB_MapIconHelpWindow_C.UpdateMouseWheel
// 0x0014 (0x0014 - 0x0000)
struct WB_MapIconHelpWindow_C_UpdateMouseWheel final
{
public:
	int32                                         CallFunc_DispDown_NewSelect;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DispUp_NewSelect;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMouseWheelArea_inside;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E71[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMouseWheelAxis_Axis;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MapIconHelpWindow_C_UpdateMouseWheel) == 0x000004, "Wrong alignment on WB_MapIconHelpWindow_C_UpdateMouseWheel");
static_assert(sizeof(WB_MapIconHelpWindow_C_UpdateMouseWheel) == 0x000014, "Wrong size on WB_MapIconHelpWindow_C_UpdateMouseWheel");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateMouseWheel, CallFunc_DispDown_NewSelect) == 0x000000, "Member 'WB_MapIconHelpWindow_C_UpdateMouseWheel::CallFunc_DispDown_NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateMouseWheel, CallFunc_DispUp_NewSelect) == 0x000004, "Member 'WB_MapIconHelpWindow_C_UpdateMouseWheel::CallFunc_DispUp_NewSelect' has a wrong offset!");
static_assert(offsetof(WB_MapIconHelpWindow_C_UpdateMouseWheel, CallFunc_IsMouseWheelArea_inside) == 0x000008, "Member 'WB_MapIconHelpWindow_C_UpdateMouseWheel::CallFunc_IsMouseWheelArea_inside' has a wrong offset!");
