#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MinimapDebugFogGrid

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_MinimapDebugFogGrid.WB_MinimapDebugFogGrid_C.SetFogGridTexture
// 0x0018 (0x0018 - 0x0000)
struct WB_MinimapDebugFogGrid_C_SetFogGridTexture final
{
public:
	class UTexture*                               InTexture;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_MinimapDebugFogGrid_C_SetFogGridTexture) == 0x000008, "Wrong alignment on WB_MinimapDebugFogGrid_C_SetFogGridTexture");
static_assert(sizeof(WB_MinimapDebugFogGrid_C_SetFogGridTexture) == 0x000018, "Wrong size on WB_MinimapDebugFogGrid_C_SetFogGridTexture");
static_assert(offsetof(WB_MinimapDebugFogGrid_C_SetFogGridTexture, InTexture) == 0x000000, "Member 'WB_MinimapDebugFogGrid_C_SetFogGridTexture::InTexture' has a wrong offset!");
static_assert(offsetof(WB_MinimapDebugFogGrid_C_SetFogGridTexture, K2Node_DynamicCast_AsTexture_2D) == 0x000008, "Member 'WB_MinimapDebugFogGrid_C_SetFogGridTexture::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WB_MinimapDebugFogGrid_C_SetFogGridTexture, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WB_MinimapDebugFogGrid_C_SetFogGridTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

