#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Minimap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "E_SORTWINDOW_MOUSE_EVENT_TYPE_structs.hpp"
#include "InputCore_structs.hpp"
#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ST_BtnHelp_ColorInfo_byIdx_structs.hpp"
#include "MapSubLevelMinimap_ST_structs.hpp"


namespace SDK::Params
{

// Function WB_Minimap.WB_Minimap_C.EvtDis_MinimapTextureLoadEnd__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_Minimap_C_EvtDis_MinimapTextureLoadEnd__DelegateSignature final
{
public:
	class UMinimapBGTextureEntry*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Minimap_C_EvtDis_MinimapTextureLoadEnd__DelegateSignature) == 0x000008, "Wrong alignment on WB_Minimap_C_EvtDis_MinimapTextureLoadEnd__DelegateSignature");
static_assert(sizeof(WB_Minimap_C_EvtDis_MinimapTextureLoadEnd__DelegateSignature) == 0x000008, "Wrong size on WB_Minimap_C_EvtDis_MinimapTextureLoadEnd__DelegateSignature");
static_assert(offsetof(WB_Minimap_C_EvtDis_MinimapTextureLoadEnd__DelegateSignature, Texture) == 0x000000, "Member 'WB_Minimap_C_EvtDis_MinimapTextureLoadEnd__DelegateSignature::Texture' has a wrong offset!");

// Function WB_Minimap.WB_Minimap_C.ExecuteUbergraph_WB_Minimap
// 0x0488 (0x0488 - 0x0000)
struct WB_Minimap_C_ExecuteUbergraph_WB_Minimap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4916[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMinimapBGTextureEntry* Texture)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapBGTextureManager*               CallFunc_GetBGTextureManager_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MapId_1;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AreaId_1;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_CHANGE_TYPE                         K2Node_CustomEvent_ChangeType_1;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckUseAlternateMapAreaId_UseAlternate;  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAlternateMapAreaId_AlternateExist;     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4917[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAlternateMapAreaId_OutMapId;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAlternateMapAreaId_OutAreaId;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4918[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4919[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMinimapBGTextureEntry*                 CallFunc_RegisterLoadedTexture_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FMapSubLevelMinimap_ST                 CallFunc_GetMinimap_Minimap;                       // 0x00C8(0x0050)(HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                CallFunc_Array_Get_Item;                           // 0x0120(0x0028)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491A[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491B[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetMapCommon_rerutn;                      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common;               // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491C[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomComponent*                         CallFunc_SpawnSound2D_ReturnValue;                 // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapCommon_rerutn_1;                    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapCommon_C>      K2Node_DynamicCast_AsBPI_Map_Common_1;             // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491D[0x3];                                     // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491E[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_1;                        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_2;                        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue;   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491F[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_1;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectSoundManager*                   CallFunc_Get_ReturnValue_3;                        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutMapId;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutAreaId;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAtomCue*                          CallFunc_GetCurrentBGM_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMapName_ReturnValue;                   // 0x0220(0x0018)()
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_2;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerId_OutMapId;                     // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerId_OutAreaId;                    // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapBGTextureManager*               CallFunc_GetBGTextureManager_ReturnValue_1;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OPTION_COMMON_SELECT_TYPE                   CallFunc_GetMoveDisplayOther_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4920[0x6];                                     // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_Get_ReturnValue_4;                        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_3;          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4921[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapBGTextureManager*               CallFunc_GetBGTextureManager_ReturnValue_2;        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CommonWindowCtrl_C> CallFunc_BPI_GetCommonWindowCtrl_OutActor;         // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_GetCommonWindowCtrl_Success;          // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4922[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapBGTextureEntry*                 CallFunc_GetLoadedEntry_ReturnValue;               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IActionWindowIsActive_OutActive;          // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4923[0x2];                                     // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_MapId;                          // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AreaId;                         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_CHANGE_TYPE                         K2Node_CustomEvent_ChangeType;                     // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4924[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapBGTextureEntry*                 K2Node_CustomEvent_TextureEntry;                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_4;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerId_OutMapId_1;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerId_OutAreaId_1;                  // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutMapId_1;                  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutAreaId_1;                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapBGTextureManager*               CallFunc_GetBGTextureManager_ReturnValue_3;        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapSelectManager*                      CallFunc_GetMapSelectManager_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectGCManager*                      CallFunc_Get_ReturnValue_5;                        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapBGTextureEntry*                 CallFunc_RegisterLoadedTexture_ReturnValue_1;      // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex;   // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_1; // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapSelectManager*                      CallFunc_GetMapSelectManager_ReturnValue_1;        // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Cursor;                         // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4925[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4926[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChildItemByIndex_OutFound;             // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4927[0x3];                                     // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapMapSelectItem                  CallFunc_GetChildItemByIndex_ReturnValue;          // 0x0364(0x0024)(ConstParm, NoDestructor)
	bool                                          CallFunc_GetParentItemByIndex_OutFound;            // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4928[0x3];                                     // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimapMapSelectItem                  CallFunc_GetParentItemByIndex_ReturnValue;         // 0x038C(0x0024)(ConstParm, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4929[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapBGTextureEntry*                 K2Node_CustomEvent_Texture;                        // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ScreenTransition_isFadeFinish_outValue_1; // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_492A[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_5;          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutMapId_2;                  // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShowingId_OutAreaId_2;                 // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_492B[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMapName_ReturnValue_1;                 // 0x03E0(0x0018)()
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x03F8(0x0010)(ZeroConstructor, NoDestructor)
	struct FMouseCursorState                      CallFunc_PopShowMouseCursor_ReturnValue;           // 0x0408(0x0018)()
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl;                   // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492C[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl;               // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_492D[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetMapUICtrl_MapUICtrl_1;                 // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl_1;             // 0x0458(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_492E[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapUICtrl_C>      K2Node_DynamicCast_AsBPI_Map_UICtrl_2;             // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap) == 0x000008, "Wrong alignment on WB_Minimap_C_ExecuteUbergraph_WB_Minimap");
static_assert(sizeof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap) == 0x000488, "Wrong size on WB_Minimap_C_ExecuteUbergraph_WB_Minimap");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, EntryPoint) == 0x000000, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, Temp_object_Variable) == 0x000018, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMinimapManager_ReturnValue) == 0x000030, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetBGTextureManager_ReturnValue) == 0x000038, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetBGTextureManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_MapId_1) == 0x000040, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_MapId_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_AreaId_1) == 0x000044, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_AreaId_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_ChangeType_1) == 0x000048, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_ChangeType_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_CheckUseAlternateMapAreaId_UseAlternate) == 0x000049, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_CheckUseAlternateMapAreaId_UseAlternate' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetAlternateMapAreaId_AlternateExist) == 0x00004A, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetAlternateMapAreaId_AlternateExist' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetAlternateMapAreaId_OutMapId) == 0x00004C, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetAlternateMapAreaId_OutMapId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetAlternateMapAreaId_OutAreaId) == 0x000050, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetAlternateMapAreaId_OutAreaId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_SelectInt_ReturnValue) == 0x000068, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000080, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_RegisterLoadedTexture_ReturnValue) == 0x0000A0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_RegisterLoadedTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMinimap_Minimap) == 0x0000C8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMinimap_Minimap' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetPlayerPawn_ReturnValue) == 0x000118, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Array_Get_Item) == 0x000120, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000148, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Get_ReturnValue) == 0x000158, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_AsBPI_UIManager) == 0x000160, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_AsBPI_UIManager' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor) == 0x000178, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMapCommon_rerutn) == 0x000188, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMapCommon_rerutn' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_AsBPI_Map_Common) == 0x000190, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_AsBPI_Map_Common' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_SpawnSound2D_ReturnValue) == 0x0001A8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMapCommon_rerutn_1) == 0x0001B0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMapCommon_rerutn_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_AsBPI_Map_Common_1) == 0x0001B8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_AsBPI_Map_Common_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_bSuccess_2) == 0x0001C8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001CC, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0001D0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_PlayAnimation_ReturnValue) == 0x0001D8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001E0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Get_ReturnValue_1) == 0x0001E8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Get_ReturnValue_2) == 0x0001F0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_ScreenTransition_isFadeFinish_outValue) == 0x0001F8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_ScreenTransition_isFadeFinish_outValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMinimapManager_ReturnValue_1) == 0x000200, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMinimapManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Get_ReturnValue_3) == 0x000208, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetShowingId_OutMapId) == 0x000210, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetShowingId_OutMapId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetShowingId_OutAreaId) == 0x000214, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetShowingId_OutAreaId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetCurrentBGM_ReturnValue) == 0x000218, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetCurrentBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMapName_ReturnValue) == 0x000220, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMapName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMinimapManager_ReturnValue_2) == 0x000238, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMinimapManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetPlayerId_OutMapId) == 0x000240, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetPlayerId_OutMapId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetPlayerId_OutAreaId) == 0x000244, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetPlayerId_OutAreaId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetBGTextureManager_ReturnValue_1) == 0x000248, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetBGTextureManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_Loaded) == 0x000250, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMoveDisplayOther_ReturnValue) == 0x000258, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMoveDisplayOther_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000259, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Get_ReturnValue_4) == 0x000260, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMinimapManager_ReturnValue_3) == 0x000268, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMinimapManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_AsBPI_UIManager_1) == 0x000270, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_AsBPI_UIManager_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_bSuccess_3) == 0x000280, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetBGTextureManager_ReturnValue_2) == 0x000288, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetBGTextureManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_BPI_GetCommonWindowCtrl_OutActor) == 0x000290, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_BPI_GetCommonWindowCtrl_OutActor' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_BPI_GetCommonWindowCtrl_Success) == 0x0002A0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_BPI_GetCommonWindowCtrl_Success' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetLoadedEntry_ReturnValue) == 0x0002A8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetLoadedEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_IsValid_ReturnValue) == 0x0002B0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_IActionWindowIsActive_OutActive) == 0x0002B1, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_IActionWindowIsActive_OutActive' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_MapId) == 0x0002B4, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_MapId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_AreaId) == 0x0002B8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_AreaId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_ChangeType) == 0x0002BC, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_ChangeType' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_TextureEntry) == 0x0002C0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_TextureEntry' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMinimapManager_ReturnValue_4) == 0x0002C8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMinimapManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetPlayerId_OutMapId_1) == 0x0002D0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetPlayerId_OutMapId_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetPlayerId_OutAreaId_1) == 0x0002D4, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetPlayerId_OutAreaId_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetShowingId_OutMapId_1) == 0x0002D8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetShowingId_OutMapId_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetShowingId_OutAreaId_1) == 0x0002DC, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetShowingId_OutAreaId_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetBGTextureManager_ReturnValue_3) == 0x0002E0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetBGTextureManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMapSelectManager_ReturnValue) == 0x0002E8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMapSelectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Get_ReturnValue_5) == 0x0002F0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Get_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, Temp_object_Variable_1) == 0x0002F8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_RegisterLoadedTexture_ReturnValue_1) == 0x000300, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_RegisterLoadedTexture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000308, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00030C, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_PlayAnimation_ReturnValue_2) == 0x000310, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex) == 0x000318, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_1) == 0x00031C, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_BPL_SortWindow2_GetCursorIdx_ListIndex_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_Loaded_1) == 0x000320, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMapSelectManager_ReturnValue_1) == 0x000328, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMapSelectManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_Cursor) == 0x000330, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_Cursor' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000338, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_SwitchEnum_CmpSuccess) == 0x000348, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000350, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetChildItemByIndex_OutFound) == 0x000360, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetChildItemByIndex_OutFound' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetChildItemByIndex_ReturnValue) == 0x000364, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetChildItemByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetParentItemByIndex_OutFound) == 0x000388, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetParentItemByIndex_OutFound' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetParentItemByIndex_ReturnValue) == 0x00038C, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetParentItemByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_SwitchEnum_CmpSuccess_1) == 0x0003B0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CustomEvent_Texture) == 0x0003B8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_ScreenTransition_isFadeFinish_outValue_1) == 0x0003C0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_ScreenTransition_isFadeFinish_outValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMinimapManager_ReturnValue_5) == 0x0003C8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMinimapManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetShowingId_OutMapId_2) == 0x0003D0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetShowingId_OutMapId_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetShowingId_OutAreaId_2) == 0x0003D4, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetShowingId_OutAreaId_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_Play_ReturnValue) == 0x0003D8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMapName_ReturnValue_1) == 0x0003E0, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMapName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003F8, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_PopShowMouseCursor_ReturnValue) == 0x000408, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_PopShowMouseCursor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMapUICtrl_MapUICtrl) == 0x000420, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMapUICtrl_MapUICtrl' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_BreakVector_X) == 0x000428, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_BreakVector_Y) == 0x00042C, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_BreakVector_Z) == 0x000430, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_AsBPI_Map_UICtrl) == 0x000438, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_AsBPI_Map_UICtrl' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_bSuccess_4) == 0x000448, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, CallFunc_GetMapUICtrl_MapUICtrl_1) == 0x000450, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::CallFunc_GetMapUICtrl_MapUICtrl_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_AsBPI_Map_UICtrl_1) == 0x000458, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_AsBPI_Map_UICtrl_1' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_bSuccess_5) == 0x000468, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_AsBPI_Map_UICtrl_2) == 0x000470, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_AsBPI_Map_UICtrl_2' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_ExecuteUbergraph_WB_Minimap, K2Node_DynamicCast_bSuccess_6) == 0x000480, "Member 'WB_Minimap_C_ExecuteUbergraph_WB_Minimap::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");

// Function WB_Minimap.WB_Minimap_C.FocusAfterLoad
// 0x0008 (0x0008 - 0x0000)
struct WB_Minimap_C_FocusAfterLoad final
{
public:
	class UMinimapBGTextureEntry*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Minimap_C_FocusAfterLoad) == 0x000008, "Wrong alignment on WB_Minimap_C_FocusAfterLoad");
static_assert(sizeof(WB_Minimap_C_FocusAfterLoad) == 0x000008, "Wrong size on WB_Minimap_C_FocusAfterLoad");
static_assert(offsetof(WB_Minimap_C_FocusAfterLoad, Texture) == 0x000000, "Member 'WB_Minimap_C_FocusAfterLoad::Texture' has a wrong offset!");

// Function WB_Minimap.WB_Minimap_C.Evt_MapSelectDecide
// 0x0004 (0x0004 - 0x0000)
struct WB_Minimap_C_Evt_MapSelectDecide final
{
public:
	int32                                         Param_Cursor;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Minimap_C_Evt_MapSelectDecide) == 0x000004, "Wrong alignment on WB_Minimap_C_Evt_MapSelectDecide");
static_assert(sizeof(WB_Minimap_C_Evt_MapSelectDecide) == 0x000004, "Wrong size on WB_Minimap_C_Evt_MapSelectDecide");
static_assert(offsetof(WB_Minimap_C_Evt_MapSelectDecide, Param_Cursor) == 0x000000, "Member 'WB_Minimap_C_Evt_MapSelectDecide::Param_Cursor' has a wrong offset!");

// Function WB_Minimap.WB_Minimap_C.Evt_SetTextureAfterLoad
// 0x0018 (0x0018 - 0x0000)
struct WB_Minimap_C_Evt_SetTextureAfterLoad final
{
public:
	int32                                         MapId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_CHANGE_TYPE                         ChangeType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapBGTextureEntry*                 TextureEntry;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Minimap_C_Evt_SetTextureAfterLoad) == 0x000008, "Wrong alignment on WB_Minimap_C_Evt_SetTextureAfterLoad");
static_assert(sizeof(WB_Minimap_C_Evt_SetTextureAfterLoad) == 0x000018, "Wrong size on WB_Minimap_C_Evt_SetTextureAfterLoad");
static_assert(offsetof(WB_Minimap_C_Evt_SetTextureAfterLoad, MapId) == 0x000000, "Member 'WB_Minimap_C_Evt_SetTextureAfterLoad::MapId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_Evt_SetTextureAfterLoad, AreaId) == 0x000004, "Member 'WB_Minimap_C_Evt_SetTextureAfterLoad::AreaId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_Evt_SetTextureAfterLoad, ChangeType) == 0x000008, "Member 'WB_Minimap_C_Evt_SetTextureAfterLoad::ChangeType' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_Evt_SetTextureAfterLoad, TextureEntry) == 0x000010, "Member 'WB_Minimap_C_Evt_SetTextureAfterLoad::TextureEntry' has a wrong offset!");

// Function WB_Minimap.WB_Minimap_C.Evt_LoadMinimapTextureAsync
// 0x000C (0x000C - 0x0000)
struct WB_Minimap_C_Evt_LoadMinimapTextureAsync final
{
public:
	int32                                         MapId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MINIMAP_CHANGE_TYPE                         ChangeType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Minimap_C_Evt_LoadMinimapTextureAsync) == 0x000004, "Wrong alignment on WB_Minimap_C_Evt_LoadMinimapTextureAsync");
static_assert(sizeof(WB_Minimap_C_Evt_LoadMinimapTextureAsync) == 0x00000C, "Wrong size on WB_Minimap_C_Evt_LoadMinimapTextureAsync");
static_assert(offsetof(WB_Minimap_C_Evt_LoadMinimapTextureAsync, MapId) == 0x000000, "Member 'WB_Minimap_C_Evt_LoadMinimapTextureAsync::MapId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_Evt_LoadMinimapTextureAsync, AreaId) == 0x000004, "Member 'WB_Minimap_C_Evt_LoadMinimapTextureAsync::AreaId' has a wrong offset!");
static_assert(offsetof(WB_Minimap_C_Evt_LoadMinimapTextureAsync, ChangeType) == 0x000008, "Member 'WB_Minimap_C_Evt_LoadMinimapTextureAsync::ChangeType' has a wrong offset!");

// Function WB_Minimap.WB_Minimap_C.OnLoaded_723B72C64AEDF3EBD0816BA2BAA42EA1
// 0x0008 (0x0008 - 0x0000)
struct WB_Minimap_C_OnLoaded_723B72C64AEDF3EBD0816BA2BAA42EA1 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Minimap_C_OnLoaded_723B72C64AEDF3EBD0816BA2BAA42EA1) == 0x000008, "Wrong alignment on WB_Minimap_C_OnLoaded_723B72C64AEDF3EBD0816BA2BAA42EA1");
static_assert(sizeof(WB_Minimap_C_OnLoaded_723B72C64AEDF3EBD0816BA2BAA42EA1) == 0x000008, "Wrong size on WB_Minimap_C_OnLoaded_723B72C64AEDF3EBD0816BA2BAA42EA1");
static_assert(offsetof(WB_Minimap_C_OnLoaded_723B72C64AEDF3EBD0816BA2BAA42EA1, Loaded) == 0x000000, "Member 'WB_Minimap_C_OnLoaded_723B72C64AEDF3EBD0816BA2BAA42EA1::Loaded' has a wrong offset!");

// Function WB_Minimap.WB_Minimap_C.OnLoaded_D842B4C24B1A5FB4378885938EF68C7E
// 0x0008 (0x0008 - 0x0000)
struct WB_Minimap_C_OnLoaded_D842B4C24B1A5FB4378885938EF68C7E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Minimap_C_OnLoaded_D842B4C24B1A5FB4378885938EF68C7E) == 0x000008, "Wrong alignment on WB_Minimap_C_OnLoaded_D842B4C24B1A5FB4378885938EF68C7E");
static_assert(sizeof(WB_Minimap_C_OnLoaded_D842B4C24B1A5FB4378885938EF68C7E) == 0x000008, "Wrong size on WB_Minimap_C_OnLoaded_D842B4C24B1A5FB4378885938EF68C7E");
static_assert(offsetof(WB_Minimap_C_OnLoaded_D842B4C24B1A5FB4378885938EF68C7E, Loaded) == 0x000000, "Member 'WB_Minimap_C_OnLoaded_D842B4C24B1A5FB4378885938EF68C7E::Loaded' has a wrong offset!");

// Function WB_Minimap.WB_Minimap_C.SetMinimapTexture
// 0x0030 (0x0030 - 0x0000)
struct WB_Minimap_C_SetMinimapTexture final
{
public:
	class UMinimapBGTextureEntry*                 MinimapTexture;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
