#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MapSymbolBackMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MapSymbolBackMarker.WB_MapSymbolBackMarker_C
// 0x0038 (0x0298 - 0x0260)
class UWB_MapSymbolBackMarker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           MarkerPanel;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MarkerPoint1;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MarkerPoint2;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MarkerPoint3;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MarkerPoint4;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MarkerText;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_MapSymbolBackMarker(int32 EntryPoint);
	void SetSymbolLocation(const struct FVector& SymbolLocation);
	void GetCrossPoint(const struct FVector2D& Line1, const struct FVector2D& Line2, const struct FVector2D& Line3, const struct FVector2D& Line4, struct FVector2D* Cross, bool* Success);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MapSymbolBackMarker_C">();
	}
	static class UWB_MapSymbolBackMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MapSymbolBackMarker_C>();
	}
};
static_assert(alignof(UWB_MapSymbolBackMarker_C) == 0x000008, "Wrong alignment on UWB_MapSymbolBackMarker_C");
static_assert(sizeof(UWB_MapSymbolBackMarker_C) == 0x000298, "Wrong size on UWB_MapSymbolBackMarker_C");
static_assert(offsetof(UWB_MapSymbolBackMarker_C, UberGraphFrame) == 0x000260, "Member 'UWB_MapSymbolBackMarker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_MapSymbolBackMarker_C, MarkerPanel) == 0x000268, "Member 'UWB_MapSymbolBackMarker_C::MarkerPanel' has a wrong offset!");
static_assert(offsetof(UWB_MapSymbolBackMarker_C, MarkerPoint1) == 0x000270, "Member 'UWB_MapSymbolBackMarker_C::MarkerPoint1' has a wrong offset!");
static_assert(offsetof(UWB_MapSymbolBackMarker_C, MarkerPoint2) == 0x000278, "Member 'UWB_MapSymbolBackMarker_C::MarkerPoint2' has a wrong offset!");
static_assert(offsetof(UWB_MapSymbolBackMarker_C, MarkerPoint3) == 0x000280, "Member 'UWB_MapSymbolBackMarker_C::MarkerPoint3' has a wrong offset!");
static_assert(offsetof(UWB_MapSymbolBackMarker_C, MarkerPoint4) == 0x000288, "Member 'UWB_MapSymbolBackMarker_C::MarkerPoint4' has a wrong offset!");
static_assert(offsetof(UWB_MapSymbolBackMarker_C, MarkerText) == 0x000290, "Member 'UWB_MapSymbolBackMarker_C::MarkerText' has a wrong offset!");

}

