#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_NSupportIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_NSupportIcon.WB_NSupportIcon_C
// 0x0020 (0x0280 - 0x0260)
class UWB_NSupportIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanelSupport;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSupport;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Supportnumber;                                     // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_NSupportIcon(int32 EntryPoint);
	void Construct();
	void ResetSupportIcon();
	void SetSupportIcon(int32 InSupportIndex);
	void GetButtonUV(int32* OutUPos, int32* OutVPos);
	void SetImageSupport(class UImage* InImage, int32 InUpos, int32 InVPos);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_NSupportIcon_C">();
	}
	static class UWB_NSupportIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_NSupportIcon_C>();
	}
};
static_assert(alignof(UWB_NSupportIcon_C) == 0x000008, "Wrong alignment on UWB_NSupportIcon_C");
static_assert(sizeof(UWB_NSupportIcon_C) == 0x000280, "Wrong size on UWB_NSupportIcon_C");
static_assert(offsetof(UWB_NSupportIcon_C, UberGraphFrame) == 0x000260, "Member 'UWB_NSupportIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_NSupportIcon_C, CanvasPanelSupport) == 0x000268, "Member 'UWB_NSupportIcon_C::CanvasPanelSupport' has a wrong offset!");
static_assert(offsetof(UWB_NSupportIcon_C, ImageSupport) == 0x000270, "Member 'UWB_NSupportIcon_C::ImageSupport' has a wrong offset!");
static_assert(offsetof(UWB_NSupportIcon_C, Supportnumber) == 0x000278, "Member 'UWB_NSupportIcon_C::Supportnumber' has a wrong offset!");

}

