#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_NBadstatusIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"


namespace SDK::Params
{

// Function WB_NBadstatusIcon.WB_NBadstatusIcon_C.ExecuteUbergraph_WB_NBadstatusIcon
// 0x0010 (0x0010 - 0x0000)
struct WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BAD_STATUS                                  K2Node_CustomEvent_InBadstatus;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetButtonUV_outuposition;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetButtonUV_outvposition;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon) == 0x000004, "Wrong alignment on WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon");
static_assert(sizeof(WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon) == 0x000010, "Wrong size on WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon");
static_assert(offsetof(WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon, EntryPoint) == 0x000000, "Member 'WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon, K2Node_CustomEvent_InBadstatus) == 0x000004, "Member 'WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon::K2Node_CustomEvent_InBadstatus' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon, CallFunc_GetButtonUV_outuposition) == 0x000008, "Member 'WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon::CallFunc_GetButtonUV_outuposition' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon, CallFunc_GetButtonUV_outvposition) == 0x00000C, "Member 'WB_NBadstatusIcon_C_ExecuteUbergraph_WB_NBadstatusIcon::CallFunc_GetButtonUV_outvposition' has a wrong offset!");

// Function WB_NBadstatusIcon.WB_NBadstatusIcon_C.SetBadstatusIcon
// 0x0001 (0x0001 - 0x0000)
struct WB_NBadstatusIcon_C_SetBadstatusIcon final
{
public:
	E_BAD_STATUS                                  InBadStatus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NBadstatusIcon_C_SetBadstatusIcon) == 0x000001, "Wrong alignment on WB_NBadstatusIcon_C_SetBadstatusIcon");
static_assert(sizeof(WB_NBadstatusIcon_C_SetBadstatusIcon) == 0x000001, "Wrong size on WB_NBadstatusIcon_C_SetBadstatusIcon");
static_assert(offsetof(WB_NBadstatusIcon_C_SetBadstatusIcon, InBadStatus) == 0x000000, "Member 'WB_NBadstatusIcon_C_SetBadstatusIcon::InBadStatus' has a wrong offset!");

// Function WB_NBadstatusIcon.WB_NBadstatusIcon_C.GetButtonUV
// 0x0014 (0x0014 - 0x0000)
struct WB_NBadstatusIcon_C_GetButtonUV final
{
public:
	int32                                         Outuposition;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Outvposition;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VPos;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UPos;                                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_NBadstatusIcon_C_GetButtonUV) == 0x000004, "Wrong alignment on WB_NBadstatusIcon_C_GetButtonUV");
static_assert(sizeof(WB_NBadstatusIcon_C_GetButtonUV) == 0x000014, "Wrong size on WB_NBadstatusIcon_C_GetButtonUV");
static_assert(offsetof(WB_NBadstatusIcon_C_GetButtonUV, Outuposition) == 0x000000, "Member 'WB_NBadstatusIcon_C_GetButtonUV::Outuposition' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_GetButtonUV, Outvposition) == 0x000004, "Member 'WB_NBadstatusIcon_C_GetButtonUV::Outvposition' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_GetButtonUV, VPos) == 0x000008, "Member 'WB_NBadstatusIcon_C_GetButtonUV::VPos' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_GetButtonUV, UPos) == 0x00000C, "Member 'WB_NBadstatusIcon_C_GetButtonUV::UPos' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_GetButtonUV, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WB_NBadstatusIcon_C_GetButtonUV::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WB_NBadstatusIcon.WB_NBadstatusIcon_C.SetImageBadStatus
// 0x0030 (0x0030 - 0x0000)
struct WB_NBadstatusIcon_C_SetImageBadStatus final
{
public:
	class UImage*                                 InImage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InUpos;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InVPos;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NBadstatusIcon_C_SetImageBadStatus) == 0x000008, "Wrong alignment on WB_NBadstatusIcon_C_SetImageBadStatus");
static_assert(sizeof(WB_NBadstatusIcon_C_SetImageBadStatus) == 0x000030, "Wrong size on WB_NBadstatusIcon_C_SetImageBadStatus");
static_assert(offsetof(WB_NBadstatusIcon_C_SetImageBadStatus, InImage) == 0x000000, "Member 'WB_NBadstatusIcon_C_SetImageBadStatus::InImage' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_SetImageBadStatus, InUpos) == 0x000008, "Member 'WB_NBadstatusIcon_C_SetImageBadStatus::InUpos' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_SetImageBadStatus, InVPos) == 0x00000C, "Member 'WB_NBadstatusIcon_C_SetImageBadStatus::InVPos' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_SetImageBadStatus, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WB_NBadstatusIcon_C_SetImageBadStatus::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_SetImageBadStatus, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'WB_NBadstatusIcon_C_SetImageBadStatus::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_SetImageBadStatus, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00001C, "Member 'WB_NBadstatusIcon_C_SetImageBadStatus::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_NBadstatusIcon_C_SetImageBadStatus, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'WB_NBadstatusIcon_C_SetImageBadStatus::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

