#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_NSlashIcon01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_NSlashIcon01.WB_NSlashIcon01_C.ExecuteUbergraph_WB_NSlashIcon01
// 0x0020 (0x0020 - 0x0000)
struct WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5291[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01) == 0x000008, "Wrong alignment on WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01");
static_assert(sizeof(WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01) == 0x000020, "Wrong size on WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01");
static_assert(offsetof(WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01, EntryPoint) == 0x000000, "Member 'WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WB_NSlashIcon01_C_ExecuteUbergraph_WB_NSlashIcon01::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WB_NSlashIcon01.WB_NSlashIcon01_C.SetFontColor
// 0x0004 (0x0004 - 0x0000)
struct WB_NSlashIcon01_C_SetFontColor final
{
public:
	int32                                         InColorType;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NSlashIcon01_C_SetFontColor) == 0x000004, "Wrong alignment on WB_NSlashIcon01_C_SetFontColor");
static_assert(sizeof(WB_NSlashIcon01_C_SetFontColor) == 0x000004, "Wrong size on WB_NSlashIcon01_C_SetFontColor");
static_assert(offsetof(WB_NSlashIcon01_C_SetFontColor, InColorType) == 0x000000, "Member 'WB_NSlashIcon01_C_SetFontColor::InColorType' has a wrong offset!");

}

