#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_NNumberIcon03D8

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_NNumberIcon03D8.WB_NNumberIcon03D8_C.ExecuteUbergraph_WB_NNumberIcon03D8
// 0x0004 (0x0004 - 0x0000)
struct WB_NNumberIcon03D8_C_ExecuteUbergraph_WB_NNumberIcon03D8 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NNumberIcon03D8_C_ExecuteUbergraph_WB_NNumberIcon03D8) == 0x000004, "Wrong alignment on WB_NNumberIcon03D8_C_ExecuteUbergraph_WB_NNumberIcon03D8");
static_assert(sizeof(WB_NNumberIcon03D8_C_ExecuteUbergraph_WB_NNumberIcon03D8) == 0x000004, "Wrong size on WB_NNumberIcon03D8_C_ExecuteUbergraph_WB_NNumberIcon03D8");
static_assert(offsetof(WB_NNumberIcon03D8_C_ExecuteUbergraph_WB_NNumberIcon03D8, EntryPoint) == 0x000000, "Member 'WB_NNumberIcon03D8_C_ExecuteUbergraph_WB_NNumberIcon03D8::EntryPoint' has a wrong offset!");

// Function WB_NNumberIcon03D8.WB_NNumberIcon03D8_C.SetNumber
// 0x0058 (0x0058 - 0x0000)
struct WB_NNumberIcon03D8_C_SetNumber final
{
public:
	int32                                         InParam;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InZeroSpace;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InLeft;                                            // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_GetImageNo_OutImage;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumberParam_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumberDisplay_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NNumberIcon03D8_C_SetNumber) == 0x000008, "Wrong alignment on WB_NNumberIcon03D8_C_SetNumber");
static_assert(sizeof(WB_NNumberIcon03D8_C_SetNumber) == 0x000058, "Wrong size on WB_NNumberIcon03D8_C_SetNumber");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, InParam) == 0x000000, "Member 'WB_NNumberIcon03D8_C_SetNumber::InParam' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, InZeroSpace) == 0x000004, "Member 'WB_NNumberIcon03D8_C_SetNumber::InZeroSpace' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, InLeft) == 0x000005, "Member 'WB_NNumberIcon03D8_C_SetNumber::InLeft' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_GetImageNo_OutImage) == 0x000008, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_GetImageNo_OutImage' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_GetNumberParam_ReturnValue) == 0x000020, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_GetNumberParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, Temp_int_Variable) == 0x000024, "Member 'WB_NNumberIcon03D8_C_SetNumber::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_MakeVector2D_ReturnValue) == 0x00002C, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000038, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_IsNumberDisplay_ReturnValue) == 0x000040, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_IsNumberDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000044, "Member 'WB_NNumberIcon03D8_C_SetNumber::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumber, K2Node_MakeStruct_LinearColor) == 0x000048, "Member 'WB_NNumberIcon03D8_C_SetNumber::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function WB_NNumberIcon03D8.WB_NNumberIcon03D8_C.SetNumberDisp
// 0x0008 (0x0008 - 0x0000)
struct WB_NNumberIcon03D8_C_SetNumberDisp final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InDisp;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_NNumberIcon03D8_C_SetNumberDisp) == 0x000004, "Wrong alignment on WB_NNumberIcon03D8_C_SetNumberDisp");
static_assert(sizeof(WB_NNumberIcon03D8_C_SetNumberDisp) == 0x000008, "Wrong size on WB_NNumberIcon03D8_C_SetNumberDisp");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumberDisp, InIndex) == 0x000000, "Member 'WB_NNumberIcon03D8_C_SetNumberDisp::InIndex' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumberDisp, InDisp) == 0x000004, "Member 'WB_NNumberIcon03D8_C_SetNumberDisp::InDisp' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetNumberDisp, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_NNumberIcon03D8_C_SetNumberDisp::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_NNumberIcon03D8.WB_NNumberIcon03D8_C.GetImageNo
// 0x0020 (0x0020 - 0x0000)
struct WB_NNumberIcon03D8_C_GetImageNo final
{
public:
	int32                                         InDigit;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 OutImage;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Imageno;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_NNumberIcon03D8_C_GetImageNo) == 0x000008, "Wrong alignment on WB_NNumberIcon03D8_C_GetImageNo");
static_assert(sizeof(WB_NNumberIcon03D8_C_GetImageNo) == 0x000020, "Wrong size on WB_NNumberIcon03D8_C_GetImageNo");
static_assert(offsetof(WB_NNumberIcon03D8_C_GetImageNo, InDigit) == 0x000000, "Member 'WB_NNumberIcon03D8_C_GetImageNo::InDigit' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_GetImageNo, OutImage) == 0x000008, "Member 'WB_NNumberIcon03D8_C_GetImageNo::OutImage' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_GetImageNo, Imageno) == 0x000010, "Member 'WB_NNumberIcon03D8_C_GetImageNo::Imageno' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_GetImageNo, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_NNumberIcon03D8_C_GetImageNo::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_NNumberIcon03D8.WB_NNumberIcon03D8_C.SetFontColor
// 0x0004 (0x0004 - 0x0000)
struct WB_NNumberIcon03D8_C_SetFontColor final
{
public:
	int32                                         InColorType;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NNumberIcon03D8_C_SetFontColor) == 0x000004, "Wrong alignment on WB_NNumberIcon03D8_C_SetFontColor");
static_assert(sizeof(WB_NNumberIcon03D8_C_SetFontColor) == 0x000004, "Wrong size on WB_NNumberIcon03D8_C_SetFontColor");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetFontColor, InColorType) == 0x000000, "Member 'WB_NNumberIcon03D8_C_SetFontColor::InColorType' has a wrong offset!");

// Function WB_NNumberIcon03D8.WB_NNumberIcon03D8_C.SetQuestion
// 0x0078 (0x0078 - 0x0000)
struct WB_NNumberIcon03D8_C_SetQuestion final
{
public:
	int32                                         InDigits;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InZeroSpace;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InLeft;                                            // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_GetImageNo_OutImage;                      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NNumberIcon03D8_C_SetQuestion) == 0x000008, "Wrong alignment on WB_NNumberIcon03D8_C_SetQuestion");
static_assert(sizeof(WB_NNumberIcon03D8_C_SetQuestion) == 0x000078, "Wrong size on WB_NNumberIcon03D8_C_SetQuestion");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, InDigits) == 0x000000, "Member 'WB_NNumberIcon03D8_C_SetQuestion::InDigits' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, InZeroSpace) == 0x000004, "Member 'WB_NNumberIcon03D8_C_SetQuestion::InZeroSpace' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, InLeft) == 0x000005, "Member 'WB_NNumberIcon03D8_C_SetQuestion::InLeft' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, Temp_int_Variable) == 0x00000C, "Member 'WB_NNumberIcon03D8_C_SetQuestion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000011, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, Temp_int_Variable_1) == 0x000018, "Member 'WB_NNumberIcon03D8_C_SetQuestion::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, Temp_int_Variable_2) == 0x000038, "Member 'WB_NNumberIcon03D8_C_SetQuestion::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_GetImageNo_OutImage) == 0x000040, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_GetImageNo_OutImage' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000054, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000058, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, K2Node_MakeStruct_LinearColor) == 0x00005C, "Member 'WB_NNumberIcon03D8_C_SetQuestion::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00006C, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'WB_NNumberIcon03D8_C_SetQuestion::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetQuestion, Temp_int_Variable_3) == 0x000074, "Member 'WB_NNumberIcon03D8_C_SetQuestion::Temp_int_Variable_3' has a wrong offset!");

// Function WB_NNumberIcon03D8.WB_NNumberIcon03D8_C.SetBar
// 0x0078 (0x0078 - 0x0000)
struct WB_NNumberIcon03D8_C_SetBar final
{
public:
	int32                                         InDigits;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InZeroSpace;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InLeft;                                            // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_GetImageNo_OutImage;                      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_NNumberIcon03D8_C_SetBar) == 0x000008, "Wrong alignment on WB_NNumberIcon03D8_C_SetBar");
static_assert(sizeof(WB_NNumberIcon03D8_C_SetBar) == 0x000078, "Wrong size on WB_NNumberIcon03D8_C_SetBar");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetBar, InDigits) == 0x000000, "Member 'WB_NNumberIcon03D8_C_SetBar::InDigits' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetBar, InZeroSpace) == 0x000004, "Member 'WB_NNumberIcon03D8_C_SetBar::InZeroSpace' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetBar, InLeft) == 0x000005, "Member 'WB_NNumberIcon03D8_C_SetBar::InLeft' has a wrong offset!");
static_assert(offsetof(WB_NNumberIcon03D8_C_SetBar, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WB_NNumberIcon03D8_C_SetBar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
