#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PopUpSs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_PopUpSs.WB_PopUpSs_C
// 0x0020 (0x0280 - 0x0260)
class UWB_PopUpSs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USsPlayerWidget*                        SsPlayerWidget_PopUp;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_POP_UP_ICON_TYPE                            IconType;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62CA[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ListIndex;                                         // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStarted;                                         // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_PopUpSs(int32 EntryPoint);
	void BndEvt__SsPlayerWidget_PopUp_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void Start(const E_POP_UP_ICON_TYPE& Param_IconType, int32 Param_ListIndex);
	void PreConstruct(bool IsDesignTime);
	void Stop();
	void SetRenderSize(float SizeX, float SizeY);
	void SetMaterialReplacement(E_MINIMAP_MODE MinimapMode);
	void SetEntry(struct FPopUpIconEntry& Entry);
	void Kill();
	void GetAnimPackName(E_POP_UP_ICON_TYPE& Param_IconType, class FName* OutName);
	void CheckIsStarted(bool* Param_IsStarted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_PopUpSs_C">();
	}
	static class UWB_PopUpSs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_PopUpSs_C>();
	}
};
static_assert(alignof(UWB_PopUpSs_C) == 0x000008, "Wrong alignment on UWB_PopUpSs_C");
static_assert(sizeof(UWB_PopUpSs_C) == 0x000280, "Wrong size on UWB_PopUpSs_C");
static_assert(offsetof(UWB_PopUpSs_C, UberGraphFrame) == 0x000260, "Member 'UWB_PopUpSs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_PopUpSs_C, SsPlayerWidget_PopUp) == 0x000268, "Member 'UWB_PopUpSs_C::SsPlayerWidget_PopUp' has a wrong offset!");
static_assert(offsetof(UWB_PopUpSs_C, IconType) == 0x000270, "Member 'UWB_PopUpSs_C::IconType' has a wrong offset!");
static_assert(offsetof(UWB_PopUpSs_C, ListIndex) == 0x000274, "Member 'UWB_PopUpSs_C::ListIndex' has a wrong offset!");
static_assert(offsetof(UWB_PopUpSs_C, IsStarted) == 0x000278, "Member 'UWB_PopUpSs_C::IsStarted' has a wrong offset!");

}

