#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuestSlotList2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "E_CampQuest_SsAnimState_structs.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.OnHoveredMouse
// 0x0004 (0x0004 - 0x0000)
struct WB_QuestSlotList2_C_OnHoveredMouse final
{
public:
	int32                                         OnHoveredSlot;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_QuestSlotList2_C_OnHoveredMouse) == 0x000004, "Wrong alignment on WB_QuestSlotList2_C_OnHoveredMouse");
static_assert(sizeof(WB_QuestSlotList2_C_OnHoveredMouse) == 0x000004, "Wrong size on WB_QuestSlotList2_C_OnHoveredMouse");
static_assert(offsetof(WB_QuestSlotList2_C_OnHoveredMouse, OnHoveredSlot) == 0x000000, "Member 'WB_QuestSlotList2_C_OnHoveredMouse::OnHoveredSlot' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.UnbindMouseInputEvent
// 0x0020 (0x0020 - 0x0000)
struct WB_QuestSlotList2_C_UnbindMouseInputEvent final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_UnbindMouseInputEvent) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_UnbindMouseInputEvent");
static_assert(sizeof(WB_QuestSlotList2_C_UnbindMouseInputEvent) == 0x000020, "Wrong size on WB_QuestSlotList2_C_UnbindMouseInputEvent");
static_assert(offsetof(WB_QuestSlotList2_C_UnbindMouseInputEvent, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_QuestSlotList2_C_UnbindMouseInputEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_UnbindMouseInputEvent, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_QuestSlotList2_C_UnbindMouseInputEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_UnbindMouseInputEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_QuestSlotList2_C_UnbindMouseInputEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_UnbindMouseInputEvent, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WB_QuestSlotList2_C_UnbindMouseInputEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_UnbindMouseInputEvent, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_QuestSlotList2_C_UnbindMouseInputEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_UnbindMouseInputEvent, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_QuestSlotList2_C_UnbindMouseInputEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.BindMouseInputEvent
// 0x0030 (0x0030 - 0x0000)
struct WB_QuestSlotList2_C_BindMouseInputEvent final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SlotIdx)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_BindMouseInputEvent) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_BindMouseInputEvent");
static_assert(sizeof(WB_QuestSlotList2_C_BindMouseInputEvent) == 0x000030, "Wrong size on WB_QuestSlotList2_C_BindMouseInputEvent");
static_assert(offsetof(WB_QuestSlotList2_C_BindMouseInputEvent, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_QuestSlotList2_C_BindMouseInputEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_BindMouseInputEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WB_QuestSlotList2_C_BindMouseInputEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_BindMouseInputEvent, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WB_QuestSlotList2_C_BindMouseInputEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_BindMouseInputEvent, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_QuestSlotList2_C_BindMouseInputEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_BindMouseInputEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WB_QuestSlotList2_C_BindMouseInputEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_BindMouseInputEvent, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WB_QuestSlotList2_C_BindMouseInputEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_BindMouseInputEvent, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WB_QuestSlotList2_C_BindMouseInputEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.SkipAnim_IfCursorOnNotListInSlot
// 0x000C (0x000C - 0x0000)
struct WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8448[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot) == 0x000004, "Wrong alignment on WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot");
static_assert(sizeof(WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot) == 0x00000C, "Wrong size on WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot");
static_assert(offsetof(WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_QuestSlotList2_C_SkipAnim_IfCursorOnNotListInSlot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.GetSlotListAnimState
// 0x0001 (0x0001 - 0x0000)
struct WB_QuestSlotList2_C_GetSlotListAnimState final
{
public:
	E_CampQuest_SsAnimState                       AnimState;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_QuestSlotList2_C_GetSlotListAnimState) == 0x000001, "Wrong alignment on WB_QuestSlotList2_C_GetSlotListAnimState");
static_assert(sizeof(WB_QuestSlotList2_C_GetSlotListAnimState) == 0x000001, "Wrong size on WB_QuestSlotList2_C_GetSlotListAnimState");
static_assert(offsetof(WB_QuestSlotList2_C_GetSlotListAnimState, AnimState) == 0x000000, "Member 'WB_QuestSlotList2_C_GetSlotListAnimState::AnimState' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.GetSlotDrawMax
// 0x0008 (0x0008 - 0x0000)
struct WB_QuestSlotList2_C_GetSlotDrawMax final
{
public:
	int32                                         MaxDrawNum;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_QuestSlotList2_C_GetSlotDrawMax) == 0x000004, "Wrong alignment on WB_QuestSlotList2_C_GetSlotDrawMax");
static_assert(sizeof(WB_QuestSlotList2_C_GetSlotDrawMax) == 0x000008, "Wrong size on WB_QuestSlotList2_C_GetSlotDrawMax");
static_assert(offsetof(WB_QuestSlotList2_C_GetSlotDrawMax, MaxDrawNum) == 0x000000, "Member 'WB_QuestSlotList2_C_GetSlotDrawMax::MaxDrawNum' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_GetSlotDrawMax, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WB_QuestSlotList2_C_GetSlotDrawMax::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.SetUpdateIconState
// 0x0018 (0x0018 - 0x0000)
struct WB_QuestSlotList2_C_SetUpdateIconState final
{
public:
	int32                                         InSlotIdx;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisibleIcon;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8449[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_SetUpdateIconState) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_SetUpdateIconState");
static_assert(sizeof(WB_QuestSlotList2_C_SetUpdateIconState) == 0x000018, "Wrong size on WB_QuestSlotList2_C_SetUpdateIconState");
static_assert(offsetof(WB_QuestSlotList2_C_SetUpdateIconState, InSlotIdx) == 0x000000, "Member 'WB_QuestSlotList2_C_SetUpdateIconState::InSlotIdx' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetUpdateIconState, IsVisibleIcon) == 0x000004, "Member 'WB_QuestSlotList2_C_SetUpdateIconState::IsVisibleIcon' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetUpdateIconState, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_QuestSlotList2_C_SetUpdateIconState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetUpdateIconState, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'WB_QuestSlotList2_C_SetUpdateIconState::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.SetNewIconState
// 0x0018 (0x0018 - 0x0000)
struct WB_QuestSlotList2_C_SetNewIconState final
{
public:
	int32                                         InSlotIdx;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisibleIcon;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_SetNewIconState) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_SetNewIconState");
static_assert(sizeof(WB_QuestSlotList2_C_SetNewIconState) == 0x000018, "Wrong size on WB_QuestSlotList2_C_SetNewIconState");
static_assert(offsetof(WB_QuestSlotList2_C_SetNewIconState, InSlotIdx) == 0x000000, "Member 'WB_QuestSlotList2_C_SetNewIconState::InSlotIdx' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetNewIconState, IsVisibleIcon) == 0x000004, "Member 'WB_QuestSlotList2_C_SetNewIconState::IsVisibleIcon' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetNewIconState, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_QuestSlotList2_C_SetNewIconState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetNewIconState, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'WB_QuestSlotList2_C_SetNewIconState::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.Tick_FrameOut
// 0x0030 (0x0030 - 0x0000)
struct WB_QuestSlotList2_C_Tick_FrameOut final
{
public:
	int32                                         L_SlotIdx;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_844B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844C[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844D[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_Tick_FrameOut) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_Tick_FrameOut");
static_assert(sizeof(WB_QuestSlotList2_C_Tick_FrameOut) == 0x000030, "Wrong size on WB_QuestSlotList2_C_Tick_FrameOut");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, L_SlotIdx) == 0x000000, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000010, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000018, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000021, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, Temp_int_Variable) == 0x000024, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameOut, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00002C, "Member 'WB_QuestSlotList2_C_Tick_FrameOut::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.AlignIconAnimFrame
// 0x0050 (0x0050 - 0x0000)
struct WB_QuestSlotList2_C_AlignIconAnimFrame final
{
public:
	int32                                         L_SlotIdx;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayFrame_ReturnValue_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844E[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_844F[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8450[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_2;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_3;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_AlignIconAnimFrame) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_AlignIconAnimFrame");
static_assert(sizeof(WB_QuestSlotList2_C_AlignIconAnimFrame) == 0x000050, "Wrong size on WB_QuestSlotList2_C_AlignIconAnimFrame");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, L_SlotIdx) == 0x000000, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_GetPlayFrame_ReturnValue) == 0x000004, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_GetPlayFrame_ReturnValue_1) == 0x000008, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_GetPlayFrame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_Array_LastIndex_ReturnValue) == 0x000014, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, Temp_int_Variable) == 0x000028, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_IsVisible_ReturnValue) == 0x00002C, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00002D, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_Array_Get_Item_2) == 0x000038, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_Array_Get_Item_3) == 0x000040, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_AlignIconAnimFrame, CallFunc_IsVisible_ReturnValue_1) == 0x000048, "Member 'WB_QuestSlotList2_C_AlignIconAnimFrame::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.Tick_FrameIn
// 0x0048 (0x0048 - 0x0000)
struct WB_QuestSlotList2_C_Tick_FrameIn final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8451[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8452[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8453[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8454[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8455[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_QuestSlotList2_C_Tick_FrameIn) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_Tick_FrameIn");
static_assert(sizeof(WB_QuestSlotList2_C_Tick_FrameIn) == 0x000048, "Wrong size on WB_QuestSlotList2_C_Tick_FrameIn");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000010, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000018, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000034, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_FrameIn, Temp_int_Variable) == 0x000040, "Member 'WB_QuestSlotList2_C_Tick_FrameIn::Temp_int_Variable' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.Tick_Base
// 0x0001 (0x0001 - 0x0000)
struct WB_QuestSlotList2_C_Tick_Base final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_Tick_Base) == 0x000001, "Wrong alignment on WB_QuestSlotList2_C_Tick_Base");
static_assert(sizeof(WB_QuestSlotList2_C_Tick_Base) == 0x000001, "Wrong size on WB_QuestSlotList2_C_Tick_Base");
static_assert(offsetof(WB_QuestSlotList2_C_Tick_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WB_QuestSlotList2_C_Tick_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.SetAnimState
// 0x0050 (0x0050 - 0x0000)
struct WB_QuestSlotList2_C_SetAnimState final
{
public:
	E_CampQuest_SsAnimState                       InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotUpdateAnim;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8456[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_SlotIdx;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8457[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_2;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_3;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8458[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_SetAnimState) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_SetAnimState");
static_assert(sizeof(WB_QuestSlotList2_C_SetAnimState) == 0x000050, "Wrong size on WB_QuestSlotList2_C_SetAnimState");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, InState) == 0x000000, "Member 'WB_QuestSlotList2_C_SetAnimState::InState' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, NotUpdateAnim) == 0x000001, "Member 'WB_QuestSlotList2_C_SetAnimState::NotUpdateAnim' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, L_SlotIdx) == 0x000004, "Member 'WB_QuestSlotList2_C_SetAnimState::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000010, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000018, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001A, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, K2Node_SwitchEnum_CmpSuccess) == 0x00001B, "Member 'WB_QuestSlotList2_C_SetAnimState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, K2Node_SwitchEnum_CmpSuccess_1) == 0x00001C, "Member 'WB_QuestSlotList2_C_SetAnimState::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_2) == 0x000028, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_3) == 0x000030, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00003C, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, Temp_int_Variable) == 0x000040, "Member 'WB_QuestSlotList2_C_SetAnimState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_Array_LastIndex_ReturnValue) == 0x000048, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetAnimState, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00004C, "Member 'WB_QuestSlotList2_C_SetAnimState::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.CursorMove_Bottom
// 0x0020 (0x0020 - 0x0000)
struct WB_QuestSlotList2_C_CursorMove_Bottom final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8459[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_CursorMove_Bottom) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_CursorMove_Bottom");
static_assert(sizeof(WB_QuestSlotList2_C_CursorMove_Bottom) == 0x000020, "Wrong size on WB_QuestSlotList2_C_CursorMove_Bottom");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Bottom, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'WB_QuestSlotList2_C_CursorMove_Bottom::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Bottom, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_QuestSlotList2_C_CursorMove_Bottom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Bottom, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'WB_QuestSlotList2_C_CursorMove_Bottom::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Bottom, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_QuestSlotList2_C_CursorMove_Bottom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.CursorMove_Top
// 0x0018 (0x0018 - 0x0000)
struct WB_QuestSlotList2_C_CursorMove_Top final
{
public:
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_CursorMove_Top) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_CursorMove_Top");
static_assert(sizeof(WB_QuestSlotList2_C_CursorMove_Top) == 0x000018, "Wrong size on WB_QuestSlotList2_C_CursorMove_Top");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Top, CallFunc_Array_Get_Item) == 0x000000, "Member 'WB_QuestSlotList2_C_CursorMove_Top::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Top, CallFunc_Array_Get_Item_1) == 0x000008, "Member 'WB_QuestSlotList2_C_CursorMove_Top::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Top, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'WB_QuestSlotList2_C_CursorMove_Top::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.CursorMove_Down
// 0x0030 (0x0030 - 0x0000)
struct WB_QuestSlotList2_C_CursorMove_Down final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845B[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_845C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_CursorMove_Down) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_CursorMove_Down");
static_assert(sizeof(WB_QuestSlotList2_C_CursorMove_Down) == 0x000030, "Wrong size on WB_QuestSlotList2_C_CursorMove_Down");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Down, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WB_QuestSlotList2_C_CursorMove_Down::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Down, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_QuestSlotList2_C_CursorMove_Down::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Down, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_QuestSlotList2_C_CursorMove_Down::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Down, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WB_QuestSlotList2_C_CursorMove_Down::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Down, Temp_int_Variable) == 0x000010, "Member 'WB_QuestSlotList2_C_CursorMove_Down::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Down, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_QuestSlotList2_C_CursorMove_Down::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Down, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WB_QuestSlotList2_C_CursorMove_Down::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Down, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WB_QuestSlotList2_C_CursorMove_Down::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.CursorMove_Up
// 0x0028 (0x0028 - 0x0000)
struct WB_QuestSlotList2_C_CursorMove_Up final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845E[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_CursorMove_Up) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_CursorMove_Up");
static_assert(sizeof(WB_QuestSlotList2_C_CursorMove_Up) == 0x000028, "Wrong size on WB_QuestSlotList2_C_CursorMove_Up");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Up, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WB_QuestSlotList2_C_CursorMove_Up::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Up, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_QuestSlotList2_C_CursorMove_Up::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Up, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000008, "Member 'WB_QuestSlotList2_C_CursorMove_Up::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Up, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WB_QuestSlotList2_C_CursorMove_Up::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Up, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_QuestSlotList2_C_CursorMove_Up::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Up, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'WB_QuestSlotList2_C_CursorMove_Up::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_CursorMove_Up, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WB_QuestSlotList2_C_CursorMove_Up::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.SetCursorIndex
// 0x0030 (0x0030 - 0x0000)
struct WB_QuestSlotList2_C_SetCursorIndex final
{
public:
	int32                                         InSlotIdx;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8460[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCursorState_OnCursor;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_SetCursorIndex) == 0x000008, "Wrong alignment on WB_QuestSlotList2_C_SetCursorIndex");
static_assert(sizeof(WB_QuestSlotList2_C_SetCursorIndex) == 0x000030, "Wrong size on WB_QuestSlotList2_C_SetCursorIndex");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, InSlotIdx) == 0x000000, "Member 'WB_QuestSlotList2_C_SetCursorIndex::InSlotIdx' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, Temp_int_Variable) == 0x000010, "Member 'WB_QuestSlotList2_C_SetCursorIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_Array_LastIndex_ReturnValue) == 0x000014, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_GetCursorState_OnCursor) == 0x000029, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_GetCursorState_OnCursor' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_SetCursorIndex, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'WB_QuestSlotList2_C_SetCursorIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.GetCursorIndex
// 0x0008 (0x0008 - 0x0000)
struct WB_QuestSlotList2_C_GetCursorIndex final
{
public:
	int32                                         SlotIdx;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_QuestSlotList2_C_GetCursorIndex) == 0x000004, "Wrong alignment on WB_QuestSlotList2_C_GetCursorIndex");
static_assert(sizeof(WB_QuestSlotList2_C_GetCursorIndex) == 0x000008, "Wrong size on WB_QuestSlotList2_C_GetCursorIndex");
static_assert(offsetof(WB_QuestSlotList2_C_GetCursorIndex, SlotIdx) == 0x000000, "Member 'WB_QuestSlotList2_C_GetCursorIndex::SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_QuestSlotList2_C_GetCursorIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'WB_QuestSlotList2_C_GetCursorIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_QuestSlotList2.WB_QuestSlotList2_C.SetSlotListInfo
// 0x0098 (0x0098 - 0x0000)
struct WB_QuestSlotList2_C_SetSlotListInfo final
{
public:
	TArray<struct FCampQuestListData>             InListInfo;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         L_SlotIdx;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_QuestSlot2_C*                       CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
