#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuestSlot2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_CampQuest_SlotInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Project_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_QuestSlot2.WB_QuestSlot2_C
// 0x0078 (0x02D8 - 0x0260)
class UWB_QuestSlot2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonS5*                              Button_Slot;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageSimpleTextWidget*               MsgSimpleText_QuestName;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_NewIcon;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_QuestState;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_SlotBase;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_SlotCursor;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_UpdateIcon;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_NElementIcon_C*                     WB_QuestIcon;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FST_CampQuest_SlotInfo                 SlotInfo;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_OnCursor;                                    // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AF0[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_CampQuest_SlotInfo                 Debug_SlotInfo;                                    // 0x02B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimPlayRate;                                      // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Disp_Idx;                                          // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnCursor;                                          // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AF1[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnHoveredMouse;                                    // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void GetCursorState(bool* Param_OnCursor);
	void GetSlotInfo(struct FST_CampQuest_SlotInfo* Param_SlotInfo);
	void UpdateCursorAnim();
	void UpdateColor();
	void SetIconAnimFrame(float InAnimFrame, bool IsNewIcon, bool IsUpdateIcon);
	void GetUpdateIconAnimFrame(float* PlayFrame);
	void GetNewIconAnimFrame(float* PlayFrame);
	void GetSlotAssignAnim(class FName* AnimationName, bool* IsPlaying);
	void SetUpdateIconState(bool Param_IsVisible);
	void SetNewIconState(bool Param_IsVisible);
	void SetCursorState(bool Param_OnCursor);
	void SetSlotInfo(int32 InMsgID, E_MISSION_TYPE InQuestType, E_CAMP_QUEST_PROGRESS_STATE InQuestProgress, bool IsNewIcon, bool IsUpdateIcon);
	void PlayAnim_Out();
	void PlayAnim_Loop();
	void PlayAnim_In();
	void PlayAnim_Setup();
	void Init();
	void BndEvt__WB_QuestSlot2_Button_Slot_K2Node_ComponentBoundEvent_0_ButtonSimpleEventS5__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__WB_QuestSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void ExecuteUbergraph_WB_QuestSlot2(int32 EntryPoint);
	void OnHoveredMouse__DelegateSignature(int32 SlotIdx);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_QuestSlot2_C">();
	}
	static class UWB_QuestSlot2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_QuestSlot2_C>();
	}
};
static_assert(alignof(UWB_QuestSlot2_C) == 0x000008, "Wrong alignment on UWB_QuestSlot2_C");
static_assert(sizeof(UWB_QuestSlot2_C) == 0x0002D8, "Wrong size on UWB_QuestSlot2_C");
static_assert(offsetof(UWB_QuestSlot2_C, UberGraphFrame) == 0x000260, "Member 'UWB_QuestSlot2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, Button_Slot) == 0x000268, "Member 'UWB_QuestSlot2_C::Button_Slot' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, MsgSimpleText_QuestName) == 0x000270, "Member 'UWB_QuestSlot2_C::MsgSimpleText_QuestName' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, SsPlayer_NewIcon) == 0x000278, "Member 'UWB_QuestSlot2_C::SsPlayer_NewIcon' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, SsPlayer_QuestState) == 0x000280, "Member 'UWB_QuestSlot2_C::SsPlayer_QuestState' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, SsPlayer_SlotBase) == 0x000288, "Member 'UWB_QuestSlot2_C::SsPlayer_SlotBase' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, SsPlayer_SlotCursor) == 0x000290, "Member 'UWB_QuestSlot2_C::SsPlayer_SlotCursor' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, SsPlayer_UpdateIcon) == 0x000298, "Member 'UWB_QuestSlot2_C::SsPlayer_UpdateIcon' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, WB_QuestIcon) == 0x0002A0, "Member 'UWB_QuestSlot2_C::WB_QuestIcon' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, SlotInfo) == 0x0002A8, "Member 'UWB_QuestSlot2_C::SlotInfo' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, Debug_OnCursor) == 0x0002B0, "Member 'UWB_QuestSlot2_C::Debug_OnCursor' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, Debug_SlotInfo) == 0x0002B4, "Member 'UWB_QuestSlot2_C::Debug_SlotInfo' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, AnimPlayRate) == 0x0002BC, "Member 'UWB_QuestSlot2_C::AnimPlayRate' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, Disp_Idx) == 0x0002C0, "Member 'UWB_QuestSlot2_C::Disp_Idx' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, OnCursor) == 0x0002C4, "Member 'UWB_QuestSlot2_C::OnCursor' has a wrong offset!");
static_assert(offsetof(UWB_QuestSlot2_C, OnHoveredMouse) == 0x0002C8, "Member 'UWB_QuestSlot2_C::OnHoveredMouse' has a wrong offset!");

}

