#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Ryuketsu_FT

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_Ryuketsu_FT.WB_Ryuketsu_FT_C.ExecuteUbergraph_WB_Ryuketsu_FT
// 0x0090 (0x0090 - 0x0000)
struct WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEE3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_AnimPackName_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AnimationName_1;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimPackIndex_1;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimationIndex_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEE4[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEE5[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_AnimPackName;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AnimationName;                  // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimPackIndex;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimationIndex;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEE6[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec_1;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot_1;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT) == 0x000008, "Wrong alignment on WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT");
static_assert(sizeof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT) == 0x000090, "Wrong size on WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, EntryPoint) == 0x000000, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, CallFunc_Play_ReturnValue) == 0x000004, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CustomEvent_AnimPackName_1) == 0x000028, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CustomEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CustomEvent_AnimationName_1) == 0x000030, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CustomEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CustomEvent_AnimPackIndex_1) == 0x000038, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CustomEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CustomEvent_AnimationIndex_1) == 0x00003C, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CustomEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, CallFunc_Play_ReturnValue_1) == 0x000040, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, CallFunc_Play_ReturnValue_2) == 0x000041, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, CallFunc_Play_ReturnValue_3) == 0x000042, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000048, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CustomEvent_AnimPackName) == 0x000054, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CustomEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CustomEvent_AnimationName) == 0x00005C, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CustomEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CustomEvent_AnimPackIndex) == 0x000064, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CustomEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_CustomEvent_AnimationIndex) == 0x000068, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_CustomEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, CallFunc_Play_ReturnValue_4) == 0x00006C, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000070, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, CallFunc_GetSSPPositionDataByPartsName_OutVec_1) == 0x000078, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::CallFunc_GetSSPPositionDataByPartsName_OutVec_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_DynamicCast_AsCanvas_Panel_Slot_1) == 0x000080, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_DynamicCast_AsCanvas_Panel_Slot_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, CallFunc_Play_ReturnValue_5) == 0x000089, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT, K2Node_Event_IsDesignTime) == 0x00008A, "Member 'WB_Ryuketsu_FT_C_ExecuteUbergraph_WB_Ryuketsu_FT::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WB_Ryuketsu_FT.WB_Ryuketsu_FT_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Ryuketsu_FT_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Ryuketsu_FT_C_PreConstruct) == 0x000001, "Wrong alignment on WB_Ryuketsu_FT_C_PreConstruct");
static_assert(sizeof(WB_Ryuketsu_FT_C_PreConstruct) == 0x000001, "Wrong size on WB_Ryuketsu_FT_C_PreConstruct");
static_assert(offsetof(WB_Ryuketsu_FT_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_Ryuketsu_FT_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_Ryuketsu_FT.WB_Ryuketsu_FT_C._OnSSEndPlay2
// 0x0018 (0x0018 - 0x0000)
struct WB_Ryuketsu_FT_C__OnSSEndPlay2 final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Ryuketsu_FT_C__OnSSEndPlay2) == 0x000004, "Wrong alignment on WB_Ryuketsu_FT_C__OnSSEndPlay2");
static_assert(sizeof(WB_Ryuketsu_FT_C__OnSSEndPlay2) == 0x000018, "Wrong size on WB_Ryuketsu_FT_C__OnSSEndPlay2");
static_assert(offsetof(WB_Ryuketsu_FT_C__OnSSEndPlay2, AnimPackName) == 0x000000, "Member 'WB_Ryuketsu_FT_C__OnSSEndPlay2::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C__OnSSEndPlay2, AnimationName) == 0x000008, "Member 'WB_Ryuketsu_FT_C__OnSSEndPlay2::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C__OnSSEndPlay2, AnimPackIndex) == 0x000010, "Member 'WB_Ryuketsu_FT_C__OnSSEndPlay2::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C__OnSSEndPlay2, AnimationIndex) == 0x000014, "Member 'WB_Ryuketsu_FT_C__OnSSEndPlay2::AnimationIndex' has a wrong offset!");

// Function WB_Ryuketsu_FT.WB_Ryuketsu_FT_C._SsEndPlay
// 0x0018 (0x0018 - 0x0000)
struct WB_Ryuketsu_FT_C__SsEndPlay final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Ryuketsu_FT_C__SsEndPlay) == 0x000004, "Wrong alignment on WB_Ryuketsu_FT_C__SsEndPlay");
static_assert(sizeof(WB_Ryuketsu_FT_C__SsEndPlay) == 0x000018, "Wrong size on WB_Ryuketsu_FT_C__SsEndPlay");
static_assert(offsetof(WB_Ryuketsu_FT_C__SsEndPlay, AnimPackName) == 0x000000, "Member 'WB_Ryuketsu_FT_C__SsEndPlay::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C__SsEndPlay, AnimationName) == 0x000008, "Member 'WB_Ryuketsu_FT_C__SsEndPlay::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C__SsEndPlay, AnimPackIndex) == 0x000010, "Member 'WB_Ryuketsu_FT_C__SsEndPlay::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C__SsEndPlay, AnimationIndex) == 0x000014, "Member 'WB_Ryuketsu_FT_C__SsEndPlay::AnimationIndex' has a wrong offset!");

// Function WB_Ryuketsu_FT.WB_Ryuketsu_FT_C.CheckAnimFinish
// 0x0002 (0x0002 - 0x0000)
struct WB_Ryuketsu_FT_C_CheckAnimFinish final
{
public:
	bool                                          Finish;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Ryuketsu_FT_C_CheckAnimFinish) == 0x000001, "Wrong alignment on WB_Ryuketsu_FT_C_CheckAnimFinish");
static_assert(sizeof(WB_Ryuketsu_FT_C_CheckAnimFinish) == 0x000002, "Wrong size on WB_Ryuketsu_FT_C_CheckAnimFinish");
static_assert(offsetof(WB_Ryuketsu_FT_C_CheckAnimFinish, Finish) == 0x000000, "Member 'WB_Ryuketsu_FT_C_CheckAnimFinish::Finish' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_FT_C_CheckAnimFinish, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WB_Ryuketsu_FT_C_CheckAnimFinish::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

