#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Ryuketsu_FT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Ryuketsu_FT.WB_Ryuketsu_FT_C
// 0x0028 (0x0288 - 0x0260)
class UWB_Ryuketsu_FT_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           FastTravelPanel;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_title;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerWidget_TitlePos;                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsAnim;                                            // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_Ryuketsu_FT(int32 EntryPoint);
	void HideTitle();
	void PreConstruct(bool IsDesignTime);
	void ShowTitle();
	void Construct();
	void TitleSlideOut();
	void _OnSSEndPlay2(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void TitleSlideIn();
	void _SsEndPlay(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void CheckAnimFinish(bool* Finish);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Ryuketsu_FT_C">();
	}
	static class UWB_Ryuketsu_FT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Ryuketsu_FT_C>();
	}
};
static_assert(alignof(UWB_Ryuketsu_FT_C) == 0x000008, "Wrong alignment on UWB_Ryuketsu_FT_C");
static_assert(sizeof(UWB_Ryuketsu_FT_C) == 0x000288, "Wrong size on UWB_Ryuketsu_FT_C");
static_assert(offsetof(UWB_Ryuketsu_FT_C, UberGraphFrame) == 0x000260, "Member 'UWB_Ryuketsu_FT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Ryuketsu_FT_C, FastTravelPanel) == 0x000268, "Member 'UWB_Ryuketsu_FT_C::FastTravelPanel' has a wrong offset!");
static_assert(offsetof(UWB_Ryuketsu_FT_C, SsPlayerWidget_title) == 0x000270, "Member 'UWB_Ryuketsu_FT_C::SsPlayerWidget_title' has a wrong offset!");
static_assert(offsetof(UWB_Ryuketsu_FT_C, SsPlayerWidget_TitlePos) == 0x000278, "Member 'UWB_Ryuketsu_FT_C::SsPlayerWidget_TitlePos' has a wrong offset!");
static_assert(offsetof(UWB_Ryuketsu_FT_C, IsAnim) == 0x000280, "Member 'UWB_Ryuketsu_FT_C::IsAnim' has a wrong offset!");

}

