#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RyuketsuBase

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_RyuketsuBase.WB_RyuketsuBase_C
// 0x00D0 (0x0330 - 0x0260)
class UWB_RyuketsuBase_C final : public UUserWidget
{
public:
	FMulticastInlineDelegateProperty_             EvtDis_Exit;                                       // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EvtDis_Warp;                                       // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FRyuketsuData                          RyuketsuData;                                      // 0x0280(0x003C)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_97EA[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                TextMap;                                           // 0x02C0(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         RyuketsuID;                                        // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_97EB[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RyuketsuActor;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EvtDis_EnterGarden;                                // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EvtDis_Exit__DelegateSignature();
	void EvtDis_Warp__DelegateSignature(int32 Param_RyuketsuID);
	void EvtDis_EnterGarden__DelegateSignature();
	void TickFromComp(float DeltaSec);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_RyuketsuBase_C">();
	}
	static class UWB_RyuketsuBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_RyuketsuBase_C>();
	}
};
static_assert(alignof(UWB_RyuketsuBase_C) == 0x000008, "Wrong alignment on UWB_RyuketsuBase_C");
static_assert(sizeof(UWB_RyuketsuBase_C) == 0x000330, "Wrong size on UWB_RyuketsuBase_C");
static_assert(offsetof(UWB_RyuketsuBase_C, EvtDis_Exit) == 0x000260, "Member 'UWB_RyuketsuBase_C::EvtDis_Exit' has a wrong offset!");
static_assert(offsetof(UWB_RyuketsuBase_C, EvtDis_Warp) == 0x000270, "Member 'UWB_RyuketsuBase_C::EvtDis_Warp' has a wrong offset!");
static_assert(offsetof(UWB_RyuketsuBase_C, RyuketsuData) == 0x000280, "Member 'UWB_RyuketsuBase_C::RyuketsuData' has a wrong offset!");
static_assert(offsetof(UWB_RyuketsuBase_C, TextMap) == 0x0002C0, "Member 'UWB_RyuketsuBase_C::TextMap' has a wrong offset!");
static_assert(offsetof(UWB_RyuketsuBase_C, RyuketsuID) == 0x000310, "Member 'UWB_RyuketsuBase_C::RyuketsuID' has a wrong offset!");
static_assert(offsetof(UWB_RyuketsuBase_C, RyuketsuActor) == 0x000318, "Member 'UWB_RyuketsuBase_C::RyuketsuActor' has a wrong offset!");
static_assert(offsetof(UWB_RyuketsuBase_C, EvtDis_EnterGarden) == 0x000320, "Member 'UWB_RyuketsuBase_C::EvtDis_EnterGarden' has a wrong offset!");

}

