#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RyuketsuFirst

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_RyuketsuFirst.WB_RyuketsuFirst_C
// 0x0020 (0x0280 - 0x0260)
class UWB_RyuketsuFirst_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_First;                                        // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EvtDis_EndAnim;                                    // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EvtDis_EndAnim__DelegateSignature();
	void ExecuteUbergraph_WB_RyuketsuFirst(int32 EntryPoint);
	void Evt_EndAnim();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_RyuketsuFirst_C">();
	}
	static class UWB_RyuketsuFirst_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_RyuketsuFirst_C>();
	}
};
static_assert(alignof(UWB_RyuketsuFirst_C) == 0x000008, "Wrong alignment on UWB_RyuketsuFirst_C");
static_assert(sizeof(UWB_RyuketsuFirst_C) == 0x000280, "Wrong size on UWB_RyuketsuFirst_C");
static_assert(offsetof(UWB_RyuketsuFirst_C, UberGraphFrame) == 0x000260, "Member 'UWB_RyuketsuFirst_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_RyuketsuFirst_C, Anim_First) == 0x000268, "Member 'UWB_RyuketsuFirst_C::Anim_First' has a wrong offset!");
static_assert(offsetof(UWB_RyuketsuFirst_C, EvtDis_EndAnim) == 0x000270, "Member 'UWB_RyuketsuFirst_C::EvtDis_EndAnim' has a wrong offset!");

}

