#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RyuketsuFirst

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_RyuketsuFirst.WB_RyuketsuFirst_C.ExecuteUbergraph_WB_RyuketsuFirst
// 0x0020 (0x0020 - 0x0000)
struct WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_97E9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst) == 0x000008, "Wrong alignment on WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst");
static_assert(sizeof(WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst) == 0x000020, "Wrong size on WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst");
static_assert(offsetof(WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst, EntryPoint) == 0x000000, "Member 'WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WB_RyuketsuFirst_C_ExecuteUbergraph_WB_RyuketsuFirst::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

