#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Ryuketsu_Black

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Ryuketsu_Black.WB_Ryuketsu_Black_C
// 0x0020 (0x0280 - 0x0260)
class UWB_Ryuketsu_Black_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USsPlayerWidget*                        SsPlayerWidget_Black;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EvtDis_HideEnd;                                    // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EvtDis_HideEnd__DelegateSignature();
	void ExecuteUbergraph_WB_Ryuketsu_Black(int32 EntryPoint);
	void StartExec();
	void AnimIn();
	void _EndAnimOut(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void AnimOut();
	void _EndAnimIn(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Ryuketsu_Black_C">();
	}
	static class UWB_Ryuketsu_Black_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Ryuketsu_Black_C>();
	}
};
static_assert(alignof(UWB_Ryuketsu_Black_C) == 0x000008, "Wrong alignment on UWB_Ryuketsu_Black_C");
static_assert(sizeof(UWB_Ryuketsu_Black_C) == 0x000280, "Wrong size on UWB_Ryuketsu_Black_C");
static_assert(offsetof(UWB_Ryuketsu_Black_C, UberGraphFrame) == 0x000260, "Member 'UWB_Ryuketsu_Black_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Ryuketsu_Black_C, SsPlayerWidget_Black) == 0x000268, "Member 'UWB_Ryuketsu_Black_C::SsPlayerWidget_Black' has a wrong offset!");
static_assert(offsetof(UWB_Ryuketsu_Black_C, EvtDis_HideEnd) == 0x000270, "Member 'UWB_Ryuketsu_Black_C::EvtDis_HideEnd' has a wrong offset!");

}

