#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Ryuketsu_Black

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_Ryuketsu_Black.WB_Ryuketsu_Black_C.ExecuteUbergraph_WB_Ryuketsu_Black
// 0x005C (0x005C - 0x0000)
struct WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_AnimPackName_1;                 // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AnimationName_1;                // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimPackIndex_1;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimationIndex_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9595[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_AnimPackName;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_AnimationName;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimPackIndex;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimationIndex;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black) == 0x000004, "Wrong alignment on WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black");
static_assert(sizeof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black) == 0x00005C, "Wrong size on WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, EntryPoint) == 0x000000, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CustomEvent_AnimPackName_1) == 0x000024, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CustomEvent_AnimPackName_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CustomEvent_AnimationName_1) == 0x00002C, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CustomEvent_AnimationName_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CustomEvent_AnimPackIndex_1) == 0x000034, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CustomEvent_AnimPackIndex_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CustomEvent_AnimationIndex_1) == 0x000038, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CustomEvent_AnimationIndex_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, CallFunc_Play_ReturnValue) == 0x00003C, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, CallFunc_Play_ReturnValue_1) == 0x00003D, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, CallFunc_Play_ReturnValue_2) == 0x00003E, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CustomEvent_AnimPackName) == 0x000040, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CustomEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CustomEvent_AnimationName) == 0x000048, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CustomEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CustomEvent_AnimPackIndex) == 0x000050, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CustomEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, K2Node_CustomEvent_AnimationIndex) == 0x000054, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::K2Node_CustomEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, CallFunc_Play_ReturnValue_3) == 0x000058, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black, CallFunc_Play_ReturnValue_4) == 0x000059, "Member 'WB_Ryuketsu_Black_C_ExecuteUbergraph_WB_Ryuketsu_Black::CallFunc_Play_ReturnValue_4' has a wrong offset!");

// Function WB_Ryuketsu_Black.WB_Ryuketsu_Black_C._EndAnimOut
// 0x0018 (0x0018 - 0x0000)
struct WB_Ryuketsu_Black_C__EndAnimOut final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Ryuketsu_Black_C__EndAnimOut) == 0x000004, "Wrong alignment on WB_Ryuketsu_Black_C__EndAnimOut");
static_assert(sizeof(WB_Ryuketsu_Black_C__EndAnimOut) == 0x000018, "Wrong size on WB_Ryuketsu_Black_C__EndAnimOut");
static_assert(offsetof(WB_Ryuketsu_Black_C__EndAnimOut, AnimPackName) == 0x000000, "Member 'WB_Ryuketsu_Black_C__EndAnimOut::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C__EndAnimOut, AnimationName) == 0x000008, "Member 'WB_Ryuketsu_Black_C__EndAnimOut::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C__EndAnimOut, AnimPackIndex) == 0x000010, "Member 'WB_Ryuketsu_Black_C__EndAnimOut::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C__EndAnimOut, AnimationIndex) == 0x000014, "Member 'WB_Ryuketsu_Black_C__EndAnimOut::AnimationIndex' has a wrong offset!");

// Function WB_Ryuketsu_Black.WB_Ryuketsu_Black_C._EndAnimIn
// 0x0018 (0x0018 - 0x0000)
struct WB_Ryuketsu_Black_C__EndAnimIn final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Ryuketsu_Black_C__EndAnimIn) == 0x000004, "Wrong alignment on WB_Ryuketsu_Black_C__EndAnimIn");
static_assert(sizeof(WB_Ryuketsu_Black_C__EndAnimIn) == 0x000018, "Wrong size on WB_Ryuketsu_Black_C__EndAnimIn");
static_assert(offsetof(WB_Ryuketsu_Black_C__EndAnimIn, AnimPackName) == 0x000000, "Member 'WB_Ryuketsu_Black_C__EndAnimIn::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C__EndAnimIn, AnimationName) == 0x000008, "Member 'WB_Ryuketsu_Black_C__EndAnimIn::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C__EndAnimIn, AnimPackIndex) == 0x000010, "Member 'WB_Ryuketsu_Black_C__EndAnimIn::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_Ryuketsu_Black_C__EndAnimIn, AnimationIndex) == 0x000014, "Member 'WB_Ryuketsu_Black_C__EndAnimIn::AnimationIndex' has a wrong offset!");

}

