#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SampleSaveList

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_SampleSaveList.WB_SampleSaveList_C.ExecuteUbergraph_WB_SampleSaveList
// 0x0044 (0x0044 - 0x0000)
struct WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1261[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList) == 0x000004, "Wrong alignment on WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList");
static_assert(sizeof(WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList) == 0x000044, "Wrong size on WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList");
static_assert(offsetof(WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList, EntryPoint) == 0x000000, "Member 'WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000005, "Member 'WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList, K2Node_Event_MyGeometry) == 0x000008, "Member 'WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WB_SampleSaveList_C_ExecuteUbergraph_WB_SampleSaveList::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_SampleSaveList_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SampleSaveList_C_Tick) == 0x000004, "Wrong alignment on WB_SampleSaveList_C_Tick");
static_assert(sizeof(WB_SampleSaveList_C_Tick) == 0x00003C, "Wrong size on WB_SampleSaveList_C_Tick");
static_assert(offsetof(WB_SampleSaveList_C_Tick, MyGeometry) == 0x000000, "Member 'WB_SampleSaveList_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_SampleSaveList_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.InitUI
// 0x00C0 (0x00C0 - 0x0000)
struct WB_SampleSaveList_C_InitUI final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1262[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_SampleSaveItem_C*                   CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1263[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_SampleSaveItem_C*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1264[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSaveLoadHeaderData                    CallFunc_Array_Get_Item_1;                         // 0x0048(0x0070)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveList_C_InitUI) == 0x000008, "Wrong alignment on WB_SampleSaveList_C_InitUI");
static_assert(sizeof(WB_SampleSaveList_C_InitUI) == 0x0000C0, "Wrong size on WB_SampleSaveList_C_InitUI");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_SampleSaveList_C_InitUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WB_SampleSaveList_C_InitUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_GetDesiredSize_ReturnValue) == 0x000020, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_BreakVector2D_X) == 0x00002C, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitUI, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'WB_SampleSaveList_C_InitUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.InitCursor
// 0x0170 (0x0170 - 0x0000)
struct WB_SampleSaveList_C_InitCursor final
{
public:
	struct FSaveLoadHeaderData                    TmpCurrentHeader;                                  // 0x0000(0x0070)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1265[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSaveLoadHeaderData                    CallFunc_Array_Get_Item;                           // 0x0080(0x0070)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_DateTimeDateTime_ReturnValue;     // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1266[0x2];                                     // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSaveLoadHeaderData                    CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0070)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveList_C_InitCursor) == 0x000008, "Wrong alignment on WB_SampleSaveList_C_InitCursor");
static_assert(sizeof(WB_SampleSaveList_C_InitCursor) == 0x000170, "Wrong size on WB_SampleSaveList_C_InitCursor");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, TmpCurrentHeader) == 0x000000, "Member 'WB_SampleSaveList_C_InitCursor::TmpCurrentHeader' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, Temp_int_Array_Index_Variable) == 0x000070, "Member 'WB_SampleSaveList_C_InitCursor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'WB_SampleSaveList_C_InitCursor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'WB_SampleSaveList_C_InitCursor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, CallFunc_Array_Get_Item) == 0x000080, "Member 'WB_SampleSaveList_C_InitCursor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'WB_SampleSaveList_C_InitCursor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F4, "Member 'WB_SampleSaveList_C_InitCursor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, CallFunc_Greater_DateTimeDateTime_ReturnValue) == 0x0000F5, "Member 'WB_SampleSaveList_C_InitCursor::CallFunc_Greater_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'WB_SampleSaveList_C_InitCursor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, CallFunc_Array_Length_ReturnValue_1) == 0x000168, "Member 'WB_SampleSaveList_C_InitCursor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitCursor, CallFunc_Less_IntInt_ReturnValue) == 0x00016C, "Member 'WB_SampleSaveList_C_InitCursor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.InitArray
// 0x0028 (0x0028 - 0x0000)
struct WB_SampleSaveList_C_InitArray final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1267[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSaveLoadHeaderData>            CallFunc_GetSaveLoadHeaderDataArray_ReturnValue;   // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveList_C_InitArray) == 0x000008, "Wrong alignment on WB_SampleSaveList_C_InitArray");
static_assert(sizeof(WB_SampleSaveList_C_InitArray) == 0x000028, "Wrong size on WB_SampleSaveList_C_InitArray");
static_assert(offsetof(WB_SampleSaveList_C_InitArray, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_SampleSaveList_C_InitArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitArray, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_SampleSaveList_C_InitArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitArray, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_SampleSaveList_C_InitArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitArray, CallFunc_GetSaveLoadHeaderDataArray_ReturnValue) == 0x000010, "Member 'WB_SampleSaveList_C_InitArray::CallFunc_GetSaveLoadHeaderDataArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitArray, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WB_SampleSaveList_C_InitArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_InitArray, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WB_SampleSaveList_C_InitArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.MoveCursor
// 0x0002 (0x0002 - 0x0000)
struct WB_SampleSaveList_C_MoveCursor final
{
public:
	bool                                          Up;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Down;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveList_C_MoveCursor) == 0x000001, "Wrong alignment on WB_SampleSaveList_C_MoveCursor");
static_assert(sizeof(WB_SampleSaveList_C_MoveCursor) == 0x000002, "Wrong size on WB_SampleSaveList_C_MoveCursor");
static_assert(offsetof(WB_SampleSaveList_C_MoveCursor, Up) == 0x000000, "Member 'WB_SampleSaveList_C_MoveCursor::Up' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_MoveCursor, Down) == 0x000001, "Member 'WB_SampleSaveList_C_MoveCursor::Down' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.UpdateCursor
// 0x0020 (0x0020 - 0x0000)
struct WB_SampleSaveList_C_UpdateCursor final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_SampleSaveItem_C*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveList_C_UpdateCursor) == 0x000008, "Wrong alignment on WB_SampleSaveList_C_UpdateCursor");
static_assert(sizeof(WB_SampleSaveList_C_UpdateCursor) == 0x000020, "Wrong size on WB_SampleSaveList_C_UpdateCursor");
static_assert(offsetof(WB_SampleSaveList_C_UpdateCursor, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_SampleSaveList_C_UpdateCursor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpdateCursor, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_SampleSaveList_C_UpdateCursor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpdateCursor, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_SampleSaveList_C_UpdateCursor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpdateCursor, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WB_SampleSaveList_C_UpdateCursor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpdateCursor, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_SampleSaveList_C_UpdateCursor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpdateCursor, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_SampleSaveList_C_UpdateCursor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.UpCursor
// 0x0018 (0x0018 - 0x0000)
struct WB_SampleSaveList_C_UpCursor final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveList_C_UpCursor) == 0x000004, "Wrong alignment on WB_SampleSaveList_C_UpCursor");
static_assert(sizeof(WB_SampleSaveList_C_UpCursor) == 0x000018, "Wrong size on WB_SampleSaveList_C_UpCursor");
static_assert(offsetof(WB_SampleSaveList_C_UpCursor, Temp_int_Variable) == 0x000000, "Member 'WB_SampleSaveList_C_UpCursor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpCursor, Temp_int_Variable_1) == 0x000004, "Member 'WB_SampleSaveList_C_UpCursor::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpCursor, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WB_SampleSaveList_C_UpCursor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpCursor, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WB_SampleSaveList_C_UpCursor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpCursor, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000010, "Member 'WB_SampleSaveList_C_UpCursor::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpCursor, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'WB_SampleSaveList_C_UpCursor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.DownCursor
// 0x0010 (0x0010 - 0x0000)
struct WB_SampleSaveList_C_DownCursor final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1268[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SampleSaveList_C_DownCursor) == 0x000004, "Wrong alignment on WB_SampleSaveList_C_DownCursor");
static_assert(sizeof(WB_SampleSaveList_C_DownCursor) == 0x000010, "Wrong size on WB_SampleSaveList_C_DownCursor");
static_assert(offsetof(WB_SampleSaveList_C_DownCursor, Temp_int_Variable) == 0x000000, "Member 'WB_SampleSaveList_C_DownCursor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_DownCursor, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WB_SampleSaveList_C_DownCursor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_DownCursor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_SampleSaveList_C_DownCursor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_DownCursor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_SampleSaveList_C_DownCursor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveList.WB_SampleSaveList_C.UpdateScrollBox
// 0x0038 (0x0038 - 0x0000)
struct WB_SampleSaveList_C_UpdateScrollBox final
{
public:
	int32                                         Tmp;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveList_C_UpdateScrollBox) == 0x000004, "Wrong alignment on WB_SampleSaveList_C_UpdateScrollBox");
static_assert(sizeof(WB_SampleSaveList_C_UpdateScrollBox) == 0x000038, "Wrong size on WB_SampleSaveList_C_UpdateScrollBox");
static_assert(offsetof(WB_SampleSaveList_C_UpdateScrollBox, Tmp) == 0x000000, "Member 'WB_SampleSaveList_C_UpdateScrollBox::Tmp' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpdateScrollBox, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000004, "Member 'WB_SampleSaveList_C_UpdateScrollBox::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveList_C_UpdateScrollBox, CallFunc_GetScrollOffset_ReturnValue) == 0x000008, "Member 'WB_SampleSaveList_C_UpdateScrollBox::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
