#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillSearchSort

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_SkillSearchSort.WB_SkillSearchSort_C.ExecuteUbergraph_WB_SkillSearchSort
// 0x0008 (0x0008 - 0x0000)
struct WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort) == 0x000004, "Wrong alignment on WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort");
static_assert(sizeof(WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort) == 0x000008, "Wrong size on WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort");
static_assert(offsetof(WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort, EntryPoint) == 0x000000, "Member 'WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_SkillSearchSort_C_ExecuteUbergraph_WB_SkillSearchSort::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WB_SkillSearchSort.WB_SkillSearchSort_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_SkillSearchSort_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SkillSearchSort_C_PreConstruct) == 0x000001, "Wrong alignment on WB_SkillSearchSort_C_PreConstruct");
static_assert(sizeof(WB_SkillSearchSort_C_PreConstruct) == 0x000001, "Wrong size on WB_SkillSearchSort_C_PreConstruct");
static_assert(offsetof(WB_SkillSearchSort_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_SkillSearchSort_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_SkillSearchSort.WB_SkillSearchSort_C.Init
// 0x0010 (0x0010 - 0x0000)
struct WB_SkillSearchSort_C_Init final
{
public:
	struct FVector2D                              CallFunc_GetElementCategoryPos_OutVec;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SkillSearchSort_C_Init) == 0x000008, "Wrong alignment on WB_SkillSearchSort_C_Init");
static_assert(sizeof(WB_SkillSearchSort_C_Init) == 0x000010, "Wrong size on WB_SkillSearchSort_C_Init");
static_assert(offsetof(WB_SkillSearchSort_C_Init, CallFunc_GetElementCategoryPos_OutVec) == 0x000000, "Member 'WB_SkillSearchSort_C_Init::CallFunc_GetElementCategoryPos_OutVec' has a wrong offset!");
static_assert(offsetof(WB_SkillSearchSort_C_Init, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WB_SkillSearchSort_C_Init::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WB_SkillSearchSort.WB_SkillSearchSort_C.GetCategoryWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_SkillSearchSort_C_GetCategoryWidget final
{
public:
	class UWB_ElementCategory_C*                  CategoryWidget;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SkillSearchSort_C_GetCategoryWidget) == 0x000008, "Wrong alignment on WB_SkillSearchSort_C_GetCategoryWidget");
static_assert(sizeof(WB_SkillSearchSort_C_GetCategoryWidget) == 0x000008, "Wrong size on WB_SkillSearchSort_C_GetCategoryWidget");
static_assert(offsetof(WB_SkillSearchSort_C_GetCategoryWidget, CategoryWidget) == 0x000000, "Member 'WB_SkillSearchSort_C_GetCategoryWidget::CategoryWidget' has a wrong offset!");

// Function WB_SkillSearchSort.WB_SkillSearchSort_C.GetSortWindowWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_SkillSearchSort_C_GetSortWindowWidget final
{
public:
	class UWB_SortWindow2_C*                      SortWindowWidget;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SkillSearchSort_C_GetSortWindowWidget) == 0x000008, "Wrong alignment on WB_SkillSearchSort_C_GetSortWindowWidget");
static_assert(sizeof(WB_SkillSearchSort_C_GetSortWindowWidget) == 0x000008, "Wrong size on WB_SkillSearchSort_C_GetSortWindowWidget");
static_assert(offsetof(WB_SkillSearchSort_C_GetSortWindowWidget, SortWindowWidget) == 0x000000, "Member 'WB_SkillSearchSort_C_GetSortWindowWidget::SortWindowWidget' has a wrong offset!");

}

