#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SortWindow_Slot2

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.MouseEvent_OnHovered__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_SortWindow_Slot2_C_MouseEvent_OnHovered__DelegateSignature final
{
public:
	int32                                         SlotIdx;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SortWindow_Slot2_C_MouseEvent_OnHovered__DelegateSignature) == 0x000004, "Wrong alignment on WB_SortWindow_Slot2_C_MouseEvent_OnHovered__DelegateSignature");
static_assert(sizeof(WB_SortWindow_Slot2_C_MouseEvent_OnHovered__DelegateSignature) == 0x000004, "Wrong size on WB_SortWindow_Slot2_C_MouseEvent_OnHovered__DelegateSignature");
static_assert(offsetof(WB_SortWindow_Slot2_C_MouseEvent_OnHovered__DelegateSignature, SlotIdx) == 0x000000, "Member 'WB_SortWindow_Slot2_C_MouseEvent_OnHovered__DelegateSignature::SlotIdx' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.MouseEvent_OnClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_SortWindow_Slot2_C_MouseEvent_OnClicked__DelegateSignature final
{
public:
	int32                                         SlotIdx;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SortWindow_Slot2_C_MouseEvent_OnClicked__DelegateSignature) == 0x000004, "Wrong alignment on WB_SortWindow_Slot2_C_MouseEvent_OnClicked__DelegateSignature");
static_assert(sizeof(WB_SortWindow_Slot2_C_MouseEvent_OnClicked__DelegateSignature) == 0x000004, "Wrong size on WB_SortWindow_Slot2_C_MouseEvent_OnClicked__DelegateSignature");
static_assert(offsetof(WB_SortWindow_Slot2_C_MouseEvent_OnClicked__DelegateSignature, SlotIdx) == 0x000000, "Member 'WB_SortWindow_Slot2_C_MouseEvent_OnClicked__DelegateSignature::SlotIdx' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.ExecuteUbergraph_WB_SortWindow_Slot2
// 0x0034 (0x0034 - 0x0000)
struct WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C6[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2) == 0x000004, "Wrong alignment on WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2");
static_assert(sizeof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2) == 0x000034, "Wrong size on WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, EntryPoint) == 0x000000, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, K2Node_ComponentBoundEvent_AnimPackName) == 0x000008, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, K2Node_ComponentBoundEvent_AnimationName) == 0x000010, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000018, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, K2Node_ComponentBoundEvent_AnimationIndex) == 0x00001C, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, K2Node_ComponentBoundEvent_Pos) == 0x000024, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2, K2Node_ComponentBoundEvent_UV) == 0x00002C, "Member 'WB_SortWindow_Slot2_C_ExecuteUbergraph_WB_SortWindow_Slot2::K2Node_ComponentBoundEvent_UV' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_SortWindow_Slot2_C_BndEvt__WB_SortWindow_Slot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_SortWindow_Slot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_SortWindow_Slot2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_PreConstruct) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_PreConstruct");
static_assert(sizeof(WB_SortWindow_Slot2_C_PreConstruct) == 0x000001, "Wrong size on WB_SortWindow_Slot2_C_PreConstruct");
static_assert(offsetof(WB_SortWindow_Slot2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_SortWindow_Slot2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.PlayAnim_Setup
// 0x0001 (0x0001 - 0x0000)
struct WB_SortWindow_Slot2_C_PlayAnim_Setup final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_PlayAnim_Setup) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_PlayAnim_Setup");
static_assert(sizeof(WB_SortWindow_Slot2_C_PlayAnim_Setup) == 0x000001, "Wrong size on WB_SortWindow_Slot2_C_PlayAnim_Setup");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_Setup, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_SortWindow_Slot2_C_PlayAnim_Setup::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.PlayAnim_In
// 0x0003 (0x0003 - 0x0000)
struct WB_SortWindow_Slot2_C_PlayAnim_In final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_PlayAnim_In) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_PlayAnim_In");
static_assert(sizeof(WB_SortWindow_Slot2_C_PlayAnim_In) == 0x000003, "Wrong size on WB_SortWindow_Slot2_C_PlayAnim_In");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_In, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_SortWindow_Slot2_C_PlayAnim_In::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_In, CallFunc_Play_ReturnValue_1) == 0x000001, "Member 'WB_SortWindow_Slot2_C_PlayAnim_In::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_In, CallFunc_Play_ReturnValue_2) == 0x000002, "Member 'WB_SortWindow_Slot2_C_PlayAnim_In::CallFunc_Play_ReturnValue_2' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.PlayAnim_Loop
// 0x0003 (0x0003 - 0x0000)
struct WB_SortWindow_Slot2_C_PlayAnim_Loop final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_PlayAnim_Loop) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_PlayAnim_Loop");
static_assert(sizeof(WB_SortWindow_Slot2_C_PlayAnim_Loop) == 0x000003, "Wrong size on WB_SortWindow_Slot2_C_PlayAnim_Loop");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_Loop, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_SortWindow_Slot2_C_PlayAnim_Loop::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_Loop, CallFunc_Play_ReturnValue_1) == 0x000001, "Member 'WB_SortWindow_Slot2_C_PlayAnim_Loop::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_Loop, CallFunc_Play_ReturnValue_2) == 0x000002, "Member 'WB_SortWindow_Slot2_C_PlayAnim_Loop::CallFunc_Play_ReturnValue_2' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.PlayAnim_Out
// 0x0003 (0x0003 - 0x0000)
struct WB_SortWindow_Slot2_C_PlayAnim_Out final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_PlayAnim_Out) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_PlayAnim_Out");
static_assert(sizeof(WB_SortWindow_Slot2_C_PlayAnim_Out) == 0x000003, "Wrong size on WB_SortWindow_Slot2_C_PlayAnim_Out");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_Out, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_SortWindow_Slot2_C_PlayAnim_Out::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_Out, CallFunc_Play_ReturnValue_1) == 0x000001, "Member 'WB_SortWindow_Slot2_C_PlayAnim_Out::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_PlayAnim_Out, CallFunc_Play_ReturnValue_2) == 0x000002, "Member 'WB_SortWindow_Slot2_C_PlayAnim_Out::CallFunc_Play_ReturnValue_2' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.UpdateSlotAnim
// 0x00F8 (0x00F8 - 0x0000)
struct WB_SortWindow_Slot2_C_UpdateSlotAnim final
{
public:
	float                                         L_AnimPlayFrame;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 L_AnimCategory;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C8[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0070(0x0028)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C9[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CA[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00D0(0x0028)()
};
static_assert(alignof(WB_SortWindow_Slot2_C_UpdateSlotAnim) == 0x000008, "Wrong alignment on WB_SortWindow_Slot2_C_UpdateSlotAnim");
static_assert(sizeof(WB_SortWindow_Slot2_C_UpdateSlotAnim) == 0x0000F8, "Wrong size on WB_SortWindow_Slot2_C_UpdateSlotAnim");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, L_AnimPlayFrame) == 0x000000, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::L_AnimPlayFrame' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, L_AnimCategory) == 0x000008, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::L_AnimCategory' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Conv_StringToName_ReturnValue) == 0x000050, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Play_ReturnValue) == 0x000058, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, K2Node_MakeStruct_SlateColor_1) == 0x000070, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000098, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Play_ReturnValue_1) == 0x0000A0, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_GetPlayFrame_ReturnValue) == 0x0000A4, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Conv_StringToName_ReturnValue_2) == 0x0000B8, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_GetSlotAssignAnim_AnimationName) == 0x0000C0, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x0000C8, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, CallFunc_Play_ReturnValue_2) == 0x0000C9, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, K2Node_SwitchName_CmpSuccess) == 0x0000CA, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateSlotAnim, K2Node_MakeStruct_SlateColor_2) == 0x0000D0, "Member 'WB_SortWindow_Slot2_C_UpdateSlotAnim::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.UpdateCursorAnim
// 0x0034 (0x0034 - 0x0000)
struct WB_SortWindow_Slot2_C_UpdateCursorAnim final
{
public:
	int32                                         L_LoopCnt;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   L_AnimName;                                        // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CB[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CC[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_UpdateCursorAnim) == 0x000004, "Wrong alignment on WB_SortWindow_Slot2_C_UpdateCursorAnim");
static_assert(sizeof(WB_SortWindow_Slot2_C_UpdateCursorAnim) == 0x000034, "Wrong size on WB_SortWindow_Slot2_C_UpdateCursorAnim");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, L_LoopCnt) == 0x000000, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::L_LoopCnt' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, L_AnimName) == 0x000004, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::L_AnimName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_GetPlayFrame_ReturnValue) == 0x00000C, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_Play_ReturnValue) == 0x000010, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_IsPlaying_ReturnValue) == 0x000011, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x000014, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x00001C, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000024, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000028, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000030, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_UpdateCursorAnim, K2Node_SwitchName_CmpSuccess) == 0x000031, "Member 'WB_SortWindow_Slot2_C_UpdateCursorAnim::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.SetTextInfo
// 0x0018 (0x0018 - 0x0000)
struct WB_SortWindow_Slot2_C_SetTextInfo final
{
public:
	class FText                                   InItemText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WB_SortWindow_Slot2_C_SetTextInfo) == 0x000008, "Wrong alignment on WB_SortWindow_Slot2_C_SetTextInfo");
static_assert(sizeof(WB_SortWindow_Slot2_C_SetTextInfo) == 0x000018, "Wrong size on WB_SortWindow_Slot2_C_SetTextInfo");
static_assert(offsetof(WB_SortWindow_Slot2_C_SetTextInfo, InItemText) == 0x000000, "Member 'WB_SortWindow_Slot2_C_SetTextInfo::InItemText' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.SetCursorState
// 0x0001 (0x0001 - 0x0000)
struct WB_SortWindow_Slot2_C_SetCursorState final
{
public:
	bool                                          Param_OnCursor;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_SetCursorState) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_SetCursorState");
static_assert(sizeof(WB_SortWindow_Slot2_C_SetCursorState) == 0x000001, "Wrong size on WB_SortWindow_Slot2_C_SetCursorState");
static_assert(offsetof(WB_SortWindow_Slot2_C_SetCursorState, Param_OnCursor) == 0x000000, "Member 'WB_SortWindow_Slot2_C_SetCursorState::Param_OnCursor' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.GetSlotAssignAnim
// 0x0020 (0x0020 - 0x0000)
struct WB_SortWindow_Slot2_C_GetSlotAssignAnim final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaying;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CD[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_GetSlotAssignAnim) == 0x000004, "Wrong alignment on WB_SortWindow_Slot2_C_GetSlotAssignAnim");
static_assert(sizeof(WB_SortWindow_Slot2_C_GetSlotAssignAnim) == 0x000020, "Wrong size on WB_SortWindow_Slot2_C_GetSlotAssignAnim");
static_assert(offsetof(WB_SortWindow_Slot2_C_GetSlotAssignAnim, AnimationName) == 0x000000, "Member 'WB_SortWindow_Slot2_C_GetSlotAssignAnim::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_GetSlotAssignAnim, IsPlaying) == 0x000008, "Member 'WB_SortWindow_Slot2_C_GetSlotAssignAnim::IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_GetSlotAssignAnim, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x00000C, "Member 'WB_SortWindow_Slot2_C_GetSlotAssignAnim::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_GetSlotAssignAnim, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000014, "Member 'WB_SortWindow_Slot2_C_GetSlotAssignAnim::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_GetSlotAssignAnim, CallFunc_IsPlaying_ReturnValue) == 0x00001C, "Member 'WB_SortWindow_Slot2_C_GetSlotAssignAnim::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.SetAppliedState
// 0x0001 (0x0001 - 0x0000)
struct WB_SortWindow_Slot2_C_SetAppliedState final
{
public:
	bool                                          Param_IsApplied;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_SetAppliedState) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_SetAppliedState");
static_assert(sizeof(WB_SortWindow_Slot2_C_SetAppliedState) == 0x000001, "Wrong size on WB_SortWindow_Slot2_C_SetAppliedState");
static_assert(offsetof(WB_SortWindow_Slot2_C_SetAppliedState, Param_IsApplied) == 0x000000, "Member 'WB_SortWindow_Slot2_C_SetAppliedState::Param_IsApplied' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.GetCursorState
// 0x0001 (0x0001 - 0x0000)
struct WB_SortWindow_Slot2_C_GetCursorState final
{
public:
	bool                                          Param_OnCursor;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_GetCursorState) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_GetCursorState");
static_assert(sizeof(WB_SortWindow_Slot2_C_GetCursorState) == 0x000001, "Wrong size on WB_SortWindow_Slot2_C_GetCursorState");
static_assert(offsetof(WB_SortWindow_Slot2_C_GetCursorState, Param_OnCursor) == 0x000000, "Member 'WB_SortWindow_Slot2_C_GetCursorState::Param_OnCursor' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.GetAppliedState
// 0x0001 (0x0001 - 0x0000)
struct WB_SortWindow_Slot2_C_GetAppliedState final
{
public:
	bool                                          Param_IsApplied;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SortWindow_Slot2_C_GetAppliedState) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_GetAppliedState");
static_assert(sizeof(WB_SortWindow_Slot2_C_GetAppliedState) == 0x000001, "Wrong size on WB_SortWindow_Slot2_C_GetAppliedState");
static_assert(offsetof(WB_SortWindow_Slot2_C_GetAppliedState, Param_IsApplied) == 0x000000, "Member 'WB_SortWindow_Slot2_C_GetAppliedState::Param_IsApplied' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.SetAnimPlayRate
// 0x0004 (0x0004 - 0x0000)
struct WB_SortWindow_Slot2_C_SetAnimPlayRate final
{
public:
	float                                         InAnimPlayRate;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SortWindow_Slot2_C_SetAnimPlayRate) == 0x000004, "Wrong alignment on WB_SortWindow_Slot2_C_SetAnimPlayRate");
static_assert(sizeof(WB_SortWindow_Slot2_C_SetAnimPlayRate) == 0x000004, "Wrong size on WB_SortWindow_Slot2_C_SetAnimPlayRate");
static_assert(offsetof(WB_SortWindow_Slot2_C_SetAnimPlayRate, InAnimPlayRate) == 0x000000, "Member 'WB_SortWindow_Slot2_C_SetAnimPlayRate::InAnimPlayRate' has a wrong offset!");

// Function WB_SortWindow_Slot2.WB_SortWindow_Slot2_C.SetMouseHitVisibility
// 0x0005 (0x0005 - 0x0000)
struct WB_SortWindow_Slot2_C_SetMouseHitVisibility final
{
public:
	bool                                          EnableMouseHit;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_SortWindow_Slot2_C_SetMouseHitVisibility) == 0x000001, "Wrong alignment on WB_SortWindow_Slot2_C_SetMouseHitVisibility");
static_assert(sizeof(WB_SortWindow_Slot2_C_SetMouseHitVisibility) == 0x000005, "Wrong size on WB_SortWindow_Slot2_C_SetMouseHitVisibility");
static_assert(offsetof(WB_SortWindow_Slot2_C_SetMouseHitVisibility, EnableMouseHit) == 0x000000, "Member 'WB_SortWindow_Slot2_C_SetMouseHitVisibility::EnableMouseHit' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_SetMouseHitVisibility, Temp_bool_Variable) == 0x000001, "Member 'WB_SortWindow_Slot2_C_SetMouseHitVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_SortWindow_Slot2_C_SetMouseHitVisibility, Temp_byte_Variable) == 0x000002, "Member 'WB_SortWindow_Slot2_C_SetMouseHitVisibility::Temp_byte_Variable' has a wrong offset!");
