#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SampleSaveItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_SampleSaveItem.WB_SampleSaveItem_C.Get_PlayerName_Text_0
// 0x0038 (0x0038 - 0x0000)
struct WB_SampleSaveItem_C_Get_PlayerName_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CADB[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(WB_SampleSaveItem_C_Get_PlayerName_Text_0) == 0x000008, "Wrong alignment on WB_SampleSaveItem_C_Get_PlayerName_Text_0");
static_assert(sizeof(WB_SampleSaveItem_C_Get_PlayerName_Text_0) == 0x000038, "Wrong size on WB_SampleSaveItem_C_Get_PlayerName_Text_0");
static_assert(offsetof(WB_SampleSaveItem_C_Get_PlayerName_Text_0, ReturnValue) == 0x000000, "Member 'WB_SampleSaveItem_C_Get_PlayerName_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_PlayerName_Text_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_SampleSaveItem_C_Get_PlayerName_Text_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_PlayerName_Text_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WB_SampleSaveItem_C_Get_PlayerName_Text_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveItem.WB_SampleSaveItem_C.Get_SaveType_Text_0
// 0x0038 (0x0038 - 0x0000)
struct WB_SampleSaveItem_C_Get_SaveType_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   SaveTypeName;                                      // 0x0018(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveItem_C_Get_SaveType_Text_0) == 0x000008, "Wrong alignment on WB_SampleSaveItem_C_Get_SaveType_Text_0");
static_assert(sizeof(WB_SampleSaveItem_C_Get_SaveType_Text_0) == 0x000038, "Wrong size on WB_SampleSaveItem_C_Get_SaveType_Text_0");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveType_Text_0, ReturnValue) == 0x000000, "Member 'WB_SampleSaveItem_C_Get_SaveType_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveType_Text_0, SaveTypeName) == 0x000018, "Member 'WB_SampleSaveItem_C_Get_SaveType_Text_0::SaveTypeName' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveType_Text_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'WB_SampleSaveItem_C_Get_SaveType_Text_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveType_Text_0, K2Node_SwitchInteger_CmpSuccess) == 0x000031, "Member 'WB_SampleSaveItem_C_Get_SaveType_Text_0::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_SampleSaveItem.WB_SampleSaveItem_C.Get_SaveSlotIndex_Text_0
// 0x0038 (0x0038 - 0x0000)
struct WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CADC[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0) == 0x000008, "Wrong alignment on WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0");
static_assert(sizeof(WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0) == 0x000038, "Wrong size on WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0, ReturnValue) == 0x000000, "Member 'WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WB_SampleSaveItem_C_Get_SaveSlotIndex_Text_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveItem.WB_SampleSaveItem_C.Get_SaveDebugValue_Text_0
// 0x0038 (0x0038 - 0x0000)
struct WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CADD[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0) == 0x000008, "Wrong alignment on WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0");
static_assert(sizeof(WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0) == 0x000038, "Wrong size on WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0, ReturnValue) == 0x000000, "Member 'WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WB_SampleSaveItem_C_Get_SaveDebugValue_Text_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveItem.WB_SampleSaveItem_C.Get_SaveTime_Text_0
// 0x0150 (0x0150 - 0x0000)
struct WB_SampleSaveItem_C_Get_SaveTime_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CADE[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
};
static_assert(alignof(WB_SampleSaveItem_C_Get_SaveTime_Text_0) == 0x000008, "Wrong alignment on WB_SampleSaveItem_C_Get_SaveTime_Text_0");
static_assert(sizeof(WB_SampleSaveItem_C_Get_SaveTime_Text_0) == 0x000150, "Wrong size on WB_SampleSaveItem_C_Get_SaveTime_Text_0");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, ReturnValue) == 0x000000, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_BreakDateTime_Year) == 0x00001C, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_BreakDateTime_Month) == 0x000020, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_BreakDateTime_Day) == 0x000024, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_BreakDateTime_Hour) == 0x000028, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_BreakDateTime_Minute) == 0x00002C, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_BreakDateTime_Second) == 0x000030, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_BreakDateTime_Millisecond) == 0x000034, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000048, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000058, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000068, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000078, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Conv_IntToString_ReturnValue_5) == 0x000088, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A8, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B8, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000C8, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000D8, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000E8, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000F8, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000108, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000118, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000128, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_SaveTime_Text_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000138, "Member 'WB_SampleSaveItem_C_Get_SaveTime_Text_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_SampleSaveItem.WB_SampleSaveItem_C.Get_BG_ColorAndOpacity_0
// 0x0044 (0x0044 - 0x0000)
struct WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TmpColor;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0) == 0x000004, "Wrong alignment on WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0");
static_assert(sizeof(WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0) == 0x000044, "Wrong size on WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0");
static_assert(offsetof(WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0, TmpColor) == 0x000010, "Member 'WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0::TmpColor' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0, K2Node_MakeStruct_LinearColor_1) == 0x000030, "Member 'WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'WB_SampleSaveItem_C_Get_BG_ColorAndOpacity_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

