#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ScrollBar

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ScrollBar.WB_ScrollBar_C.OnScrolledByMouse__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_ScrollBar_C_OnScrolledByMouse__DelegateSignature final
{
public:
	float                                         Position;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ScrollBar_C_OnScrolledByMouse__DelegateSignature) == 0x000004, "Wrong alignment on WB_ScrollBar_C_OnScrolledByMouse__DelegateSignature");
static_assert(sizeof(WB_ScrollBar_C_OnScrolledByMouse__DelegateSignature) == 0x000004, "Wrong size on WB_ScrollBar_C_OnScrolledByMouse__DelegateSignature");
static_assert(offsetof(WB_ScrollBar_C_OnScrolledByMouse__DelegateSignature, Position) == 0x000000, "Member 'WB_ScrollBar_C_OnScrolledByMouse__DelegateSignature::Position' has a wrong offset!");

// Function WB_ScrollBar.WB_ScrollBar_C.ExecuteUbergraph_WB_ScrollBar
// 0x0540 (0x0540 - 0x0000)
struct WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38DB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromName_ReturnValue;     // 0x0008(0x00D0)()
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromName_ReturnValue_1;   // 0x00D8(0x00D0)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38DC[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromName_ReturnValue_2;   // 0x01B0(0x00D0)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38DD[0x6];                                     // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromName_ReturnValue_3;   // 0x0288(0x00D0)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_3;            // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38DE[0x3];                                     // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_ComponentBoundEvent_StartPos_1;             // 0x0360(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_StartUV_1;              // 0x0368(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_CurrentPos_1;           // 0x0370(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_CurrentUV_1;            // 0x0378(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0380(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x0388(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x03B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_5;        // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_6;        // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x041D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x041E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38DF[0x1];                                     // 0x041F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0420(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38E0[0x3];                                     // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38E1[0x3];                                     // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_2;                // 0x046C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_StartPos;               // 0x0484(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_StartUV;                // 0x048C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_CurrentPos;             // 0x0494(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_CurrentUV;              // 0x049C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_7;                        // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_7;                        // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_8;                        // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_8;                        // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38E2[0x3];                                     // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_9;                        // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_9;                        // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x04CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x04CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38E3[0x1];                                     // 0x04D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_3;                // 0x04E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_10;                       // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_10;                       // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_11;                       // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_11;                       // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_12;                       // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_12;                       // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_7;        // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_8;        // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38E4[0x3];                                     // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar) == 0x000008, "Wrong alignment on WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar");
static_assert(sizeof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar) == 0x000540, "Wrong size on WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, EntryPoint) == 0x000000, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_GetDebugMenuItemFromName_ReturnValue) == 0x000008, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_GetDebugMenuItemFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_GetDebugMenuItemFromName_ReturnValue_1) == 0x0000D8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_GetDebugMenuItemFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0001A9, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001AA, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001AB, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_GetDebugMenuItemFromName_ReturnValue_2) == 0x0001B0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_GetDebugMenuItemFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, Temp_bool_Has_Been_Initd_Variable) == 0x000280, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x000281, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_GetDebugMenuItemFromName_ReturnValue_3) == 0x000288, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_GetDebugMenuItemFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_NotEqual_IntInt_ReturnValue_3) == 0x000358, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_NotEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Greater_IntInt_ReturnValue) == 0x000359, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00035A, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BooleanAND_ReturnValue) == 0x00035B, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_Event_IsDesignTime) == 0x00035C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_StartPos_1) == 0x000360, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_StartPos_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_StartUV_1) == 0x000368, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_StartUV_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_CurrentPos_1) == 0x000370, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_CurrentPos_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_CurrentUV_1) == 0x000378, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_CurrentUV_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_Pos) == 0x000380, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_UV) == 0x000388, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_UV' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X) == 0x000390, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y) == 0x000394, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_1) == 0x000398, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_1) == 0x00039C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_2) == 0x0003A0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_2) == 0x0003A4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0003A8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_3) == 0x0003AC, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_3) == 0x0003B0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_MakeVector2D_ReturnValue) == 0x0003B4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0003BC, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_MakeVector2D_ReturnValue_1) == 0x0003C0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0003C8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_GetPosition_ReturnValue) == 0x0003D0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0003D8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_4) == 0x0003E0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_4) == 0x0003E4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_GetPosition_ReturnValue_1) == 0x0003E8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_5) == 0x0003F0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_5) == 0x0003F4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0003F8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0003FC, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue_4) == 0x000400, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000404, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000408, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue_5) == 0x00040C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Add_FloatFloat_ReturnValue) == 0x000410, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue_6) == 0x000414, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_FClamp_ReturnValue) == 0x000418, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00041C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00041D, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_SwitchInteger_CmpSuccess) == 0x00041E, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_Event_MyGeometry) == 0x000420, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_Event_InDeltaTime) == 0x000458, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_SwitchInteger_CmpSuccess_1) == 0x00045C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000460, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, Temp_bool_IsClosed_Variable) == 0x000468, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_GetPosition_ReturnValue_2) == 0x00046C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_GetPosition_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_6) == 0x000474, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_6) == 0x000478, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00047C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000480, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_StartPos) == 0x000484, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_StartPos' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_StartUV) == 0x00048C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_StartUV' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_CurrentPos) == 0x000494, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_CurrentPos' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, K2Node_ComponentBoundEvent_CurrentUV) == 0x00049C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::K2Node_ComponentBoundEvent_CurrentUV' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_7) == 0x0004A4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_7' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_7) == 0x0004A8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_7' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_8) == 0x0004AC, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_8' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_8) == 0x0004B0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_8' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0004B4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x0004B8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, Temp_bool_IsClosed_Variable_1) == 0x0004BC, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_9) == 0x0004C0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_9' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_9) == 0x0004C4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_9' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x0004C8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0004C9, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x0004CA, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x0004CB, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Less_FloatFloat_ReturnValue_4) == 0x0004CC, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Less_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x0004CD, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BooleanAND_ReturnValue_1) == 0x0004CE, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BooleanAND_ReturnValue_2) == 0x0004CF, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BooleanAND_ReturnValue_3) == 0x0004D0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BooleanAND_ReturnValue_4) == 0x0004D1, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BooleanAND_ReturnValue_5) == 0x0004D2, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0004D4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x0004D8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_IntInt_ReturnValue) == 0x0004E0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_GetPosition_ReturnValue_3) == 0x0004E4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_GetPosition_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Max_ReturnValue) == 0x0004EC, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_10) == 0x0004F0, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_10' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_10) == 0x0004F4, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_10' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0004F8, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0004FC, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_11) == 0x000500, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_11' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_11) == 0x000504, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_11' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_X_12) == 0x000508, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_X_12' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_BreakVector2D_Y_12) == 0x00050C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_BreakVector2D_Y_12' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue_7) == 0x000510, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000514, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x000518, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x00051C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000520, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Subtract_FloatFloat_ReturnValue_8) == 0x000524, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Subtract_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_FClamp_ReturnValue_1) == 0x000528, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x00052C, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_FClamp_ReturnValue_2) == 0x000530, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, Temp_bool_Has_Been_Initd_Variable_1) == 0x000534, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar, CallFunc_SelectFloat_ReturnValue) == 0x000538, "Member 'WB_ScrollBar_C_ExecuteUbergraph_WB_ScrollBar::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function WB_ScrollBar.WB_ScrollBar_C.BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature final
{
public:
	struct FVector2D                              StartPos;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              StartUV;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentPos;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentUV;                                         // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature");
static_assert(sizeof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature) == 0x000020, "Wrong size on WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature, StartPos) == 0x000000, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature::StartPos' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature, StartUV) == 0x000008, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature::StartUV' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature, CurrentPos) == 0x000010, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature::CurrentPos' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature, CurrentUV) == 0x000018, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_2_ButtonDragDrppEventS5__DelegateSignature::CurrentUV' has a wrong offset!");

// Function WB_ScrollBar.WB_ScrollBar_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_ScrollBar_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ScrollBar_C_Tick) == 0x000004, "Wrong alignment on WB_ScrollBar_C_Tick");
static_assert(sizeof(WB_ScrollBar_C_Tick) == 0x00003C, "Wrong size on WB_ScrollBar_C_Tick");
static_assert(offsetof(WB_ScrollBar_C_Tick, MyGeometry) == 0x000000, "Member 'WB_ScrollBar_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_ScrollBar_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_ScrollBar.WB_ScrollBar_C.BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_ScrollBar.WB_ScrollBar_C.BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature final
{
public:
	struct FVector2D                              StartPos;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              StartUV;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentPos;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentUV;                                         // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature");
static_assert(sizeof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature) == 0x000020, "Wrong size on WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature, StartPos) == 0x000000, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature::StartPos' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature, StartUV) == 0x000008, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature::StartUV' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature, CurrentPos) == 0x000010, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature::CurrentPos' has a wrong offset!");
static_assert(offsetof(WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature, CurrentUV) == 0x000018, "Member 'WB_ScrollBar_C_BndEvt__WB_ScrollBar_Button_ScrollBox_K2Node_ComponentBoundEvent_0_ButtonDragDrppEventS5__DelegateSignature::CurrentUV' has a wrong offset!");

// Function WB_ScrollBar.WB_ScrollBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ScrollBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ScrollBar_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ScrollBar_C_PreConstruct");
static_assert(sizeof(WB_ScrollBar_C_PreConstruct) == 0x000001, "Wrong size on WB_ScrollBar_C_PreConstruct");
static_assert(offsetof(WB_ScrollBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ScrollBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ScrollBar.WB_ScrollBar_C.InitScrollBar
// 0x0010 (0x0010 - 0x0000)
struct WB_ScrollBar_C_InitScrollBar final
{
public:
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
