#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SampleSaveItem

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SampleSaveItem.WB_SampleSaveItem_C
// 0x00B0 (0x0310 - 0x0260)
class UWB_SampleSaveItem_C final : public UUserWidget
{
public:
	class UImage*                                 Bg;                                                // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG2;                                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SaveDebugValue;                                    // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SaveSlotIndex;                                     // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SaveTime;                                          // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SaveType;                                          // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSaveLoadHeaderData                    SaveHeader;                                        // 0x0298(0x0070)(Edit, BlueprintVisible)
	int32                                         MenuCursor;                                        // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FText Get_PlayerName_Text_0();
	class FText Get_SaveType_Text_0();
	class FText Get_SaveSlotIndex_Text_0();
	class FText Get_SaveDebugValue_Text_0();
	class FText Get_SaveTime_Text_0();
	struct FLinearColor Get_BG_ColorAndOpacity_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_SampleSaveItem_C">();
	}
	static class UWB_SampleSaveItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SampleSaveItem_C>();
	}
};
static_assert(alignof(UWB_SampleSaveItem_C) == 0x000008, "Wrong alignment on UWB_SampleSaveItem_C");
static_assert(sizeof(UWB_SampleSaveItem_C) == 0x000310, "Wrong size on UWB_SampleSaveItem_C");
static_assert(offsetof(UWB_SampleSaveItem_C, Bg) == 0x000260, "Member 'UWB_SampleSaveItem_C::Bg' has a wrong offset!");
static_assert(offsetof(UWB_SampleSaveItem_C, BG2) == 0x000268, "Member 'UWB_SampleSaveItem_C::BG2' has a wrong offset!");
static_assert(offsetof(UWB_SampleSaveItem_C, PlayerName) == 0x000270, "Member 'UWB_SampleSaveItem_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWB_SampleSaveItem_C, SaveDebugValue) == 0x000278, "Member 'UWB_SampleSaveItem_C::SaveDebugValue' has a wrong offset!");
static_assert(offsetof(UWB_SampleSaveItem_C, SaveSlotIndex) == 0x000280, "Member 'UWB_SampleSaveItem_C::SaveSlotIndex' has a wrong offset!");
static_assert(offsetof(UWB_SampleSaveItem_C, SaveTime) == 0x000288, "Member 'UWB_SampleSaveItem_C::SaveTime' has a wrong offset!");
static_assert(offsetof(UWB_SampleSaveItem_C, SaveType) == 0x000290, "Member 'UWB_SampleSaveItem_C::SaveType' has a wrong offset!");
static_assert(offsetof(UWB_SampleSaveItem_C, SaveHeader) == 0x000298, "Member 'UWB_SampleSaveItem_C::SaveHeader' has a wrong offset!");
static_assert(offsetof(UWB_SampleSaveItem_C, MenuCursor) == 0x000308, "Member 'UWB_SampleSaveItem_C::MenuCursor' has a wrong offset!");

}

