#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SortWindow2

#include "Basic.hpp"

#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "Engine_structs.hpp"
#include "E_SORTWINDOW_POS_TYPE_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SortWindow2.WB_SortWindow2_C
// 0x0098 (0x02F8 - 0x0260)
class UWB_SortWindow2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_CheckScroll;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_BlackCurtain_Map;                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_BlackCurtain_Sort;                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_ListHeader;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_Pos;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_ScrollBar;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ScrollBar_C*                        WB_ScrollBar;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SortWindow_SlotList2_C*             WB_SlotList;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_SORTWINDOW_POS_TYPE                         PosType;                                           // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimPlayRate;                                      // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SORTWINDOW_POS_TYPE                         Debug_PosType;                                     // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Debug_CursorIdx;                                   // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Debug_AppliedSlotIdx;                              // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_IsAnimTest;                                  // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MouseEvent_OnHovered;                              // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             MouseEvent_OnClicked;                              // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             MouseEvent_MovedScrollBar;                         // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	E_SORTWINDOW_ANIM_STATE                       MainAnimState;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void MouseEvent_OnHovered__DelegateSignature(int32 SlotIdx);
	void MouseEvent_OnClicked__DelegateSignature(int32 SlotIdx);
	void MouseEvent_MovedScrollBar__DelegateSignature(float ScrollRate);
	void ExecuteUbergraph_WB_SortWindow2(int32 EntryPoint);
	void Destruct();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_SsParts();
	void SetSlotListInfo(TArray<class FText>& InListInfo);
	void SetPosType(E_SORTWINDOW_POS_TYPE InPosType);
	void SetAnimState(E_SORTWINDOW_ANIM_STATE InAinmState);
	void SetAnimState_SlotOnly(E_SORTWINDOW_ANIM_STATE InAinmState);
	void GetAnimState(E_SORTWINDOW_ANIM_STATE* AinmState);
	void GetCursorIdx(int32* CursorIdx);
	void SetCursorIdx(int32 InSlotIdx);
	void CursorMove_Up();
	void CursorMove_Down();
	void CursorMove_Top();
	void CursorMove_Bottom();
	void SetScrollBarRate(float InScrollRate);
	void SetScrollbarVisibility(bool IsVisibleScrollBar);
	void Tick_Base();
	void Tick_In();
	void Tick_Out();
	void SetAppliedSlotIdx(int32 InSlotIdx);
	void GetAppliedSlotIdx(int32* AppliedSlotIdx);
	void GetSlotMaxNum(int32* SlotMaxNum);
	void CheckCursorPosAndSkipListIn();
	void GetElementCategoryPos(struct FVector2D* OutVec);
	void BindMouseInputEvent();
	void UnbindMouseInputEvent();
	void OnHoveredSlot_ByMouse(int32 SlotIdx);
	void OnClickedSlot_ByMouse(int32 SlotIdx);
	void OnMovedScrollBar_ByMouse(float ScrollRate);
	void IsEnableMouseWheel(bool* IsEnableScroll);
	void SetMouseHitVisibility(bool EnableMouseHit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_SortWindow2_C">();
	}
	static class UWB_SortWindow2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SortWindow2_C>();
	}
};
static_assert(alignof(UWB_SortWindow2_C) == 0x000008, "Wrong alignment on UWB_SortWindow2_C");
static_assert(sizeof(UWB_SortWindow2_C) == 0x0002F8, "Wrong size on UWB_SortWindow2_C");
static_assert(offsetof(UWB_SortWindow2_C, UberGraphFrame) == 0x000260, "Member 'UWB_SortWindow2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, Canvas_CheckScroll) == 0x000268, "Member 'UWB_SortWindow2_C::Canvas_CheckScroll' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, SsPlayer_BlackCurtain_Map) == 0x000270, "Member 'UWB_SortWindow2_C::SsPlayer_BlackCurtain_Map' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, SsPlayer_BlackCurtain_Sort) == 0x000278, "Member 'UWB_SortWindow2_C::SsPlayer_BlackCurtain_Sort' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, SsPlayer_ListHeader) == 0x000280, "Member 'UWB_SortWindow2_C::SsPlayer_ListHeader' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, SsPlayer_Pos) == 0x000288, "Member 'UWB_SortWindow2_C::SsPlayer_Pos' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, SsPlayer_ScrollBar) == 0x000290, "Member 'UWB_SortWindow2_C::SsPlayer_ScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, WB_ScrollBar) == 0x000298, "Member 'UWB_SortWindow2_C::WB_ScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, WB_SlotList) == 0x0002A0, "Member 'UWB_SortWindow2_C::WB_SlotList' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, PosType) == 0x0002A8, "Member 'UWB_SortWindow2_C::PosType' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, AnimPlayRate) == 0x0002AC, "Member 'UWB_SortWindow2_C::AnimPlayRate' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, Debug_PosType) == 0x0002B0, "Member 'UWB_SortWindow2_C::Debug_PosType' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, Debug_CursorIdx) == 0x0002B4, "Member 'UWB_SortWindow2_C::Debug_CursorIdx' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, Debug_AppliedSlotIdx) == 0x0002B8, "Member 'UWB_SortWindow2_C::Debug_AppliedSlotIdx' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, Debug_IsAnimTest) == 0x0002BC, "Member 'UWB_SortWindow2_C::Debug_IsAnimTest' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, MouseEvent_OnHovered) == 0x0002C0, "Member 'UWB_SortWindow2_C::MouseEvent_OnHovered' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, MouseEvent_OnClicked) == 0x0002D0, "Member 'UWB_SortWindow2_C::MouseEvent_OnClicked' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, MouseEvent_MovedScrollBar) == 0x0002E0, "Member 'UWB_SortWindow2_C::MouseEvent_MovedScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_SortWindow2_C, MainAnimState) == 0x0002F0, "Member 'UWB_SortWindow2_C::MainAnimState' has a wrong offset!");

}

