#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Transport_LocationSlotList2

#include "Basic.hpp"

#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.MouseEvent_OnHovered__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_Transport_LocationSlotList2_C_MouseEvent_OnHovered__DelegateSignature final
{
public:
	int32                                         SlotIdx;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_MouseEvent_OnHovered__DelegateSignature) == 0x000004, "Wrong alignment on WB_Transport_LocationSlotList2_C_MouseEvent_OnHovered__DelegateSignature");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_MouseEvent_OnHovered__DelegateSignature) == 0x000004, "Wrong size on WB_Transport_LocationSlotList2_C_MouseEvent_OnHovered__DelegateSignature");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_MouseEvent_OnHovered__DelegateSignature, SlotIdx) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_MouseEvent_OnHovered__DelegateSignature::SlotIdx' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.MouseEvent_OnClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_Transport_LocationSlotList2_C_MouseEvent_OnClicked__DelegateSignature final
{
public:
	int32                                         SlotIdx;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_MouseEvent_OnClicked__DelegateSignature) == 0x000004, "Wrong alignment on WB_Transport_LocationSlotList2_C_MouseEvent_OnClicked__DelegateSignature");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_MouseEvent_OnClicked__DelegateSignature) == 0x000004, "Wrong size on WB_Transport_LocationSlotList2_C_MouseEvent_OnClicked__DelegateSignature");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_MouseEvent_OnClicked__DelegateSignature, SlotIdx) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_MouseEvent_OnClicked__DelegateSignature::SlotIdx' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.ExecuteUbergraph_WB_Transport_LocationSlotList2
// 0x0044 (0x0044 - 0x0000)
struct WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2) == 0x000004, "Wrong alignment on WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2) == 0x000044, "Wrong size on WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2, EntryPoint) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2, K2Node_Event_MyGeometry) == 0x000004, "Member 'WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WB_Transport_LocationSlotList2_C_ExecuteUbergraph_WB_Transport_LocationSlotList2::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Transport_LocationSlotList2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_PreConstruct) == 0x000001, "Wrong alignment on WB_Transport_LocationSlotList2_C_PreConstruct");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_PreConstruct) == 0x000001, "Wrong size on WB_Transport_LocationSlotList2_C_PreConstruct");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Transport_LocationSlotList2_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_Tick) == 0x000004, "Wrong alignment on WB_Transport_LocationSlotList2_C_Tick");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_Tick) == 0x00003C, "Wrong size on WB_Transport_LocationSlotList2_C_Tick");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Transport_LocationSlotList2_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.Init
// 0x0058 (0x0058 - 0x0000)
struct WB_Transport_LocationSlotList2_C_Init final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3358[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_Transport_LocationSlot2_C*>  K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_Init) == 0x000008, "Wrong alignment on WB_Transport_LocationSlotList2_C_Init");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_Init) == 0x000058, "Wrong size on WB_Transport_LocationSlotList2_C_Init");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, K2Node_MakeArray_Array) == 0x000008, "Member 'WB_Transport_LocationSlotList2_C_Init::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000018, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WB_Transport_LocationSlotList2_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_Array_Get_Item) == 0x000020, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_GetPosition_ReturnValue) == 0x000034, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_BreakVector2D_X) == 0x00003C, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_BreakVector2D_Y) == 0x000040, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_MakeVector2D_ReturnValue) == 0x000044, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WB_Transport_LocationSlotList2_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.SetSlotListInfo
// 0x0058 (0x0058 - 0x0000)
struct WB_Transport_LocationSlotList2_C_SetSlotListInfo final
{
public:
	TArray<struct FTransportLocationSlotInfo>     InListInfo3;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IsUpdateAnim;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3359[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_SlotIdx;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335A[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_335B[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_2;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_SetSlotListInfo) == 0x000008, "Wrong alignment on WB_Transport_LocationSlotList2_C_SetSlotListInfo");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_SetSlotListInfo) == 0x000058, "Wrong size on WB_Transport_LocationSlotList2_C_SetSlotListInfo");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, InListInfo3) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::InListInfo3' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, IsUpdateAnim) == 0x000010, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::IsUpdateAnim' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, L_SlotIdx) == 0x000014, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Array_Get_Item) == 0x000020, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Array_LastIndex_ReturnValue) == 0x00002C, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Clamp_ReturnValue) == 0x000034, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Array_Get_Item_2) == 0x000040, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, Temp_int_Variable) == 0x000048, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetSlotListInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'WB_Transport_LocationSlotList2_C_SetSlotListInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.GetCursorIdx
// 0x000C (0x000C - 0x0000)
struct WB_Transport_LocationSlotList2_C_GetCursorIdx final
{
public:
	int32                                         CursorIdx;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_SlotIdx;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_GetCursorIdx) == 0x000004, "Wrong alignment on WB_Transport_LocationSlotList2_C_GetCursorIdx");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_GetCursorIdx) == 0x00000C, "Wrong size on WB_Transport_LocationSlotList2_C_GetCursorIdx");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_GetCursorIdx, CursorIdx) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_GetCursorIdx::CursorIdx' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_GetCursorIdx, L_SlotIdx) == 0x000004, "Member 'WB_Transport_LocationSlotList2_C_GetCursorIdx::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_GetCursorIdx, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'WB_Transport_LocationSlotList2_C_GetCursorIdx::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.SetCursorIdx
// 0x0040 (0x0040 - 0x0000)
struct WB_Transport_LocationSlotList2_C_SetCursorIdx final
{
public:
	int32                                         InSlotIdx;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUpdateAnim;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_335C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_SlotIdx;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_335D[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCursorState_OnCursor;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3360[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_SetCursorIdx) == 0x000008, "Wrong alignment on WB_Transport_LocationSlotList2_C_SetCursorIdx");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_SetCursorIdx) == 0x000040, "Wrong size on WB_Transport_LocationSlotList2_C_SetCursorIdx");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, InSlotIdx) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::InSlotIdx' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, IsUpdateAnim) == 0x000004, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::IsUpdateAnim' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, L_SlotIdx) == 0x000008, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, Temp_int_Variable) == 0x000020, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_GetCursorState_OnCursor) == 0x000030, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_GetCursorState_OnCursor' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000031, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetCursorIdx, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'WB_Transport_LocationSlotList2_C_SetCursorIdx::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.SetAnimState
// 0x00A8 (0x00A8 - 0x0000)
struct WB_Transport_LocationSlotList2_C_SetAnimState final
{
public:
	E_SORTWINDOW_ANIM_STATE                       InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3361[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_SlotIdx;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3362[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3363[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_2;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_3;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3364[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_4;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3365[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3366[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3367[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_5;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_6;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3368[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_SetAnimState) == 0x000008, "Wrong alignment on WB_Transport_LocationSlotList2_C_SetAnimState");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_SetAnimState) == 0x0000A8, "Wrong size on WB_Transport_LocationSlotList2_C_SetAnimState");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, InState) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::InState' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, L_SlotIdx) == 0x000004, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, Temp_int_Variable) == 0x000008, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, Temp_int_Variable_1) == 0x000010, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_LastIndex_ReturnValue_1) == 0x000020, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Get_Item) == 0x000028, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, Temp_int_Variable_2) == 0x000040, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Add_IntInt_ReturnValue_2) == 0x000044, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_2) == 0x000048, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_3) == 0x000050, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Less_IntInt_ReturnValue_1) == 0x000058, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_4) == 0x000060, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Subtract_IntInt_ReturnValue) == 0x000068, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00006C, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, Temp_int_Variable_3) == 0x000070, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000074, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Add_IntInt_ReturnValue_3) == 0x000078, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_5) == 0x000080, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Array_Get_Item_6) == 0x000088, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000090, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000098, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000099, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00009C, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0000A0, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, K2Node_SwitchEnum_CmpSuccess) == 0x0000A1, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_SetAnimState, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x0000A2, "Member 'WB_Transport_LocationSlotList2_C_SetAnimState::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.Tick_Base
// 0x0001 (0x0001 - 0x0000)
struct WB_Transport_LocationSlotList2_C_Tick_Base final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_Tick_Base) == 0x000001, "Wrong alignment on WB_Transport_LocationSlotList2_C_Tick_Base");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_Tick_Base) == 0x000001, "Wrong size on WB_Transport_LocationSlotList2_C_Tick_Base");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_Tick_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.Tick_FrameIn
// 0x0040 (0x0040 - 0x0000)
struct WB_Transport_LocationSlotList2_C_Tick_FrameIn final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3369[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_1;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336B[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336C[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_Tick_FrameIn) == 0x000008, "Wrong alignment on WB_Transport_LocationSlotList2_C_Tick_FrameIn");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_Tick_FrameIn) == 0x000040, "Wrong size on WB_Transport_LocationSlotList2_C_Tick_FrameIn");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_Array_Get_Item) == 0x000008, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000020, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000028, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, K2Node_SwitchName_CmpSuccess) == 0x000029, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00002C, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameIn, Temp_int_Variable) == 0x000038, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameIn::Temp_int_Variable' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.Tick_FrameOut
// 0x0028 (0x0028 - 0x0000)
struct WB_Transport_LocationSlotList2_C_Tick_FrameOut final
{
public:
	int32                                         L_SlotIdx;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336E[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_Tick_FrameOut) == 0x000008, "Wrong alignment on WB_Transport_LocationSlotList2_C_Tick_FrameOut");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_Tick_FrameOut) == 0x000028, "Wrong size on WB_Transport_LocationSlotList2_C_Tick_FrameOut");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, L_SlotIdx) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, Temp_int_Variable) == 0x00000C, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000018, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000020, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, K2Node_SwitchName_CmpSuccess) == 0x000021, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000022, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_Tick_FrameOut, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WB_Transport_LocationSlotList2_C_Tick_FrameOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.CursorMove_Up
// 0x0028 (0x0028 - 0x0000)
struct WB_Transport_LocationSlotList2_C_CursorMove_Up final
{
public:
	int32                                         L_SlotIdx;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3370[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Transport_LocationSlot2_C*          CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlotList2_C_CursorMove_Up) == 0x000008, "Wrong alignment on WB_Transport_LocationSlotList2_C_CursorMove_Up");
static_assert(sizeof(WB_Transport_LocationSlotList2_C_CursorMove_Up) == 0x000028, "Wrong size on WB_Transport_LocationSlotList2_C_CursorMove_Up");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_CursorMove_Up, L_SlotIdx) == 0x000000, "Member 'WB_Transport_LocationSlotList2_C_CursorMove_Up::L_SlotIdx' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_CursorMove_Up, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WB_Transport_LocationSlotList2_C_CursorMove_Up::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_CursorMove_Up, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WB_Transport_LocationSlotList2_C_CursorMove_Up::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_CursorMove_Up, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00000C, "Member 'WB_Transport_LocationSlotList2_C_CursorMove_Up::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_CursorMove_Up, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_Transport_LocationSlotList2_C_CursorMove_Up::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_CursorMove_Up, CallFunc_Less_IntInt_ReturnValue) == 0x000011, "Member 'WB_Transport_LocationSlotList2_C_CursorMove_Up::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_CursorMove_Up, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_Transport_LocationSlotList2_C_CursorMove_Up::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlotList2_C_CursorMove_Up, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WB_Transport_LocationSlotList2_C_CursorMove_Up::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WB_Transport_LocationSlotList2.WB_Transport_LocationSlotList2_C.GetSlotMaxNum
// 0x0008 (0x0008 - 0x0000)
struct WB_Transport_LocationSlotList2_C_GetSlotMaxNum final
{
public:
	int32                                         SlotMaxNum;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
