#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TopCameraIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Project_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.ExecuteUbergraph_WB_TopCameraIcon
// 0x0040 (0x0040 - 0x0000)
struct WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon) == 0x000004, "Wrong alignment on WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon");
static_assert(sizeof(WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon) == 0x000040, "Wrong size on WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon");
static_assert(offsetof(WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon, EntryPoint) == 0x000000, "Member 'WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon, K2Node_Event_MyGeometry) == 0x000004, "Member 'WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WB_TopCameraIcon_C_ExecuteUbergraph_WB_TopCameraIcon::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_TopCameraIcon_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_Tick) == 0x000004, "Wrong alignment on WB_TopCameraIcon_C_Tick");
static_assert(sizeof(WB_TopCameraIcon_C_Tick) == 0x00003C, "Wrong size on WB_TopCameraIcon_C_Tick");
static_assert(offsetof(WB_TopCameraIcon_C_Tick, MyGeometry) == 0x000000, "Member 'WB_TopCameraIcon_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_TopCameraIcon_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.CreateData
// 0x0040 (0x0040 - 0x0000)
struct WB_TopCameraIcon_C_CreateData final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_CreateData) == 0x000008, "Wrong alignment on WB_TopCameraIcon_C_CreateData");
static_assert(sizeof(WB_TopCameraIcon_C_CreateData) == 0x000040, "Wrong size on WB_TopCameraIcon_C_CreateData");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, Temp_int_Variable) == 0x000008, "Member 'WB_TopCameraIcon_C_CreateData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_AddChildToOverlay_ReturnValue) == 0x000020, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_CreateData, CallFunc_MakeVector2D_ReturnValue) == 0x000034, "Member 'WB_TopCameraIcon_C_CreateData::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.UpdateImage
// 0x0130 (0x0130 - 0x0000)
struct WB_TopCameraIcon_C_UpdateImage final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_RequestImage_Image;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMap3DIconEntry>                CallFunc_GetTopCameraIconEntries_ReturnValue;      // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMap3DIconEntry                        CallFunc_Array_Get_Item_1;                         // 0x006C(0x0070)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetIconMaterialTopCamera_OutU;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIconMaterialTopCamera_OutV;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetIconMaterialTopCamera_OutColor;        // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_UpdateImage) == 0x000008, "Wrong alignment on WB_TopCameraIcon_C_UpdateImage");
static_assert(sizeof(WB_TopCameraIcon_C_UpdateImage) == 0x000130, "Wrong size on WB_TopCameraIcon_C_UpdateImage");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WB_TopCameraIcon_C_UpdateImage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'WB_TopCameraIcon_C_UpdateImage::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WB_TopCameraIcon_C_UpdateImage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_RequestImage_Image) == 0x000018, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_RequestImage_Image' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_GetMinimapManager_ReturnValue) == 0x000028, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, Temp_int_Variable) == 0x000030, "Member 'WB_TopCameraIcon_C_UpdateImage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Array_Get_Item) == 0x000038, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000045, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_GetMinimapManager_ReturnValue_1) == 0x000050, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_GetMinimapManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_GetTopCameraIconEntries_ReturnValue) == 0x000058, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_GetTopCameraIconEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Array_Get_Item_1) == 0x00006C, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_BooleanAND_ReturnValue) == 0x0000DD, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000DE, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_GetIconMaterialTopCamera_OutU) == 0x0000E0, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_GetIconMaterialTopCamera_OutU' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_GetIconMaterialTopCamera_OutV) == 0x0000E4, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_GetIconMaterialTopCamera_OutV' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_GetIconMaterialTopCamera_OutColor) == 0x0000E8, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_GetIconMaterialTopCamera_OutColor' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000F8, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, K2Node_MakeStruct_LinearColor) == 0x0000FC, "Member 'WB_TopCameraIcon_C_UpdateImage::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_MakeVector2D_ReturnValue) == 0x00010C, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_BreakVector_X) == 0x000114, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_BreakVector_Y) == 0x000118, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_BreakVector_Z) == 0x00011C, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000120, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000124, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateImage, CallFunc_MakeVector2D_ReturnValue_1) == 0x000128, "Member 'WB_TopCameraIcon_C_UpdateImage::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.UpdateBuffer
// 0x0050 (0x0050 - 0x0000)
struct WB_TopCameraIcon_C_UpdateBuffer final
{
public:
	struct FVector                                CameraLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraRotate;                                      // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HeroLocation;                                      // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HeroRotate;                                        // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_UpdateBuffer) == 0x000008, "Wrong alignment on WB_TopCameraIcon_C_UpdateBuffer");
static_assert(sizeof(WB_TopCameraIcon_C_UpdateBuffer) == 0x000050, "Wrong size on WB_TopCameraIcon_C_UpdateBuffer");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CameraLocation) == 0x000000, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CameraLocation' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CameraRotate) == 0x00000C, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CameraRotate' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, HeroLocation) == 0x000018, "Member 'WB_TopCameraIcon_C_UpdateBuffer::HeroLocation' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, HeroRotate) == 0x000024, "Member 'WB_TopCameraIcon_C_UpdateBuffer::HeroRotate' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CallFunc_GetMinimapManager_ReturnValue) == 0x000030, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CallFunc_BreakRotator_Roll_1) == 0x000044, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CallFunc_BreakRotator_Pitch_1) == 0x000048, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdateBuffer, CallFunc_BreakRotator_Yaw_1) == 0x00004C, "Member 'WB_TopCameraIcon_C_UpdateBuffer::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.InitPlayer
// 0x0030 (0x0030 - 0x0000)
struct WB_TopCameraIcon_C_InitPlayer final
{
public:
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_InitPlayer) == 0x000008, "Wrong alignment on WB_TopCameraIcon_C_InitPlayer");
static_assert(sizeof(WB_TopCameraIcon_C_InitPlayer) == 0x000030, "Wrong size on WB_TopCameraIcon_C_InitPlayer");
static_assert(offsetof(WB_TopCameraIcon_C_InitPlayer, K2Node_MakeStruct_LinearColor) == 0x000000, "Member 'WB_TopCameraIcon_C_InitPlayer::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_InitPlayer, K2Node_MakeStruct_LinearColor_1) == 0x000010, "Member 'WB_TopCameraIcon_C_InitPlayer::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_InitPlayer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WB_TopCameraIcon_C_InitPlayer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_InitPlayer, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000028, "Member 'WB_TopCameraIcon_C_InitPlayer::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.UpdatePlayer
// 0x00E0 (0x00E0 - 0x0000)
struct WB_TopCameraIcon_C_UpdatePlayer final
{
public:
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIconHideByUI_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMap3DIconEntry                        CallFunc_GetTopCameraPlayerIcon_ReturnValue;       // 0x0020(0x0070)(ConstParm, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_1;       // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_UpdatePlayer) == 0x000008, "Wrong alignment on WB_TopCameraIcon_C_UpdatePlayer");
static_assert(sizeof(WB_TopCameraIcon_C_UpdatePlayer) == 0x0000E0, "Wrong size on WB_TopCameraIcon_C_UpdatePlayer");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_Add_FloatFloat_ReturnValue) == 0x000000, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_GetMinimapManager_ReturnValue) == 0x000008, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_GetMinimapManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_IsIconHideByUI_ReturnValue) == 0x000010, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_IsIconHideByUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_GetMinimapManager_ReturnValue_1) == 0x000018, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_GetMinimapManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_GetTopCameraPlayerIcon_ReturnValue) == 0x000020, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_GetTopCameraPlayerIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_BreakVector_X) == 0x000090, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_BreakVector_Y) == 0x000094, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_BreakVector_Z) == 0x000098, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x00009C, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_BreakVector2D_X) == 0x0000A4, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_BreakVector2D_Y) == 0x0000A8, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000AC, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000B0, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_MakeVector2D_ReturnValue) == 0x0000B4, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_Divide_Vector2DFloat_ReturnValue_1) == 0x0000BC, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_Divide_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_BreakVector2D_X_1) == 0x0000C4, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_BreakVector2D_Y_1) == 0x0000C8, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0000CC, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0000D0, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayer, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000D4, "Member 'WB_TopCameraIcon_C_UpdatePlayer::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.RequestImage
// 0x0018 (0x0018 - 0x0000)
struct WB_TopCameraIcon_C_RequestImage final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_RequestImage) == 0x000008, "Wrong alignment on WB_TopCameraIcon_C_RequestImage");
static_assert(sizeof(WB_TopCameraIcon_C_RequestImage) == 0x000018, "Wrong size on WB_TopCameraIcon_C_RequestImage");
static_assert(offsetof(WB_TopCameraIcon_C_RequestImage, Image) == 0x000000, "Member 'WB_TopCameraIcon_C_RequestImage::Image' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_RequestImage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_TopCameraIcon_C_RequestImage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_RequestImage, CallFunc_Array_Get_Item) == 0x000010, "Member 'WB_TopCameraIcon_C_RequestImage::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WB_TopCameraIcon.WB_TopCameraIcon_C.UpdatePlayerImage
// 0x0120 (0x0120 - 0x0000)
struct WB_TopCameraIcon_C_UpdatePlayerImage final
{
public:
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_RequestImage_Image;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_RequestImage_Image_1;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMinimapManager*                        CallFunc_GetMinimapManager_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMap3DIconEntry                        CallFunc_GetTopCameraPlayerIcon_ReturnValue;       // 0x0070(0x0070)(ConstParm, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TopCameraIcon_C_UpdatePlayerImage) == 0x000008, "Wrong alignment on WB_TopCameraIcon_C_UpdatePlayerImage");
static_assert(sizeof(WB_TopCameraIcon_C_UpdatePlayerImage) == 0x000120, "Wrong size on WB_TopCameraIcon_C_UpdatePlayerImage");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayerImage, K2Node_MakeStruct_LinearColor) == 0x000000, "Member 'WB_TopCameraIcon_C_UpdatePlayerImage::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayerImage, K2Node_MakeStruct_LinearColor_1) == 0x000010, "Member 'WB_TopCameraIcon_C_UpdatePlayerImage::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WB_TopCameraIcon_C_UpdatePlayerImage, CallFunc_RequestImage_Image) == 0x000020, "Member 'WB_TopCameraIcon_C_UpdatePlayerImage::CallFunc_RequestImage_Image' has a wrong offset!");
