#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TitleMainMenu_2

#include "Basic.hpp"

#include "Project_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.Disp_OnHoveredMouse__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_TitleMainMenu_2_C_Disp_OnHoveredMouse__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_Disp_OnHoveredMouse__DelegateSignature) == 0x000004, "Wrong alignment on WB_TitleMainMenu_2_C_Disp_OnHoveredMouse__DelegateSignature");
static_assert(sizeof(WB_TitleMainMenu_2_C_Disp_OnHoveredMouse__DelegateSignature) == 0x000004, "Wrong size on WB_TitleMainMenu_2_C_Disp_OnHoveredMouse__DelegateSignature");
static_assert(offsetof(WB_TitleMainMenu_2_C_Disp_OnHoveredMouse__DelegateSignature, Param_Index) == 0x000000, "Member 'WB_TitleMainMenu_2_C_Disp_OnHoveredMouse__DelegateSignature::Param_Index' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.Disp_OnClickedMouse__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_TitleMainMenu_2_C_Disp_OnClickedMouse__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_Disp_OnClickedMouse__DelegateSignature) == 0x000004, "Wrong alignment on WB_TitleMainMenu_2_C_Disp_OnClickedMouse__DelegateSignature");
static_assert(sizeof(WB_TitleMainMenu_2_C_Disp_OnClickedMouse__DelegateSignature) == 0x000004, "Wrong size on WB_TitleMainMenu_2_C_Disp_OnClickedMouse__DelegateSignature");
static_assert(offsetof(WB_TitleMainMenu_2_C_Disp_OnClickedMouse__DelegateSignature, Param_Index) == 0x000000, "Member 'WB_TitleMainMenu_2_C_Disp_OnClickedMouse__DelegateSignature::Param_Index' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.ExecuteUbergraph_WB_TitleMainMenu_2
// 0x0070 (0x0070 - 0x0000)
struct WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_TITLE_TOP_SELECTION>                 K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EA3[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos_4;                  // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV_4;                   // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos_3;                  // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV_3;                   // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos_2;                  // 0x003C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV_2;                   // 0x0044(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos_1;                  // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV_1;                   // 0x0054(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x005C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x0064(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2");
static_assert(sizeof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2) == 0x000070, "Wrong size on WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, EntryPoint) == 0x000000, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_MakeArray_Array) == 0x000008, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_Pos_4) == 0x00001C, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_Pos_4' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_UV_4) == 0x000024, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_UV_4' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_Pos_3) == 0x00002C, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_Pos_3' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_UV_3) == 0x000034, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_UV_3' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_Pos_2) == 0x00003C, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_Pos_2' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_UV_2) == 0x000044, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_UV_2' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_Pos_1) == 0x00004C, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_Pos_1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_UV_1) == 0x000054, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_UV_1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_Pos) == 0x00005C, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2, K2Node_ComponentBoundEvent_UV) == 0x000064, "Member 'WB_TitleMainMenu_2_C_ExecuteUbergraph_WB_TitleMainMenu_2::K2Node_ComponentBoundEvent_UV' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot5_K2Node_ComponentBoundEvent_7_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Slot4_K2Node_ComponentBoundEvent_6_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Continue_K2Node_ComponentBoundEvent_5_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_Option_K2Node_ComponentBoundEvent_4_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_TitleMainMenu_2_C_BndEvt__WB_TitleMainMenu_2_ButtonS5_NewGame_K2Node_ComponentBoundEvent_3_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_TitleMainMenu_2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TitleMainMenu_2_C_PreConstruct) == 0x000001, "Wrong alignment on WB_TitleMainMenu_2_C_PreConstruct");
static_assert(sizeof(WB_TitleMainMenu_2_C_PreConstruct) == 0x000001, "Wrong size on WB_TitleMainMenu_2_C_PreConstruct");
static_assert(offsetof(WB_TitleMainMenu_2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_TitleMainMenu_2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.InitPartsPos
// 0x0030 (0x0030 - 0x0000)
struct WB_TitleMainMenu_2_C_InitPartsPos final
{
public:
	class FName                                   InPartsName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSSPPositionDataByPartsName_OutVec;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_InitPartsPos) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_InitPartsPos");
static_assert(sizeof(WB_TitleMainMenu_2_C_InitPartsPos) == 0x000030, "Wrong size on WB_TitleMainMenu_2_C_InitPartsPos");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitPartsPos, InPartsName) == 0x000000, "Member 'WB_TitleMainMenu_2_C_InitPartsPos::InPartsName' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitPartsPos, Widget) == 0x000008, "Member 'WB_TitleMainMenu_2_C_InitPartsPos::Widget' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitPartsPos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WB_TitleMainMenu_2_C_InitPartsPos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitPartsPos, CallFunc_GetSSPPositionDataByPartsName_OutVec) == 0x000018, "Member 'WB_TitleMainMenu_2_C_InitPartsPos::CallFunc_GetSSPPositionDataByPartsName_OutVec' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitPartsPos, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WB_TitleMainMenu_2_C_InitPartsPos::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitPartsPos, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'WB_TitleMainMenu_2_C_InitPartsPos::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitPartsPos, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'WB_TitleMainMenu_2_C_InitPartsPos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.InitTitleMenuPos
// 0x0060 (0x0060 - 0x0000)
struct WB_TitleMainMenu_2_C_InitTitleMenuPos final
{
public:
	int32                                         SlotMax;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UButtonS5*                              Lo_Target2;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USsPlayerWidget*                        Lo_Target1;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_SlotMax;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lo_Index;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EA5[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EA6[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Get_Title_Menu_Pos_OutputPin;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Title_Menu_Pos_Output_Get;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EA7[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TitleMainMenu_2_C_InitTitleMenuPos) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_InitTitleMenuPos");
static_assert(sizeof(WB_TitleMainMenu_2_C_InitTitleMenuPos) == 0x000060, "Wrong size on WB_TitleMainMenu_2_C_InitTitleMenuPos");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, SlotMax) == 0x000000, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::SlotMax' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, Lo_Target2) == 0x000008, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::Lo_Target2' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, Lo_Target1) == 0x000010, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::Lo_Target1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, Lo_SlotMax) == 0x000018, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::Lo_SlotMax' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, Lo_Index) == 0x00001C, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::Lo_Index' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, Temp_int_Variable) == 0x000020, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, Temp_int_Variable_1) == 0x000024, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000038, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_Get_Title_Menu_Pos_OutputPin) == 0x000044, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_Get_Title_Menu_Pos_OutputPin' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_Get_Title_Menu_Pos_Output_Get) == 0x000048, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_Get_Title_Menu_Pos_Output_Get' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_MakeVector2D_ReturnValue) == 0x00004C, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_Less_IntInt_ReturnValue_1) == 0x000054, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_InitTitleMenuPos, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'WB_TitleMainMenu_2_C_InitTitleMenuPos::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.GetNewGameText
// 0x0038 (0x0038 - 0x0000)
struct WB_TitleMainMenu_2_C_GetNewGameText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_GetNewGameText) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_GetNewGameText");
static_assert(sizeof(WB_TitleMainMenu_2_C_GetNewGameText) == 0x000038, "Wrong size on WB_TitleMainMenu_2_C_GetNewGameText");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetNewGameText, Text) == 0x000000, "Member 'WB_TitleMainMenu_2_C_GetNewGameText::Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetNewGameText, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WB_TitleMainMenu_2_C_GetNewGameText::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetNewGameText, CallFunc_GetTextByLabel_ReturnValue) == 0x000020, "Member 'WB_TitleMainMenu_2_C_GetNewGameText::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.GetContinueText
// 0x0038 (0x0038 - 0x0000)
struct WB_TitleMainMenu_2_C_GetContinueText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_GetContinueText) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_GetContinueText");
static_assert(sizeof(WB_TitleMainMenu_2_C_GetContinueText) == 0x000038, "Wrong size on WB_TitleMainMenu_2_C_GetContinueText");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetContinueText, Text) == 0x000000, "Member 'WB_TitleMainMenu_2_C_GetContinueText::Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetContinueText, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WB_TitleMainMenu_2_C_GetContinueText::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetContinueText, CallFunc_GetTextByLabel_ReturnValue) == 0x000020, "Member 'WB_TitleMainMenu_2_C_GetContinueText::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.GetOptionText
// 0x0038 (0x0038 - 0x0000)
struct WB_TitleMainMenu_2_C_GetOptionText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_GetOptionText) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_GetOptionText");
static_assert(sizeof(WB_TitleMainMenu_2_C_GetOptionText) == 0x000038, "Wrong size on WB_TitleMainMenu_2_C_GetOptionText");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetOptionText, Text) == 0x000000, "Member 'WB_TitleMainMenu_2_C_GetOptionText::Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetOptionText, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WB_TitleMainMenu_2_C_GetOptionText::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetOptionText, CallFunc_GetTextByLabel_ReturnValue) == 0x000020, "Member 'WB_TitleMainMenu_2_C_GetOptionText::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.GetCopyrightText
// 0x0038 (0x0038 - 0x0000)
struct WB_TitleMainMenu_2_C_GetCopyrightText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_GetCopyrightText) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_GetCopyrightText");
static_assert(sizeof(WB_TitleMainMenu_2_C_GetCopyrightText) == 0x000038, "Wrong size on WB_TitleMainMenu_2_C_GetCopyrightText");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetCopyrightText, Text) == 0x000000, "Member 'WB_TitleMainMenu_2_C_GetCopyrightText::Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetCopyrightText, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WB_TitleMainMenu_2_C_GetCopyrightText::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetCopyrightText, CallFunc_GetTextByLabel_ReturnValue) == 0x000020, "Member 'WB_TitleMainMenu_2_C_GetCopyrightText::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.GetEndText
// 0x0038 (0x0038 - 0x0000)
struct WB_TitleMainMenu_2_C_GetEndText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_GetEndText) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_GetEndText");
static_assert(sizeof(WB_TitleMainMenu_2_C_GetEndText) == 0x000038, "Wrong size on WB_TitleMainMenu_2_C_GetEndText");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetEndText, Text) == 0x000000, "Member 'WB_TitleMainMenu_2_C_GetEndText::Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetEndText, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WB_TitleMainMenu_2_C_GetEndText::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetEndText, CallFunc_GetTextByLabel_ReturnValue) == 0x000020, "Member 'WB_TitleMainMenu_2_C_GetEndText::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.GetConvertText
// 0x0038 (0x0038 - 0x0000)
struct WB_TitleMainMenu_2_C_GetConvertText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_GetConvertText) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_GetConvertText");
static_assert(sizeof(WB_TitleMainMenu_2_C_GetConvertText) == 0x000038, "Wrong size on WB_TitleMainMenu_2_C_GetConvertText");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetConvertText, Text) == 0x000000, "Member 'WB_TitleMainMenu_2_C_GetConvertText::Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetConvertText, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WB_TitleMainMenu_2_C_GetConvertText::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetConvertText, CallFunc_GetTextByLabel_ReturnValue) == 0x000020, "Member 'WB_TitleMainMenu_2_C_GetConvertText::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.SetBigTextColor
// 0x0048 (0x0048 - 0x0000)
struct WB_TitleMainMenu_2_C_SetBigTextColor final
{
public:
	class UTextBlock*                             Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelectable;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EA8[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA9[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_SetBigTextColor) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_SetBigTextColor");
static_assert(sizeof(WB_TitleMainMenu_2_C_SetBigTextColor) == 0x000048, "Wrong size on WB_TitleMainMenu_2_C_SetBigTextColor");
static_assert(offsetof(WB_TitleMainMenu_2_C_SetBigTextColor, Text) == 0x000000, "Member 'WB_TitleMainMenu_2_C_SetBigTextColor::Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_SetBigTextColor, IsSelectable) == 0x000008, "Member 'WB_TitleMainMenu_2_C_SetBigTextColor::IsSelectable' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_SetBigTextColor, CallFunc_SelectColor_ReturnValue) == 0x00000C, "Member 'WB_TitleMainMenu_2_C_SetBigTextColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_SetBigTextColor, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'WB_TitleMainMenu_2_C_SetBigTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.ShowStart
// 0x00B8 (0x00B8 - 0x0000)
struct WB_TitleMainMenu_2_C_ShowStart final
{
public:
	TArray<E_TITLE_TOP_SELECTION>                 Selection;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          EnableContinue;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EAA[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentNum;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EAB[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSelectionText_ReturnValue;             // 0x0020(0x0018)()
	class FText                                   CallFunc_GetSelectionText_ReturnValue_1;           // 0x0038(0x0018)()
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EAC[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetVersionText_Text;                      // 0x0058(0x0018)()
	class FText                                   CallFunc_GetSelectionText_ReturnValue_2;           // 0x0070(0x0018)()
	class FText                                   CallFunc_GetSelectionText_ReturnValue_3;           // 0x0088(0x0018)()
	class FText                                   CallFunc_GetSelectionText_ReturnValue_4;           // 0x00A0(0x0018)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_ShowStart) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_ShowStart");
static_assert(sizeof(WB_TitleMainMenu_2_C_ShowStart) == 0x0000B8, "Wrong size on WB_TitleMainMenu_2_C_ShowStart");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, Selection) == 0x000000, "Member 'WB_TitleMainMenu_2_C_ShowStart::Selection' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, EnableContinue) == 0x000010, "Member 'WB_TitleMainMenu_2_C_ShowStart::EnableContinue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CurrentNum) == 0x000014, "Member 'WB_TitleMainMenu_2_C_ShowStart::CurrentNum' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00001D, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_GetSelectionText_ReturnValue) == 0x000020, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_GetSelectionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_GetSelectionText_ReturnValue_1) == 0x000038, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_GetSelectionText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_Play_ReturnValue) == 0x000050, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_GetVersionText_Text) == 0x000058, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_GetVersionText_Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_GetSelectionText_ReturnValue_2) == 0x000070, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_GetSelectionText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_GetSelectionText_ReturnValue_3) == 0x000088, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_GetSelectionText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_ShowStart, CallFunc_GetSelectionText_ReturnValue_4) == 0x0000A0, "Member 'WB_TitleMainMenu_2_C_ShowStart::CallFunc_GetSelectionText_ReturnValue_4' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.UpdateCursor
// 0x0050 (0x0050 - 0x0000)
struct WB_TitleMainMenu_2_C_UpdateCursor final
{
public:
	int32                                         InputPin;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Lo_HelpLabel;                                      // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EAD[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Get_Title_Menu_Pos_OutputPin;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Title_Menu_Pos_Output_Get;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EAE[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetHelpLabel_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_GetHelpWindow_m_HelpWindow;               // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ICommonHelpWindowIsOpened_OutFinished;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TitleMainMenu_2_C_UpdateCursor) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_UpdateCursor");
static_assert(sizeof(WB_TitleMainMenu_2_C_UpdateCursor) == 0x000050, "Wrong size on WB_TitleMainMenu_2_C_UpdateCursor");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, InputPin) == 0x000000, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::InputPin' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, Lo_HelpLabel) == 0x000004, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::Lo_HelpLabel' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00000D, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00000E, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00000F, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000010, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_Get_Title_Menu_Pos_OutputPin) == 0x000014, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_Get_Title_Menu_Pos_OutputPin' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_Get_Title_Menu_Pos_Output_Get) == 0x000018, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_Get_Title_Menu_Pos_Output_Get' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_MakeVector2D_ReturnValue) == 0x00001C, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_Play_ReturnValue) == 0x000024, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_GetHelpLabel_ReturnValue) == 0x000028, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_GetHelpLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_GetHelpWindow_m_HelpWindow) == 0x000038, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_GetHelpWindow_m_HelpWindow' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_UpdateCursor, CallFunc_ICommonHelpWindowIsOpened_OutFinished) == 0x000048, "Member 'WB_TitleMainMenu_2_C_UpdateCursor::CallFunc_ICommonHelpWindowIsOpened_OutFinished' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.CloseCommonWindow
// 0x0010 (0x0010 - 0x0000)
struct WB_TitleMainMenu_2_C_CloseCommonWindow final
{
public:
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_GetHelpWindow_m_HelpWindow;               // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TitleMainMenu_2_C_CloseCommonWindow) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_CloseCommonWindow");
static_assert(sizeof(WB_TitleMainMenu_2_C_CloseCommonWindow) == 0x000010, "Wrong size on WB_TitleMainMenu_2_C_CloseCommonWindow");
static_assert(offsetof(WB_TitleMainMenu_2_C_CloseCommonWindow, CallFunc_GetHelpWindow_m_HelpWindow) == 0x000000, "Member 'WB_TitleMainMenu_2_C_CloseCommonWindow::CallFunc_GetHelpWindow_m_HelpWindow' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.GetVersionText
// 0x0110 (0x0110 - 0x0000)
struct WB_TitleMainMenu_2_C_GetVersionText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	struct FDebugMenuItemData                     CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue; // 0x0018(0x00D0)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EAF[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTextByLabel_ReturnValue;               // 0x00F8(0x0018)()
};
static_assert(alignof(WB_TitleMainMenu_2_C_GetVersionText) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_GetVersionText");
static_assert(sizeof(WB_TitleMainMenu_2_C_GetVersionText) == 0x000110, "Wrong size on WB_TitleMainMenu_2_C_GetVersionText");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetVersionText, Text) == 0x000000, "Member 'WB_TitleMainMenu_2_C_GetVersionText::Text' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetVersionText, CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue) == 0x000018, "Member 'WB_TitleMainMenu_2_C_GetVersionText::CallFunc_GetDebugMenuItemFromPathName_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetVersionText, CallFunc_MakeLiteralName_ReturnValue) == 0x0000E8, "Member 'WB_TitleMainMenu_2_C_GetVersionText::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetVersionText, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F0, "Member 'WB_TitleMainMenu_2_C_GetVersionText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetVersionText, CallFunc_GetTextByLabel_ReturnValue) == 0x0000F8, "Member 'WB_TitleMainMenu_2_C_GetVersionText::CallFunc_GetTextByLabel_ReturnValue' has a wrong offset!");

// Function WB_TitleMainMenu_2.WB_TitleMainMenu_2_C.GetHelpWindow
// 0x0060 (0x0060 - 0x0000)
struct WB_TitleMainMenu_2_C_GetHelpWindow final
{
public:
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> Param_M_HelpWindow;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EB0[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProjectUIManager*                      CallFunc_BPI_GetUIManager_UIManager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UIManager_C>      K2Node_DynamicCast_AsBPI_UIManager_1;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EB1[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CommonHelpWindowCtrl_C> CallFunc_BPI_GetCommonHelpWindowCtrl_OutActor;     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TitleMainMenu_2_C_GetHelpWindow) == 0x000008, "Wrong alignment on WB_TitleMainMenu_2_C_GetHelpWindow");
static_assert(sizeof(WB_TitleMainMenu_2_C_GetHelpWindow) == 0x000060, "Wrong size on WB_TitleMainMenu_2_C_GetHelpWindow");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetHelpWindow, Param_M_HelpWindow) == 0x000000, "Member 'WB_TitleMainMenu_2_C_GetHelpWindow::Param_M_HelpWindow' has a wrong offset!");
static_assert(offsetof(WB_TitleMainMenu_2_C_GetHelpWindow, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'WB_TitleMainMenu_2_C_GetHelpWindow::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
