#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TransportList2

#include "Basic.hpp"

#include "E_TRANSPORT_LIST_HEADER_TYPE_structs.hpp"
#include "E_SORTWINDOW_ANIM_STATE_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TransportList2.WB_TransportList2_C
// 0x0088 (0x02E8 - 0x0260)
class UWB_TransportList2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_Base;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_CheckScroll;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_ListHeader;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_Pos;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayer_ScrollBar;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ScrollBar_C*                        WB_ScrollBar;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Transport_LocationSlotList2_C*      WB_SlotList;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_TRANSPORT_LIST_HEADER_TYPE                  HeaderType;                                        // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1315[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimPlayRate;                                      // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_TRANSPORT_LIST_HEADER_TYPE                  Debug_HeaderType;                                  // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1316[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Debug_CursorSlotIdx;                               // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Debug_AppliedSlotIdx;                              // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1317[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MouseEvent_OnHovered;                              // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             MouseEvent_OnClicked;                              // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             MouseEvent_DraggedScrollBar;                       // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void MouseEvent_OnHovered__DelegateSignature(int32 SlotIdx);
	void MouseEvent_OnClicked__DelegateSignature(int32 SlotIdx);
	void MouseEvent_DraggedScrollBar__DelegateSignature(float ScrollRate);
	void ExecuteUbergraph_WB_TransportList2(int32 EntryPoint);
	void Destruct();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Init();
	void GetSlotMaxNum(int32* SlotMaxNum);
	void GetAnimState(E_SORTWINDOW_ANIM_STATE* AinmState);
	void SetAnimState(E_SORTWINDOW_ANIM_STATE InState);
	void Tick_Base();
	void Tick_In();
	void Tick_Out();
	void SetSlotListInfo(TArray<struct FTransportLocationSlotInfo>& InListInfo2, bool IsUpdateAnim);
	void SetHeaderType(E_TRANSPORT_LIST_HEADER_TYPE InHeaderType);
	void GetCursorIdx(int32* CursorIdx);
	void SetCursorIdx(int32 InSlotIdx, bool IsUpdateAnim);
	void CursorMove_Up();
	void CursorMove_Down();
	void CursorMove_Top();
	void CursorMove_Bottom();
	void CheckCursorPosAndSkipListIn();
	void SetScrollBarRate(float InScrollRate);
	void SetScrollbarVisibility(bool IsVisibleScrollBar);
	void SetAppliedSlotIdx(int32 InSlotIdx, bool IsUpdateAnim);
	void BindMouseInputEvent();
	void GetAppliedSlotIdx(int32* CursorIdx);
	void UnbindMouseInputEvent();
	void OnHoveredSlot_ByMouse(int32 InSlotIdx);
	void OnClickedSlot_ByMouse(int32 InSlotIdx);
	void OnDraggedScrollBar_ByMouse(float InScrollRate);
	void IsEnableMouseWheel(bool* IsEnableScroll);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TransportList2_C">();
	}
	static class UWB_TransportList2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TransportList2_C>();
	}
};
static_assert(alignof(UWB_TransportList2_C) == 0x000008, "Wrong alignment on UWB_TransportList2_C");
static_assert(sizeof(UWB_TransportList2_C) == 0x0002E8, "Wrong size on UWB_TransportList2_C");
static_assert(offsetof(UWB_TransportList2_C, UberGraphFrame) == 0x000260, "Member 'UWB_TransportList2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, Canvas_Base) == 0x000268, "Member 'UWB_TransportList2_C::Canvas_Base' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, Canvas_CheckScroll) == 0x000270, "Member 'UWB_TransportList2_C::Canvas_CheckScroll' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, SsPlayer_ListHeader) == 0x000278, "Member 'UWB_TransportList2_C::SsPlayer_ListHeader' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, SsPlayer_Pos) == 0x000280, "Member 'UWB_TransportList2_C::SsPlayer_Pos' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, SsPlayer_ScrollBar) == 0x000288, "Member 'UWB_TransportList2_C::SsPlayer_ScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, WB_ScrollBar) == 0x000290, "Member 'UWB_TransportList2_C::WB_ScrollBar' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, WB_SlotList) == 0x000298, "Member 'UWB_TransportList2_C::WB_SlotList' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, HeaderType) == 0x0002A0, "Member 'UWB_TransportList2_C::HeaderType' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, AnimPlayRate) == 0x0002A4, "Member 'UWB_TransportList2_C::AnimPlayRate' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, Debug_HeaderType) == 0x0002A8, "Member 'UWB_TransportList2_C::Debug_HeaderType' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, Debug_CursorSlotIdx) == 0x0002AC, "Member 'UWB_TransportList2_C::Debug_CursorSlotIdx' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, Debug_AppliedSlotIdx) == 0x0002B0, "Member 'UWB_TransportList2_C::Debug_AppliedSlotIdx' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, MouseEvent_OnHovered) == 0x0002B8, "Member 'UWB_TransportList2_C::MouseEvent_OnHovered' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, MouseEvent_OnClicked) == 0x0002C8, "Member 'UWB_TransportList2_C::MouseEvent_OnClicked' has a wrong offset!");
static_assert(offsetof(UWB_TransportList2_C, MouseEvent_DraggedScrollBar) == 0x0002D8, "Member 'UWB_TransportList2_C::MouseEvent_DraggedScrollBar' has a wrong offset!");

}

