#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TitleBack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TitleBack.WB_TitleBack_C
// 0x0018 (0x0278 - 0x0260)
class UWB_TitleBack_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BGItemMovie;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGMovie;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_TitleBack(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ChangeBG(bool MenuBG, bool ItemBG);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TitleBack_C">();
	}
	static class UWB_TitleBack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TitleBack_C>();
	}
};
static_assert(alignof(UWB_TitleBack_C) == 0x000008, "Wrong alignment on UWB_TitleBack_C");
static_assert(sizeof(UWB_TitleBack_C) == 0x000278, "Wrong size on UWB_TitleBack_C");
static_assert(offsetof(UWB_TitleBack_C, UberGraphFrame) == 0x000260, "Member 'UWB_TitleBack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_TitleBack_C, Image_BGItemMovie) == 0x000268, "Member 'UWB_TitleBack_C::Image_BGItemMovie' has a wrong offset!");
static_assert(offsetof(UWB_TitleBack_C, Image_BGMovie) == 0x000270, "Member 'UWB_TitleBack_C::Image_BGMovie' has a wrong offset!");

}

