#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TurnChange

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TurnChange.WB_TurnChange_C
// 0x0020 (0x0280 - 0x0260)
class UWB_TurnChange_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USsPlayerWidget*                        SsPlayer_Turn;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFinishedTurnChange;                              // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnFinishedTurnChange__DelegateSignature();
	void ExecuteUbergraph_WB_TurnChange(int32 EntryPoint);
	void BndEvt__SsPlayer_Turn_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void Construct();
	void Play(bool IsPlayer, float PlayRate);
	void IsPlaying(bool* Playing);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TurnChange_C">();
	}
	static class UWB_TurnChange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TurnChange_C>();
	}
};
static_assert(alignof(UWB_TurnChange_C) == 0x000008, "Wrong alignment on UWB_TurnChange_C");
static_assert(sizeof(UWB_TurnChange_C) == 0x000280, "Wrong size on UWB_TurnChange_C");
static_assert(offsetof(UWB_TurnChange_C, UberGraphFrame) == 0x000260, "Member 'UWB_TurnChange_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_TurnChange_C, SsPlayer_Turn) == 0x000268, "Member 'UWB_TurnChange_C::SsPlayer_Turn' has a wrong offset!");
static_assert(offsetof(UWB_TurnChange_C, OnFinishedTurnChange) == 0x000270, "Member 'UWB_TurnChange_C::OnFinishedTurnChange' has a wrong offset!");

}

