#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Transport_LocationSlot2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.MouseEvent_OnHovered__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_Transport_LocationSlot2_C_MouseEvent_OnHovered__DelegateSignature final
{
public:
	int32                                         SlotIdx;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_MouseEvent_OnHovered__DelegateSignature) == 0x000004, "Wrong alignment on WB_Transport_LocationSlot2_C_MouseEvent_OnHovered__DelegateSignature");
static_assert(sizeof(WB_Transport_LocationSlot2_C_MouseEvent_OnHovered__DelegateSignature) == 0x000004, "Wrong size on WB_Transport_LocationSlot2_C_MouseEvent_OnHovered__DelegateSignature");
static_assert(offsetof(WB_Transport_LocationSlot2_C_MouseEvent_OnHovered__DelegateSignature, SlotIdx) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_MouseEvent_OnHovered__DelegateSignature::SlotIdx' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.MouseEvent_OnClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_Transport_LocationSlot2_C_MouseEvent_OnClicked__DelegateSignature final
{
public:
	int32                                         SlotIdx;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_MouseEvent_OnClicked__DelegateSignature) == 0x000004, "Wrong alignment on WB_Transport_LocationSlot2_C_MouseEvent_OnClicked__DelegateSignature");
static_assert(sizeof(WB_Transport_LocationSlot2_C_MouseEvent_OnClicked__DelegateSignature) == 0x000004, "Wrong size on WB_Transport_LocationSlot2_C_MouseEvent_OnClicked__DelegateSignature");
static_assert(offsetof(WB_Transport_LocationSlot2_C_MouseEvent_OnClicked__DelegateSignature, SlotIdx) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_MouseEvent_OnClicked__DelegateSignature::SlotIdx' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.ExecuteUbergraph_WB_Transport_LocationSlot2
// 0x0034 (0x0034 - 0x0000)
struct WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DED9[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEDA[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_ComponentBoundEvent_Pos;                    // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_ComponentBoundEvent_UV;                     // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2) == 0x000004, "Wrong alignment on WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2");
static_assert(sizeof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2) == 0x000034, "Wrong size on WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, EntryPoint) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, K2Node_ComponentBoundEvent_AnimPackName) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, K2Node_ComponentBoundEvent_AnimationName) == 0x000010, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000018, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, K2Node_ComponentBoundEvent_AnimationIndex) == 0x00001C, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, K2Node_SwitchName_CmpSuccess) == 0x000020, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, K2Node_ComponentBoundEvent_Pos) == 0x000024, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::K2Node_ComponentBoundEvent_Pos' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2, K2Node_ComponentBoundEvent_UV) == 0x00002C, "Member 'WB_Transport_LocationSlot2_C_ExecuteUbergraph_WB_Transport_LocationSlot2::K2Node_ComponentBoundEvent_UV' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UV;                                                // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000004, "Wrong alignment on WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(sizeof(WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature) == 0x000010, "Wrong size on WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature");
static_assert(offsetof(WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, Pos) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::Pos' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature, UV) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_BndEvt__WB_Transport_LocationSlot2_Button_Slot_K2Node_ComponentBoundEvent_1_ButtonClickEventS5__DelegateSignature::UV' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_Transport_LocationSlot2_C_BndEvt__WB_SortWindowtSlot2_SsPlayer_SlotBase_K2Node_ComponentBoundEvent_0_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Transport_LocationSlot2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_PreConstruct) == 0x000001, "Wrong alignment on WB_Transport_LocationSlot2_C_PreConstruct");
static_assert(sizeof(WB_Transport_LocationSlot2_C_PreConstruct) == 0x000001, "Wrong size on WB_Transport_LocationSlot2_C_PreConstruct");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.UpdateSlotAnim
// 0x0120 (0x0120 - 0x0000)
struct WB_Transport_LocationSlot2_C_UpdateSlotAnim final
{
public:
	float                                         L_AnimPlayFrame;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DEDB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 L_AnimCategory;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0068(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEDC[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00C0(0x0028)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEDD[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_UpdateSlotAnim) == 0x000008, "Wrong alignment on WB_Transport_LocationSlot2_C_UpdateSlotAnim");
static_assert(sizeof(WB_Transport_LocationSlot2_C_UpdateSlotAnim) == 0x000120, "Wrong size on WB_Transport_LocationSlot2_C_UpdateSlotAnim");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, L_AnimPlayFrame) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::L_AnimPlayFrame' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, L_AnimCategory) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::L_AnimCategory' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, K2Node_MakeStruct_SlateColor_2) == 0x000068, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Conv_StringToName_ReturnValue) == 0x0000A0, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Play_ReturnValue) == 0x0000A8, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, K2Node_MakeStruct_SlateColor_3) == 0x0000C0, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000E8, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Play_ReturnValue_1) == 0x0000F0, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_GetPlayFrame_ReturnValue) == 0x0000F4, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000F8, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000108, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000110, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000118, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, CallFunc_Play_ReturnValue_2) == 0x000119, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateSlotAnim, K2Node_SwitchName_CmpSuccess) == 0x00011A, "Member 'WB_Transport_LocationSlot2_C_UpdateSlotAnim::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.UpdateCursorAnim
// 0x001C (0x001C - 0x0000)
struct WB_Transport_LocationSlot2_C_UpdateCursorAnim final
{
public:
	class FName                                   L_AnimName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayFrame_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEDE[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSlotAssignAnim_AnimationName;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSlotAssignAnim_IsPlaying;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_UpdateCursorAnim) == 0x000004, "Wrong alignment on WB_Transport_LocationSlot2_C_UpdateCursorAnim");
static_assert(sizeof(WB_Transport_LocationSlot2_C_UpdateCursorAnim) == 0x00001C, "Wrong size on WB_Transport_LocationSlot2_C_UpdateCursorAnim");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateCursorAnim, L_AnimName) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_UpdateCursorAnim::L_AnimName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateCursorAnim, CallFunc_GetPlayFrame_ReturnValue) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_UpdateCursorAnim::CallFunc_GetPlayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateCursorAnim, CallFunc_Play_ReturnValue) == 0x00000C, "Member 'WB_Transport_LocationSlot2_C_UpdateCursorAnim::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateCursorAnim, CallFunc_GetSlotAssignAnim_AnimationName) == 0x000010, "Member 'WB_Transport_LocationSlot2_C_UpdateCursorAnim::CallFunc_GetSlotAssignAnim_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateCursorAnim, CallFunc_GetSlotAssignAnim_IsPlaying) == 0x000018, "Member 'WB_Transport_LocationSlot2_C_UpdateCursorAnim::CallFunc_GetSlotAssignAnim_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_UpdateCursorAnim, K2Node_SwitchName_CmpSuccess) == 0x000019, "Member 'WB_Transport_LocationSlot2_C_UpdateCursorAnim::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.PlayAnim_Setup
// 0x0001 (0x0001 - 0x0000)
struct WB_Transport_LocationSlot2_C_PlayAnim_Setup final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_PlayAnim_Setup) == 0x000001, "Wrong alignment on WB_Transport_LocationSlot2_C_PlayAnim_Setup");
static_assert(sizeof(WB_Transport_LocationSlot2_C_PlayAnim_Setup) == 0x000001, "Wrong size on WB_Transport_LocationSlot2_C_PlayAnim_Setup");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Setup, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Setup::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.PlayAnim_In
// 0x00B0 (0x00B0 - 0x0000)
struct WB_Transport_LocationSlot2_C_PlayAnim_In final
{
public:
	class FName                                   L_AnimName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEDF[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0088(0x0028)()
};
static_assert(alignof(WB_Transport_LocationSlot2_C_PlayAnim_In) == 0x000008, "Wrong alignment on WB_Transport_LocationSlot2_C_PlayAnim_In");
static_assert(sizeof(WB_Transport_LocationSlot2_C_PlayAnim_In) == 0x0000B0, "Wrong size on WB_Transport_LocationSlot2_C_PlayAnim_In");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_In, L_AnimName) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_In::L_AnimName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_In, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_In::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_In, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_In::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_In, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_In::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_In, CallFunc_Play_ReturnValue) == 0x000080, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_In::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_In, K2Node_MakeStruct_SlateColor_3) == 0x000088, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_In::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.PlayAnim_Loop
// 0x00B0 (0x00B0 - 0x0000)
struct WB_Transport_LocationSlot2_C_PlayAnim_Loop final
{
public:
	class FName                                   L_AnimName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEE0[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0088(0x0028)()
};
static_assert(alignof(WB_Transport_LocationSlot2_C_PlayAnim_Loop) == 0x000008, "Wrong alignment on WB_Transport_LocationSlot2_C_PlayAnim_Loop");
static_assert(sizeof(WB_Transport_LocationSlot2_C_PlayAnim_Loop) == 0x0000B0, "Wrong size on WB_Transport_LocationSlot2_C_PlayAnim_Loop");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Loop, L_AnimName) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Loop::L_AnimName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Loop, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Loop::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Loop, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Loop::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Loop, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Loop::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Loop, CallFunc_Play_ReturnValue) == 0x000080, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Loop::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Loop, K2Node_MakeStruct_SlateColor_3) == 0x000088, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Loop::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.PlayAnim_Out
// 0x00B0 (0x00B0 - 0x0000)
struct WB_Transport_LocationSlot2_C_PlayAnim_Out final
{
public:
	class FName                                   L_AnimName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEE1[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0088(0x0028)()
};
static_assert(alignof(WB_Transport_LocationSlot2_C_PlayAnim_Out) == 0x000008, "Wrong alignment on WB_Transport_LocationSlot2_C_PlayAnim_Out");
static_assert(sizeof(WB_Transport_LocationSlot2_C_PlayAnim_Out) == 0x0000B0, "Wrong size on WB_Transport_LocationSlot2_C_PlayAnim_Out");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Out, L_AnimName) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Out::L_AnimName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Out, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Out::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Out, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Out::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Out, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Out::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Out, CallFunc_Play_ReturnValue) == 0x000080, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Out::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_PlayAnim_Out, K2Node_MakeStruct_SlateColor_3) == 0x000088, "Member 'WB_Transport_LocationSlot2_C_PlayAnim_Out::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.SetTextInfo
// 0x0018 (0x0018 - 0x0000)
struct WB_Transport_LocationSlot2_C_SetTextInfo final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_SetTextInfo) == 0x000008, "Wrong alignment on WB_Transport_LocationSlot2_C_SetTextInfo");
static_assert(sizeof(WB_Transport_LocationSlot2_C_SetTextInfo) == 0x000018, "Wrong size on WB_Transport_LocationSlot2_C_SetTextInfo");
static_assert(offsetof(WB_Transport_LocationSlot2_C_SetTextInfo, InText) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_SetTextInfo::InText' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.SetSlotState_IsActive
// 0x0002 (0x0002 - 0x0000)
struct WB_Transport_LocationSlot2_C_SetSlotState_IsActive final
{
public:
	bool                                          Param_IsActiveSlot;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UpdateAnim;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_SetSlotState_IsActive) == 0x000001, "Wrong alignment on WB_Transport_LocationSlot2_C_SetSlotState_IsActive");
static_assert(sizeof(WB_Transport_LocationSlot2_C_SetSlotState_IsActive) == 0x000002, "Wrong size on WB_Transport_LocationSlot2_C_SetSlotState_IsActive");
static_assert(offsetof(WB_Transport_LocationSlot2_C_SetSlotState_IsActive, Param_IsActiveSlot) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_SetSlotState_IsActive::Param_IsActiveSlot' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_SetSlotState_IsActive, UpdateAnim) == 0x000001, "Member 'WB_Transport_LocationSlot2_C_SetSlotState_IsActive::UpdateAnim' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.SetSlotState_IsApplied
// 0x0002 (0x0002 - 0x0000)
struct WB_Transport_LocationSlot2_C_SetSlotState_IsApplied final
{
public:
	bool                                          Param_IsAppliedSlot;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UpdateAnim;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_SetSlotState_IsApplied) == 0x000001, "Wrong alignment on WB_Transport_LocationSlot2_C_SetSlotState_IsApplied");
static_assert(sizeof(WB_Transport_LocationSlot2_C_SetSlotState_IsApplied) == 0x000002, "Wrong size on WB_Transport_LocationSlot2_C_SetSlotState_IsApplied");
static_assert(offsetof(WB_Transport_LocationSlot2_C_SetSlotState_IsApplied, Param_IsAppliedSlot) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_SetSlotState_IsApplied::Param_IsAppliedSlot' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_SetSlotState_IsApplied, UpdateAnim) == 0x000001, "Member 'WB_Transport_LocationSlot2_C_SetSlotState_IsApplied::UpdateAnim' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.SetCursorState
// 0x0002 (0x0002 - 0x0000)
struct WB_Transport_LocationSlot2_C_SetCursorState final
{
public:
	bool                                          Param_OnCursor;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UpdateAnim;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_SetCursorState) == 0x000001, "Wrong alignment on WB_Transport_LocationSlot2_C_SetCursorState");
static_assert(sizeof(WB_Transport_LocationSlot2_C_SetCursorState) == 0x000002, "Wrong size on WB_Transport_LocationSlot2_C_SetCursorState");
static_assert(offsetof(WB_Transport_LocationSlot2_C_SetCursorState, Param_OnCursor) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_SetCursorState::Param_OnCursor' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_SetCursorState, UpdateAnim) == 0x000001, "Member 'WB_Transport_LocationSlot2_C_SetCursorState::UpdateAnim' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.GetSlotAssignAnim
// 0x0020 (0x0020 - 0x0000)
struct WB_Transport_LocationSlot2_C_GetSlotAssignAnim final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaying;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DEE2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimPackName;  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPlayingAnimationName_OutAnimationName; // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_GetSlotAssignAnim) == 0x000004, "Wrong alignment on WB_Transport_LocationSlot2_C_GetSlotAssignAnim");
static_assert(sizeof(WB_Transport_LocationSlot2_C_GetSlotAssignAnim) == 0x000020, "Wrong size on WB_Transport_LocationSlot2_C_GetSlotAssignAnim");
static_assert(offsetof(WB_Transport_LocationSlot2_C_GetSlotAssignAnim, AnimationName) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_GetSlotAssignAnim::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_GetSlotAssignAnim, IsPlaying) == 0x000008, "Member 'WB_Transport_LocationSlot2_C_GetSlotAssignAnim::IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_GetSlotAssignAnim, CallFunc_GetPlayingAnimationName_OutAnimPackName) == 0x00000C, "Member 'WB_Transport_LocationSlot2_C_GetSlotAssignAnim::CallFunc_GetPlayingAnimationName_OutAnimPackName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_GetSlotAssignAnim, CallFunc_GetPlayingAnimationName_OutAnimationName) == 0x000014, "Member 'WB_Transport_LocationSlot2_C_GetSlotAssignAnim::CallFunc_GetPlayingAnimationName_OutAnimationName' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_GetSlotAssignAnim, CallFunc_IsPlaying_ReturnValue) == 0x00001C, "Member 'WB_Transport_LocationSlot2_C_GetSlotAssignAnim::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.GetCursorState
// 0x0001 (0x0001 - 0x0000)
struct WB_Transport_LocationSlot2_C_GetCursorState final
{
public:
	bool                                          Param_OnCursor;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_GetCursorState) == 0x000001, "Wrong alignment on WB_Transport_LocationSlot2_C_GetCursorState");
static_assert(sizeof(WB_Transport_LocationSlot2_C_GetCursorState) == 0x000001, "Wrong size on WB_Transport_LocationSlot2_C_GetCursorState");
static_assert(offsetof(WB_Transport_LocationSlot2_C_GetCursorState, Param_OnCursor) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_GetCursorState::Param_OnCursor' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.GetSlotState
// 0x0002 (0x0002 - 0x0000)
struct WB_Transport_LocationSlot2_C_GetSlotState final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsApplied;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_GetSlotState) == 0x000001, "Wrong alignment on WB_Transport_LocationSlot2_C_GetSlotState");
static_assert(sizeof(WB_Transport_LocationSlot2_C_GetSlotState) == 0x000002, "Wrong size on WB_Transport_LocationSlot2_C_GetSlotState");
static_assert(offsetof(WB_Transport_LocationSlot2_C_GetSlotState, IsActive) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_GetSlotState::IsActive' has a wrong offset!");
static_assert(offsetof(WB_Transport_LocationSlot2_C_GetSlotState, IsApplied) == 0x000001, "Member 'WB_Transport_LocationSlot2_C_GetSlotState::IsApplied' has a wrong offset!");

// Function WB_Transport_LocationSlot2.WB_Transport_LocationSlot2_C.SetAnimPlayRate
// 0x0004 (0x0004 - 0x0000)
struct WB_Transport_LocationSlot2_C_SetAnimPlayRate final
{
public:
	float                                         InAnimPlayRate;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Transport_LocationSlot2_C_SetAnimPlayRate) == 0x000004, "Wrong alignment on WB_Transport_LocationSlot2_C_SetAnimPlayRate");
static_assert(sizeof(WB_Transport_LocationSlot2_C_SetAnimPlayRate) == 0x000004, "Wrong size on WB_Transport_LocationSlot2_C_SetAnimPlayRate");
static_assert(offsetof(WB_Transport_LocationSlot2_C_SetAnimPlayRate, InAnimPlayRate) == 0x000000, "Member 'WB_Transport_LocationSlot2_C_SetAnimPlayRate::InAnimPlayRate' has a wrong offset!");

}

