#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TutorialWindow2

#include "Basic.hpp"

#include "ST_AmuletTutorialMsgInfo_structs.hpp"
#include "Project_structs.hpp"
#include "ST_IconHelpTutorial_MsgInfo_structs.hpp"
#include "E_AmuletTutorial_MsgType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "E_TutorialWindow_WidgetState_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.MouseEvent_MovedScrollBar__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WB_TutorialWindow2_C_MouseEvent_MovedScrollBar__DelegateSignature final
{
public:
	float                                         ScrollRate;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_MouseEvent_MovedScrollBar__DelegateSignature) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_MouseEvent_MovedScrollBar__DelegateSignature");
static_assert(sizeof(WB_TutorialWindow2_C_MouseEvent_MovedScrollBar__DelegateSignature) == 0x000004, "Wrong size on WB_TutorialWindow2_C_MouseEvent_MovedScrollBar__DelegateSignature");
static_assert(offsetof(WB_TutorialWindow2_C_MouseEvent_MovedScrollBar__DelegateSignature, ScrollRate) == 0x000000, "Member 'WB_TutorialWindow2_C_MouseEvent_MovedScrollBar__DelegateSignature::ScrollRate' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.ExecuteUbergraph_WB_TutorialWindow2
// 0x0044 (0x0044 - 0x0000)
struct WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_647E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2");
static_assert(sizeof(WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2) == 0x000044, "Wrong size on WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2");
static_assert(offsetof(WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2, EntryPoint) == 0x000000, "Member 'WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2, K2Node_Event_MyGeometry) == 0x000008, "Member 'WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WB_TutorialWindow2_C_ExecuteUbergraph_WB_TutorialWindow2::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_TutorialWindow2_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_Tick) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_Tick");
static_assert(sizeof(WB_TutorialWindow2_C_Tick) == 0x00003C, "Wrong size on WB_TutorialWindow2_C_Tick");
static_assert(offsetof(WB_TutorialWindow2_C_Tick, MyGeometry) == 0x000000, "Member 'WB_TutorialWindow2_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_TutorialWindow2_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_TutorialWindow2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_PreConstruct) == 0x000001, "Wrong alignment on WB_TutorialWindow2_C_PreConstruct");
static_assert(sizeof(WB_TutorialWindow2_C_PreConstruct) == 0x000001, "Wrong size on WB_TutorialWindow2_C_PreConstruct");
static_assert(offsetof(WB_TutorialWindow2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_TutorialWindow2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Init
// 0x00F8 (0x00F8 - 0x0000)
struct WB_TutorialWindow2_C_Init final
{
public:
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectUIManager*                      CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_647F[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASystemMess*                            CallFunc_GetSystemMess_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6480[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0048(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6481[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_KeyboardIcon_C>   CallFunc_BPI_SetKeyInfo_self_CastInput;            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_SetKeyInfo_Ret;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6482[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_KeyboardIcon_C>   CallFunc_BPI_SetIconSize_self_CastInput;           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_SetIconSize_Ret;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6483[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_KeyboardIcon_C>   CallFunc_BPI_SetIconColor_ByActiveState_self_CastInput; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_SetIconColor_ByActiveState_Ret;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6484[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float Position)>               K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6485[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00D0(0x0028)()
};
static_assert(alignof(WB_TutorialWindow2_C_Init) == 0x000008, "Wrong alignment on WB_TutorialWindow2_C_Init");
static_assert(sizeof(WB_TutorialWindow2_C_Init) == 0x0000F8, "Wrong size on WB_TutorialWindow2_C_Init");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000000, "Member 'WB_TutorialWindow2_C_Init::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_GetDesiredSize_ReturnValue) == 0x000010, "Member 'WB_TutorialWindow2_C_Init::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BreakVector2D_X_1) == 0x000018, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BreakVector2D_Y_1) == 0x00001C, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'WB_TutorialWindow2_C_Init::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'WB_TutorialWindow2_C_Init::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_Get_ReturnValue) == 0x000028, "Member 'WB_TutorialWindow2_C_Init::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000030, "Member 'WB_TutorialWindow2_C_Init::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_GetSystemMess_ReturnValue) == 0x000038, "Member 'WB_TutorialWindow2_C_Init::CallFunc_GetSystemMess_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_Abs_ReturnValue) == 0x000040, "Member 'WB_TutorialWindow2_C_Init::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_GetText_ReturnValue) == 0x000048, "Member 'WB_TutorialWindow2_C_Init::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000060, "Member 'WB_TutorialWindow2_C_Init::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, K2Node_MakeStruct_Margin) == 0x000064, "Member 'WB_TutorialWindow2_C_Init::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BPI_SetKeyInfo_self_CastInput) == 0x000078, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BPI_SetKeyInfo_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BPI_SetKeyInfo_Ret) == 0x000088, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BPI_SetKeyInfo_Ret' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BPI_SetIconSize_self_CastInput) == 0x000090, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BPI_SetIconSize_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BPI_SetIconSize_Ret) == 0x0000A0, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BPI_SetIconSize_Ret' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BPI_SetIconColor_ByActiveState_self_CastInput) == 0x0000A8, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BPI_SetIconColor_ByActiveState_self_CastInput' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, CallFunc_BPI_SetIconColor_ByActiveState_Ret) == 0x0000B8, "Member 'WB_TutorialWindow2_C_Init::CallFunc_BPI_SetIconColor_ByActiveState_Ret' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'WB_TutorialWindow2_C_Init::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Init, K2Node_MakeStruct_SlateColor) == 0x0000D0, "Member 'WB_TutorialWindow2_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.GetAnimState
// 0x0001 (0x0001 - 0x0000)
struct WB_TutorialWindow2_C_GetAnimState final
{
public:
	E_TutorialWindow_WidgetState                  Param_AnimState;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_GetAnimState) == 0x000001, "Wrong alignment on WB_TutorialWindow2_C_GetAnimState");
static_assert(sizeof(WB_TutorialWindow2_C_GetAnimState) == 0x000001, "Wrong size on WB_TutorialWindow2_C_GetAnimState");
static_assert(offsetof(WB_TutorialWindow2_C_GetAnimState, Param_AnimState) == 0x000000, "Member 'WB_TutorialWindow2_C_GetAnimState::Param_AnimState' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.SetAnimState
// 0x000A (0x000A - 0x0000)
struct WB_TutorialWindow2_C_SetAnimState final
{
public:
	E_TutorialWindow_WidgetState                  InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_5;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_6;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_7;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_SetAnimState) == 0x000001, "Wrong alignment on WB_TutorialWindow2_C_SetAnimState");
static_assert(sizeof(WB_TutorialWindow2_C_SetAnimState) == 0x00000A, "Wrong size on WB_TutorialWindow2_C_SetAnimState");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, InState) == 0x000000, "Member 'WB_TutorialWindow2_C_SetAnimState::InState' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WB_TutorialWindow2_C_SetAnimState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, CallFunc_Play_ReturnValue) == 0x000002, "Member 'WB_TutorialWindow2_C_SetAnimState::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, CallFunc_Play_ReturnValue_1) == 0x000003, "Member 'WB_TutorialWindow2_C_SetAnimState::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, CallFunc_Play_ReturnValue_2) == 0x000004, "Member 'WB_TutorialWindow2_C_SetAnimState::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, CallFunc_Play_ReturnValue_3) == 0x000005, "Member 'WB_TutorialWindow2_C_SetAnimState::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, CallFunc_Play_ReturnValue_4) == 0x000006, "Member 'WB_TutorialWindow2_C_SetAnimState::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, CallFunc_Play_ReturnValue_5) == 0x000007, "Member 'WB_TutorialWindow2_C_SetAnimState::CallFunc_Play_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, CallFunc_Play_ReturnValue_6) == 0x000008, "Member 'WB_TutorialWindow2_C_SetAnimState::CallFunc_Play_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetAnimState, CallFunc_Play_ReturnValue_7) == 0x000009, "Member 'WB_TutorialWindow2_C_SetAnimState::CallFunc_Play_ReturnValue_7' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Tick_Base
// 0x0001 (0x0001 - 0x0000)
struct WB_TutorialWindow2_C_Tick_Base final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_Tick_Base) == 0x000001, "Wrong alignment on WB_TutorialWindow2_C_Tick_Base");
static_assert(sizeof(WB_TutorialWindow2_C_Tick_Base) == 0x000001, "Wrong size on WB_TutorialWindow2_C_Tick_Base");
static_assert(offsetof(WB_TutorialWindow2_C_Tick_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WB_TutorialWindow2_C_Tick_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Tick_FrameIn
// 0x0001 (0x0001 - 0x0000)
struct WB_TutorialWindow2_C_Tick_FrameIn final
{
public:
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_Tick_FrameIn) == 0x000001, "Wrong alignment on WB_TutorialWindow2_C_Tick_FrameIn");
static_assert(sizeof(WB_TutorialWindow2_C_Tick_FrameIn) == 0x000001, "Wrong size on WB_TutorialWindow2_C_Tick_FrameIn");
static_assert(offsetof(WB_TutorialWindow2_C_Tick_FrameIn, CallFunc_IsPlaying_ReturnValue) == 0x000000, "Member 'WB_TutorialWindow2_C_Tick_FrameIn::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Tick_FrameOut
// 0x0001 (0x0001 - 0x0000)
struct WB_TutorialWindow2_C_Tick_FrameOut final
{
public:
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_Tick_FrameOut) == 0x000001, "Wrong alignment on WB_TutorialWindow2_C_Tick_FrameOut");
static_assert(sizeof(WB_TutorialWindow2_C_Tick_FrameOut) == 0x000001, "Wrong size on WB_TutorialWindow2_C_Tick_FrameOut");
static_assert(offsetof(WB_TutorialWindow2_C_Tick_FrameOut, CallFunc_IsPlaying_ReturnValue) == 0x000000, "Member 'WB_TutorialWindow2_C_Tick_FrameOut::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.GetScrollState
// 0x0018 (0x0018 - 0x0000)
struct WB_TutorialWindow2_C_GetScrollState final
{
public:
	bool                                          IsRequiredScroll;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6486[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollPosRate;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScrollOffset;                                      // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollPosRate_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScrollOffset_ScrollOffset;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequiredScroll_RequiredScroll;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_GetScrollState) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_GetScrollState");
static_assert(sizeof(WB_TutorialWindow2_C_GetScrollState) == 0x000018, "Wrong size on WB_TutorialWindow2_C_GetScrollState");
static_assert(offsetof(WB_TutorialWindow2_C_GetScrollState, IsRequiredScroll) == 0x000000, "Member 'WB_TutorialWindow2_C_GetScrollState::IsRequiredScroll' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_GetScrollState, ScrollPosRate) == 0x000004, "Member 'WB_TutorialWindow2_C_GetScrollState::ScrollPosRate' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_GetScrollState, ScrollOffset) == 0x000008, "Member 'WB_TutorialWindow2_C_GetScrollState::ScrollOffset' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_GetScrollState, CallFunc_GetScrollPosRate_ReturnValue) == 0x00000C, "Member 'WB_TutorialWindow2_C_GetScrollState::CallFunc_GetScrollPosRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_GetScrollState, CallFunc_GetScrollOffset_ScrollOffset) == 0x000010, "Member 'WB_TutorialWindow2_C_GetScrollState::CallFunc_GetScrollOffset_ScrollOffset' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_GetScrollState, CallFunc_IsRequiredScroll_RequiredScroll) == 0x000014, "Member 'WB_TutorialWindow2_C_GetScrollState::CallFunc_IsRequiredScroll_RequiredScroll' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.GetMaxScrollOffset
// 0x0008 (0x0008 - 0x0000)
struct WB_TutorialWindow2_C_GetMaxScrollOffset final
{
public:
	int32                                         MaxOffset;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxScrollOffset_MaxOffset;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_GetMaxScrollOffset) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_GetMaxScrollOffset");
static_assert(sizeof(WB_TutorialWindow2_C_GetMaxScrollOffset) == 0x000008, "Wrong size on WB_TutorialWindow2_C_GetMaxScrollOffset");
static_assert(offsetof(WB_TutorialWindow2_C_GetMaxScrollOffset, MaxOffset) == 0x000000, "Member 'WB_TutorialWindow2_C_GetMaxScrollOffset::MaxOffset' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_GetMaxScrollOffset, CallFunc_GetMaxScrollOffset_MaxOffset) == 0x000004, "Member 'WB_TutorialWindow2_C_GetMaxScrollOffset::CallFunc_GetMaxScrollOffset_MaxOffset' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.SetScrollOffset
// 0x0020 (0x0020 - 0x0000)
struct WB_TutorialWindow2_C_SetScrollOffset final
{
public:
	int32                                         InScrollOffset;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsScrolled;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6487[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_oldScrollRate;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollPosRate_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6488[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequiredScroll_RequiredScroll;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6489[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_2;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_SetScrollOffset) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_SetScrollOffset");
static_assert(sizeof(WB_TutorialWindow2_C_SetScrollOffset) == 0x000020, "Wrong size on WB_TutorialWindow2_C_SetScrollOffset");
static_assert(offsetof(WB_TutorialWindow2_C_SetScrollOffset, InScrollOffset) == 0x000000, "Member 'WB_TutorialWindow2_C_SetScrollOffset::InScrollOffset' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetScrollOffset, IsScrolled) == 0x000004, "Member 'WB_TutorialWindow2_C_SetScrollOffset::IsScrolled' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetScrollOffset, L_oldScrollRate) == 0x000008, "Member 'WB_TutorialWindow2_C_SetScrollOffset::L_oldScrollRate' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetScrollOffset, CallFunc_GetScrollPosRate_ReturnValue) == 0x00000C, "Member 'WB_TutorialWindow2_C_SetScrollOffset::CallFunc_GetScrollPosRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetScrollOffset, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'WB_TutorialWindow2_C_SetScrollOffset::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetScrollOffset, CallFunc_GetScrollPosRate_ReturnValue_1) == 0x000014, "Member 'WB_TutorialWindow2_C_SetScrollOffset::CallFunc_GetScrollPosRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetScrollOffset, CallFunc_IsRequiredScroll_RequiredScroll) == 0x000018, "Member 'WB_TutorialWindow2_C_SetScrollOffset::CallFunc_IsRequiredScroll_RequiredScroll' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetScrollOffset, CallFunc_GetScrollPosRate_ReturnValue_2) == 0x00001C, "Member 'WB_TutorialWindow2_C_SetScrollOffset::CallFunc_GetScrollPosRate_ReturnValue_2' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Scroll_Up
// 0x0020 (0x0020 - 0x0000)
struct WB_TutorialWindow2_C_Scroll_Up final
{
public:
	bool                                          IsScrolled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_oldScrollRate;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648B[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequiredScroll_RequiredScroll;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648D[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_2;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_Scroll_Up) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_Scroll_Up");
static_assert(sizeof(WB_TutorialWindow2_C_Scroll_Up) == 0x000020, "Wrong size on WB_TutorialWindow2_C_Scroll_Up");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, IsScrolled) == 0x000000, "Member 'WB_TutorialWindow2_C_Scroll_Up::IsScrolled' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, L_oldScrollRate) == 0x000004, "Member 'WB_TutorialWindow2_C_Scroll_Up::L_oldScrollRate' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_TutorialWindow2_C_Scroll_Up::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, CallFunc_GetScrollPosRate_ReturnValue) == 0x00000C, "Member 'WB_TutorialWindow2_C_Scroll_Up::CallFunc_GetScrollPosRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'WB_TutorialWindow2_C_Scroll_Up::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, CallFunc_GetScrollPosRate_ReturnValue_1) == 0x000014, "Member 'WB_TutorialWindow2_C_Scroll_Up::CallFunc_GetScrollPosRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, CallFunc_IsRequiredScroll_RequiredScroll) == 0x000018, "Member 'WB_TutorialWindow2_C_Scroll_Up::CallFunc_IsRequiredScroll_RequiredScroll' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WB_TutorialWindow2_C_Scroll_Up::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Up, CallFunc_GetScrollPosRate_ReturnValue_2) == 0x00001C, "Member 'WB_TutorialWindow2_C_Scroll_Up::CallFunc_GetScrollPosRate_ReturnValue_2' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Scroll_Down
// 0x0020 (0x0020 - 0x0000)
struct WB_TutorialWindow2_C_Scroll_Down final
{
public:
	bool                                          IsScrolled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_oldScrollRate;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648F[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6490[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequiredScroll_RequiredScroll;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6491[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_2;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_Scroll_Down) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_Scroll_Down");
static_assert(sizeof(WB_TutorialWindow2_C_Scroll_Down) == 0x000020, "Wrong size on WB_TutorialWindow2_C_Scroll_Down");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, IsScrolled) == 0x000000, "Member 'WB_TutorialWindow2_C_Scroll_Down::IsScrolled' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, L_oldScrollRate) == 0x000004, "Member 'WB_TutorialWindow2_C_Scroll_Down::L_oldScrollRate' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_TutorialWindow2_C_Scroll_Down::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, CallFunc_GetScrollPosRate_ReturnValue) == 0x00000C, "Member 'WB_TutorialWindow2_C_Scroll_Down::CallFunc_GetScrollPosRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'WB_TutorialWindow2_C_Scroll_Down::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, CallFunc_GetScrollPosRate_ReturnValue_1) == 0x000014, "Member 'WB_TutorialWindow2_C_Scroll_Down::CallFunc_GetScrollPosRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, CallFunc_IsRequiredScroll_RequiredScroll) == 0x000018, "Member 'WB_TutorialWindow2_C_Scroll_Down::CallFunc_IsRequiredScroll_RequiredScroll' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WB_TutorialWindow2_C_Scroll_Down::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Scroll_Down, CallFunc_GetScrollPosRate_ReturnValue_2) == 0x00001C, "Member 'WB_TutorialWindow2_C_Scroll_Down::CallFunc_GetScrollPosRate_ReturnValue_2' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Page_Up
// 0x0020 (0x0020 - 0x0000)
struct WB_TutorialWindow2_C_Page_Up final
{
public:
	bool                                          IsScrolled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6492[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_oldScrollRate;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6493[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6494[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequiredScroll_RequiredScroll;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6495[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_2;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_Page_Up) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_Page_Up");
static_assert(sizeof(WB_TutorialWindow2_C_Page_Up) == 0x000020, "Wrong size on WB_TutorialWindow2_C_Page_Up");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, IsScrolled) == 0x000000, "Member 'WB_TutorialWindow2_C_Page_Up::IsScrolled' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, L_oldScrollRate) == 0x000004, "Member 'WB_TutorialWindow2_C_Page_Up::L_oldScrollRate' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_TutorialWindow2_C_Page_Up::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, CallFunc_GetScrollPosRate_ReturnValue) == 0x00000C, "Member 'WB_TutorialWindow2_C_Page_Up::CallFunc_GetScrollPosRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'WB_TutorialWindow2_C_Page_Up::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, CallFunc_GetScrollPosRate_ReturnValue_1) == 0x000014, "Member 'WB_TutorialWindow2_C_Page_Up::CallFunc_GetScrollPosRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, CallFunc_IsRequiredScroll_RequiredScroll) == 0x000018, "Member 'WB_TutorialWindow2_C_Page_Up::CallFunc_IsRequiredScroll_RequiredScroll' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WB_TutorialWindow2_C_Page_Up::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Up, CallFunc_GetScrollPosRate_ReturnValue_2) == 0x00001C, "Member 'WB_TutorialWindow2_C_Page_Up::CallFunc_GetScrollPosRate_ReturnValue_2' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.Page_Down
// 0x0020 (0x0020 - 0x0000)
struct WB_TutorialWindow2_C_Page_Down final
{
public:
	bool                                          IsScrolled;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6496[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L_oldScrollRate;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6497[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6498[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequiredScroll_RequiredScroll;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6499[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue_2;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_Page_Down) == 0x000004, "Wrong alignment on WB_TutorialWindow2_C_Page_Down");
static_assert(sizeof(WB_TutorialWindow2_C_Page_Down) == 0x000020, "Wrong size on WB_TutorialWindow2_C_Page_Down");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, IsScrolled) == 0x000000, "Member 'WB_TutorialWindow2_C_Page_Down::IsScrolled' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, L_oldScrollRate) == 0x000004, "Member 'WB_TutorialWindow2_C_Page_Down::L_oldScrollRate' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_TutorialWindow2_C_Page_Down::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, CallFunc_GetScrollPosRate_ReturnValue) == 0x00000C, "Member 'WB_TutorialWindow2_C_Page_Down::CallFunc_GetScrollPosRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'WB_TutorialWindow2_C_Page_Down::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, CallFunc_GetScrollPosRate_ReturnValue_1) == 0x000014, "Member 'WB_TutorialWindow2_C_Page_Down::CallFunc_GetScrollPosRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, CallFunc_IsRequiredScroll_RequiredScroll) == 0x000018, "Member 'WB_TutorialWindow2_C_Page_Down::CallFunc_IsRequiredScroll_RequiredScroll' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WB_TutorialWindow2_C_Page_Down::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_Page_Down, CallFunc_GetScrollPosRate_ReturnValue_2) == 0x00001C, "Member 'WB_TutorialWindow2_C_Page_Down::CallFunc_GetScrollPosRate_ReturnValue_2' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.SetTitle_byID
// 0x0020 (0x0020 - 0x0000)
struct WB_TutorialWindow2_C_SetTitle_byID final
{
public:
	const class UScriptMessageAsset*              InMessageAsset;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMessageId;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByID_self_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_SetTitle_byID) == 0x000008, "Wrong alignment on WB_TutorialWindow2_C_SetTitle_byID");
static_assert(sizeof(WB_TutorialWindow2_C_SetTitle_byID) == 0x000020, "Wrong size on WB_TutorialWindow2_C_SetTitle_byID");
static_assert(offsetof(WB_TutorialWindow2_C_SetTitle_byID, InMessageAsset) == 0x000000, "Member 'WB_TutorialWindow2_C_SetTitle_byID::InMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetTitle_byID, InMessageId) == 0x000008, "Member 'WB_TutorialWindow2_C_SetTitle_byID::InMessageId' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetTitle_byID, CallFunc_SetScriptMessageByID_self_CastInput) == 0x000010, "Member 'WB_TutorialWindow2_C_SetTitle_byID::CallFunc_SetScriptMessageByID_self_CastInput' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.SetTitle_byLabel
// 0x0020 (0x0020 - 0x0000)
struct WB_TutorialWindow2_C_SetTitle_byLabel final
{
public:
	const class UScriptMessageAsset*              InMessageAsset;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InMessageLabel;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMessageTagInterface>  CallFunc_SetScriptMessageByLabel_self_CastInput;   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_SetTitle_byLabel) == 0x000008, "Wrong alignment on WB_TutorialWindow2_C_SetTitle_byLabel");
static_assert(sizeof(WB_TutorialWindow2_C_SetTitle_byLabel) == 0x000020, "Wrong size on WB_TutorialWindow2_C_SetTitle_byLabel");
static_assert(offsetof(WB_TutorialWindow2_C_SetTitle_byLabel, InMessageAsset) == 0x000000, "Member 'WB_TutorialWindow2_C_SetTitle_byLabel::InMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetTitle_byLabel, InMessageLabel) == 0x000008, "Member 'WB_TutorialWindow2_C_SetTitle_byLabel::InMessageLabel' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetTitle_byLabel, CallFunc_SetScriptMessageByLabel_self_CastInput) == 0x000010, "Member 'WB_TutorialWindow2_C_SetTitle_byLabel::CallFunc_SetScriptMessageByLabel_self_CastInput' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.SetJustification
// 0x0001 (0x0001 - 0x0000)
struct WB_TutorialWindow2_C_SetJustification final
{
public:
	ETextJustify                                  InJustification;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_TutorialWindow2_C_SetJustification) == 0x000001, "Wrong alignment on WB_TutorialWindow2_C_SetJustification");
static_assert(sizeof(WB_TutorialWindow2_C_SetJustification) == 0x000001, "Wrong size on WB_TutorialWindow2_C_SetJustification");
static_assert(offsetof(WB_TutorialWindow2_C_SetJustification, InJustification) == 0x000000, "Member 'WB_TutorialWindow2_C_SetJustification::InJustification' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.SetMainText_byID
// 0x0018 (0x0018 - 0x0000)
struct WB_TutorialWindow2_C_SetMainText_byID final
{
public:
	const class UScriptMessageAsset*              InMessageAsset;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMessageId;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCampHelpOpened_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649B[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequiredScroll_RequiredScroll;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_SetMainText_byID) == 0x000008, "Wrong alignment on WB_TutorialWindow2_C_SetMainText_byID");
static_assert(sizeof(WB_TutorialWindow2_C_SetMainText_byID) == 0x000018, "Wrong size on WB_TutorialWindow2_C_SetMainText_byID");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byID, InMessageAsset) == 0x000000, "Member 'WB_TutorialWindow2_C_SetMainText_byID::InMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byID, InMessageId) == 0x000008, "Member 'WB_TutorialWindow2_C_SetMainText_byID::InMessageId' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byID, CallFunc_SetCampHelpOpened_ReturnValue) == 0x00000C, "Member 'WB_TutorialWindow2_C_SetMainText_byID::CallFunc_SetCampHelpOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byID, CallFunc_GetScrollPosRate_ReturnValue) == 0x000010, "Member 'WB_TutorialWindow2_C_SetMainText_byID::CallFunc_GetScrollPosRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byID, CallFunc_IsRequiredScroll_RequiredScroll) == 0x000014, "Member 'WB_TutorialWindow2_C_SetMainText_byID::CallFunc_IsRequiredScroll_RequiredScroll' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.SetMainText_byLabel
// 0x0020 (0x0020 - 0x0000)
struct WB_TutorialWindow2_C_SetMainText_byLabel final
{
public:
	const class UScriptMessageAsset*              InMessageAsset;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InMessageLabel;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMessageIdByLabel_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCampHelpOpened_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649C[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollPosRate_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRequiredScroll_RequiredScroll;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_TutorialWindow2_C_SetMainText_byLabel) == 0x000008, "Wrong alignment on WB_TutorialWindow2_C_SetMainText_byLabel");
static_assert(sizeof(WB_TutorialWindow2_C_SetMainText_byLabel) == 0x000020, "Wrong size on WB_TutorialWindow2_C_SetMainText_byLabel");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byLabel, InMessageAsset) == 0x000000, "Member 'WB_TutorialWindow2_C_SetMainText_byLabel::InMessageAsset' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byLabel, InMessageLabel) == 0x000008, "Member 'WB_TutorialWindow2_C_SetMainText_byLabel::InMessageLabel' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byLabel, CallFunc_GetMessageIdByLabel_ReturnValue) == 0x000010, "Member 'WB_TutorialWindow2_C_SetMainText_byLabel::CallFunc_GetMessageIdByLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byLabel, CallFunc_SetCampHelpOpened_ReturnValue) == 0x000014, "Member 'WB_TutorialWindow2_C_SetMainText_byLabel::CallFunc_SetCampHelpOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byLabel, CallFunc_GetScrollPosRate_ReturnValue) == 0x000018, "Member 'WB_TutorialWindow2_C_SetMainText_byLabel::CallFunc_GetScrollPosRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_TutorialWindow2_C_SetMainText_byLabel, CallFunc_IsRequiredScroll_RequiredScroll) == 0x00001C, "Member 'WB_TutorialWindow2_C_SetMainText_byLabel::CallFunc_IsRequiredScroll_RequiredScroll' has a wrong offset!");

// Function WB_TutorialWindow2.WB_TutorialWindow2_C.SetText_ReleasedKamui
// 0x00B8 (0x00B8 - 0x0000)
struct WB_TutorialWindow2_C_SetText_ReleasedKamui final
{
public:
	bool                                          IsOpenedByEvent;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InEventMsgLabel;                                   // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 InOpenedKamuiID;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FName                                   L_AnnounceMsg;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
