#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_VariousNumber

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_VariousNumber.WB_VariousNumber_C.ExecuteUbergraph_WB_VariousNumber
// 0x005C (0x005C - 0x0000)
struct WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimPackName;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_AnimationName;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimPackIndex;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_AnimationIndex;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber) == 0x000004, "Wrong alignment on WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber");
static_assert(sizeof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber) == 0x00005C, "Wrong size on WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, EntryPoint) == 0x000000, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, K2Node_Event_MyGeometry) == 0x000004, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, K2Node_ComponentBoundEvent_AnimPackName) == 0x000040, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::K2Node_ComponentBoundEvent_AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, K2Node_ComponentBoundEvent_AnimationName) == 0x000048, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::K2Node_ComponentBoundEvent_AnimationName' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, K2Node_ComponentBoundEvent_AnimPackIndex) == 0x000050, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::K2Node_ComponentBoundEvent_AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, K2Node_ComponentBoundEvent_AnimationIndex) == 0x000054, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::K2Node_ComponentBoundEvent_AnimationIndex' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, K2Node_SwitchName_CmpSuccess) == 0x000058, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber, CallFunc_Play_ReturnValue) == 0x000059, "Member 'WB_VariousNumber_C_ExecuteUbergraph_WB_VariousNumber::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_VariousNumber.WB_VariousNumber_C.BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature final
{
public:
	class FName                                   AnimPackName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimPackIndex;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000004, "Wrong alignment on WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(sizeof(WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature) == 0x000018, "Wrong size on WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature");
static_assert(offsetof(WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackName) == 0x000000, "Member 'WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackName' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationName) == 0x000008, "Member 'WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationName' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimPackIndex) == 0x000010, "Member 'WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimPackIndex' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature, AnimationIndex) == 0x000014, "Member 'WB_VariousNumber_C_BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature::AnimationIndex' has a wrong offset!");

// Function WB_VariousNumber.WB_VariousNumber_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_VariousNumber_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_VariousNumber_C_Tick) == 0x000004, "Wrong alignment on WB_VariousNumber_C_Tick");
static_assert(sizeof(WB_VariousNumber_C_Tick) == 0x00003C, "Wrong size on WB_VariousNumber_C_Tick");
static_assert(offsetof(WB_VariousNumber_C_Tick, MyGeometry) == 0x000000, "Member 'WB_VariousNumber_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_VariousNumber_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_VariousNumber.WB_VariousNumber_C.SetNumberType
// 0x0060 (0x0060 - 0x0000)
struct WB_VariousNumber_C_SetNumberType final
{
public:
	int32                                         InMode;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InType;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InParameter;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B4B[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4C[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_VariousNumber_C_SetNumberType) == 0x000008, "Wrong alignment on WB_VariousNumber_C_SetNumberType");
static_assert(sizeof(WB_VariousNumber_C_SetNumberType) == 0x000060, "Wrong size on WB_VariousNumber_C_SetNumberType");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, InMode) == 0x000000, "Member 'WB_VariousNumber_C_SetNumberType::InMode' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, InType) == 0x000004, "Member 'WB_VariousNumber_C_SetNumberType::InType' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, InParameter) == 0x000008, "Member 'WB_VariousNumber_C_SetNumberType::InParameter' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, K2Node_SwitchInteger_CmpSuccess) == 0x00000C, "Member 'WB_VariousNumber_C_SetNumberType::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WB_VariousNumber_C_SetNumberType::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'WB_VariousNumber_C_SetNumberType::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'WB_VariousNumber_C_SetNumberType::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, K2Node_MakeStruct_LinearColor) == 0x000024, "Member 'WB_VariousNumber_C_SetNumberType::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000038, "Member 'WB_VariousNumber_C_SetNumberType::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, K2Node_MakeStruct_LinearColor_1) == 0x000040, "Member 'WB_VariousNumber_C_SetNumberType::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetNumberType, K2Node_MakeStruct_LinearColor_2) == 0x000050, "Member 'WB_VariousNumber_C_SetNumberType::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");

// Function WB_VariousNumber.WB_VariousNumber_C.StartAnimation
// 0x0001 (0x0001 - 0x0000)
struct WB_VariousNumber_C_StartAnimation final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_VariousNumber_C_StartAnimation) == 0x000001, "Wrong alignment on WB_VariousNumber_C_StartAnimation");
static_assert(sizeof(WB_VariousNumber_C_StartAnimation) == 0x000001, "Wrong size on WB_VariousNumber_C_StartAnimation");
static_assert(offsetof(WB_VariousNumber_C_StartAnimation, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_VariousNumber_C_StartAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_VariousNumber.WB_VariousNumber_C.EndAnimation
// 0x0001 (0x0001 - 0x0000)
struct WB_VariousNumber_C_EndAnimation final
{
public:
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_VariousNumber_C_EndAnimation) == 0x000001, "Wrong alignment on WB_VariousNumber_C_EndAnimation");
static_assert(sizeof(WB_VariousNumber_C_EndAnimation) == 0x000001, "Wrong size on WB_VariousNumber_C_EndAnimation");
static_assert(offsetof(WB_VariousNumber_C_EndAnimation, CallFunc_Play_ReturnValue) == 0x000000, "Member 'WB_VariousNumber_C_EndAnimation::CallFunc_Play_ReturnValue' has a wrong offset!");

// Function WB_VariousNumber.WB_VariousNumber_C.SetFontColor
// 0x0028 (0x0028 - 0x0000)
struct WB_VariousNumber_C_SetFontColor final
{
public:
	int32                                         InColorType;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B4D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_VariousNumber_C_SetFontColor) == 0x000008, "Wrong alignment on WB_VariousNumber_C_SetFontColor");
static_assert(sizeof(WB_VariousNumber_C_SetFontColor) == 0x000028, "Wrong size on WB_VariousNumber_C_SetFontColor");
static_assert(offsetof(WB_VariousNumber_C_SetFontColor, InColorType) == 0x000000, "Member 'WB_VariousNumber_C_SetFontColor::InColorType' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetFontColor, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_VariousNumber_C_SetFontColor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetFontColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WB_VariousNumber_C_SetFontColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetFontColor, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'WB_VariousNumber_C_SetFontColor::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetFontColor, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000018, "Member 'WB_VariousNumber_C_SetFontColor::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetFontColor, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000020, "Member 'WB_VariousNumber_C_SetFontColor::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");

// Function WB_VariousNumber.WB_VariousNumber_C.IsAnimationEnd
// 0x0003 (0x0003 - 0x0000)
struct WB_VariousNumber_C_IsAnimationEnd final
{
public:
	bool                                          OutFinished;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_VariousNumber_C_IsAnimationEnd) == 0x000001, "Wrong alignment on WB_VariousNumber_C_IsAnimationEnd");
static_assert(sizeof(WB_VariousNumber_C_IsAnimationEnd) == 0x000003, "Wrong size on WB_VariousNumber_C_IsAnimationEnd");
static_assert(offsetof(WB_VariousNumber_C_IsAnimationEnd, OutFinished) == 0x000000, "Member 'WB_VariousNumber_C_IsAnimationEnd::OutFinished' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_IsAnimationEnd, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WB_VariousNumber_C_IsAnimationEnd::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_IsAnimationEnd, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WB_VariousNumber_C_IsAnimationEnd::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WB_VariousNumber.WB_VariousNumber_C.SetAnimeRate
// 0x0008 (0x0008 - 0x0000)
struct WB_VariousNumber_C_SetAnimeRate final
{
public:
	float                                         InRate;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_VariousNumber_C_SetAnimeRate) == 0x000004, "Wrong alignment on WB_VariousNumber_C_SetAnimeRate");
static_assert(sizeof(WB_VariousNumber_C_SetAnimeRate) == 0x000008, "Wrong size on WB_VariousNumber_C_SetAnimeRate");
static_assert(offsetof(WB_VariousNumber_C_SetAnimeRate, InRate) == 0x000000, "Member 'WB_VariousNumber_C_SetAnimeRate::InRate' has a wrong offset!");
static_assert(offsetof(WB_VariousNumber_C_SetAnimeRate, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'WB_VariousNumber_C_SetAnimeRate::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

