#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_VariousNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_VariousNumber.WB_VariousNumber_C
// 0x0038 (0x0298 - 0x0260)
class UWB_VariousNumber_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanelMain;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Number;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USsPlayerWidget*                        SsPlayerAnimation;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Numbertype;                                        // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number;                                            // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStartAnimation;                                  // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B4A[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         YPosition;                                         // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Animerate;                                         // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_VariousNumber(int32 EntryPoint);
	void Construct();
	void BndEvt__SsPlayerAnimation_K2Node_ComponentBoundEvent_1_SsWidgetEndPlaySignature2__DelegateSignature(class FName AnimPackName, class FName AnimationName, int32 AnimPackIndex, int32 AnimationIndex);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetNumberType(int32 InMode, int32 InType, int32 InParameter);
	void StartAnimation();
	void EndAnimation();
	void SetFontColor(int32 InColorType);
	void IsAnimationEnd(bool* OutFinished);
	void SetAnimeRate(float InRate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_VariousNumber_C">();
	}
	static class UWB_VariousNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_VariousNumber_C>();
	}
};
static_assert(alignof(UWB_VariousNumber_C) == 0x000008, "Wrong alignment on UWB_VariousNumber_C");
static_assert(sizeof(UWB_VariousNumber_C) == 0x000298, "Wrong size on UWB_VariousNumber_C");
static_assert(offsetof(UWB_VariousNumber_C, UberGraphFrame) == 0x000260, "Member 'UWB_VariousNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_VariousNumber_C, CanvasPanelMain) == 0x000268, "Member 'UWB_VariousNumber_C::CanvasPanelMain' has a wrong offset!");
static_assert(offsetof(UWB_VariousNumber_C, Image_Number) == 0x000270, "Member 'UWB_VariousNumber_C::Image_Number' has a wrong offset!");
static_assert(offsetof(UWB_VariousNumber_C, SsPlayerAnimation) == 0x000278, "Member 'UWB_VariousNumber_C::SsPlayerAnimation' has a wrong offset!");
static_assert(offsetof(UWB_VariousNumber_C, Numbertype) == 0x000280, "Member 'UWB_VariousNumber_C::Numbertype' has a wrong offset!");
static_assert(offsetof(UWB_VariousNumber_C, Number) == 0x000284, "Member 'UWB_VariousNumber_C::Number' has a wrong offset!");
static_assert(offsetof(UWB_VariousNumber_C, IsStartAnimation) == 0x000288, "Member 'UWB_VariousNumber_C::IsStartAnimation' has a wrong offset!");
static_assert(offsetof(UWB_VariousNumber_C, YPosition) == 0x00028C, "Member 'UWB_VariousNumber_C::YPosition' has a wrong offset!");
static_assert(offsetof(UWB_VariousNumber_C, Animerate) == 0x000290, "Member 'UWB_VariousNumber_C::Animerate' has a wrong offset!");

}

