#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LogoScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LogoScreen.WBP_LogoScreen_C
// 0x0038 (0x0298 - 0x0260)
class UWBP_LogoScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Logo_ATLUS;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_UE;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageSimpleTextWidget*               WarningMessage;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageSimpleTextWidget*               WarningMessage2;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bSkipRequest;                                      // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666E[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Progress;                                          // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProgressTime;                                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bComplete;                                         // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SkipRequest();
	void ExecuteUbergraph_WBP_LogoScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LogoScreen_C">();
	}
	static class UWBP_LogoScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LogoScreen_C>();
	}
};
static_assert(alignof(UWBP_LogoScreen_C) == 0x000008, "Wrong alignment on UWBP_LogoScreen_C");
static_assert(sizeof(UWBP_LogoScreen_C) == 0x000298, "Wrong size on UWBP_LogoScreen_C");
static_assert(offsetof(UWBP_LogoScreen_C, UberGraphFrame) == 0x000260, "Member 'UWBP_LogoScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LogoScreen_C, Logo_ATLUS) == 0x000268, "Member 'UWBP_LogoScreen_C::Logo_ATLUS' has a wrong offset!");
static_assert(offsetof(UWBP_LogoScreen_C, Logo_UE) == 0x000270, "Member 'UWBP_LogoScreen_C::Logo_UE' has a wrong offset!");
static_assert(offsetof(UWBP_LogoScreen_C, WarningMessage) == 0x000278, "Member 'UWBP_LogoScreen_C::WarningMessage' has a wrong offset!");
static_assert(offsetof(UWBP_LogoScreen_C, WarningMessage2) == 0x000280, "Member 'UWBP_LogoScreen_C::WarningMessage2' has a wrong offset!");
static_assert(offsetof(UWBP_LogoScreen_C, bSkipRequest) == 0x000288, "Member 'UWBP_LogoScreen_C::bSkipRequest' has a wrong offset!");
static_assert(offsetof(UWBP_LogoScreen_C, Progress) == 0x00028C, "Member 'UWBP_LogoScreen_C::Progress' has a wrong offset!");
static_assert(offsetof(UWBP_LogoScreen_C, ProgressTime) == 0x000290, "Member 'UWBP_LogoScreen_C::ProgressTime' has a wrong offset!");
static_assert(offsetof(UWBP_LogoScreen_C, bComplete) == 0x000294, "Member 'UWBP_LogoScreen_C::bComplete' has a wrong offset!");

}

