#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBPI_BtlCommon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBPI_BtlCommon.WBPI_BtlCommon_C.Appear
// 0x0008 (0x0008 - 0x0000)
struct WBPI_BtlCommon_C_Appear final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Immediately;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBPI_BtlCommon_C_Appear) == 0x000004, "Wrong alignment on WBPI_BtlCommon_C_Appear");
static_assert(sizeof(WBPI_BtlCommon_C_Appear) == 0x000008, "Wrong size on WBPI_BtlCommon_C_Appear");
static_assert(offsetof(WBPI_BtlCommon_C_Appear, Rate) == 0x000000, "Member 'WBPI_BtlCommon_C_Appear::Rate' has a wrong offset!");
static_assert(offsetof(WBPI_BtlCommon_C_Appear, Immediately) == 0x000004, "Member 'WBPI_BtlCommon_C_Appear::Immediately' has a wrong offset!");

// Function WBPI_BtlCommon.WBPI_BtlCommon_C.Disappear
// 0x0008 (0x0008 - 0x0000)
struct WBPI_BtlCommon_C_Disappear final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Immediately;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBPI_BtlCommon_C_Disappear) == 0x000004, "Wrong alignment on WBPI_BtlCommon_C_Disappear");
static_assert(sizeof(WBPI_BtlCommon_C_Disappear) == 0x000008, "Wrong size on WBPI_BtlCommon_C_Disappear");
static_assert(offsetof(WBPI_BtlCommon_C_Disappear, Rate) == 0x000000, "Member 'WBPI_BtlCommon_C_Disappear::Rate' has a wrong offset!");
static_assert(offsetof(WBPI_BtlCommon_C_Disappear, Immediately) == 0x000004, "Member 'WBPI_BtlCommon_C_Disappear::Immediately' has a wrong offset!");

// Function WBPI_BtlCommon.WBPI_BtlCommon_C.IsDisappeared
// 0x0001 (0x0001 - 0x0000)
struct WBPI_BtlCommon_C_IsDisappeared final
{
public:
	bool                                          Param_IsDisappeared;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBPI_BtlCommon_C_IsDisappeared) == 0x000001, "Wrong alignment on WBPI_BtlCommon_C_IsDisappeared");
static_assert(sizeof(WBPI_BtlCommon_C_IsDisappeared) == 0x000001, "Wrong size on WBPI_BtlCommon_C_IsDisappeared");
static_assert(offsetof(WBPI_BtlCommon_C_IsDisappeared, Param_IsDisappeared) == 0x000000, "Member 'WBPI_BtlCommon_C_IsDisappeared::Param_IsDisappeared' has a wrong offset!");

// Function WBPI_BtlCommon.WBPI_BtlCommon_C.CallTick
// 0x0004 (0x0004 - 0x0000)
struct WBPI_BtlCommon_C_CallTick final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBPI_BtlCommon_C_CallTick) == 0x000004, "Wrong alignment on WBPI_BtlCommon_C_CallTick");
static_assert(sizeof(WBPI_BtlCommon_C_CallTick) == 0x000004, "Wrong size on WBPI_BtlCommon_C_CallTick");
static_assert(offsetof(WBPI_BtlCommon_C_CallTick, Delta) == 0x000000, "Member 'WBPI_BtlCommon_C_CallTick::Delta' has a wrong offset!");

}

